{
  "name": "Casting Crystals",
  "icon": "scriptor:casting_crystal",
  "category": "scriptor:advanced",
  "pages": [
    {
      "type": "patchouli:text",
      "text": [
        "Casting Crystals are used, to simplify, to change the \"self\" target of a Casting Lectern. ",
        "This entry includes mechanical details. ",
        "See $(l:advanced/crystals)this crafting page$(/l) for more details on crafting.",
        "$(br2)",
        "When right-clicked onto a Casting Lectern, a Casting Crystal will modify the \"self\" ",
        "target of cast spells. Kind of."
      ]
    },{
      "type": "patchouli:text",
      "text": [
        "Specifically, spells cast from an affected Casting Lectern will be cast from the Lectern, ",
        "but effects that target the inventory, and effects which target self during spell resolution ",
        "will be redirected to the target of the focus crystal.",
        "$(br2)",
        "For instance, a teleport projectile would still fire out of the back of a Lectern, but when ",
        "it collides with a target, the target would be teleported to the target of the Crystal.",
        "$(br2)",
        "Casting Crystals will only redirect targets within 16 blocks of the Lectern."
      ]
    },
    {
      "type": "patchouli:text",
      "anchor": "player",
      "title": "Players",
      "text": [
        "One type of Casting Crystal is the Player-Focused Crystal. ",
        "This is used to focus on a specific player. ",
        "See $(l:advanced/crystals#player)the crafting page$(/l) for more details on crafting.",
        "$(br2)",
        "Right-clicking while holding an unbound Player-Focused Crystal will cause the crystal ",
        "to target you. ",
        "While you are targeted and within 16 blocks of the Casting Lectern, you will be treated ",
        "as the \"self\" target for most purposes."
      ]
    },
    {
      "type": "patchouli:text",
      "anchor": "coordinates",
      "title": "Coordinates",
      "text": [
        "Another type of Casting Crystal is the Coordinate-Focused Crystal. ",
        "This is used to focus on one or more sets of in-world coordinates. ",
        "See $(l:advanced/crystals#coordinates)the crafting page$(/l) for more details on crafting.",
        "$(br2)",
        "Right-clicking on a block while holding a Coordinate-Focused Crystal with 4 or less ",
        "coordinates saved will add the $(l)block behind the clicked block and the opposite face ",
        "of the one you clicked$() to the Coordinate list. ",
        "This effectively targets the clicked block on the face you clicked for most spells, but ",
        "this distinction can be important to keep in mind.",
        "$(br2)",
        "Only coordinates within 16 blocks of the Casting Lectern will be targeted by it."
      ]
    }
  ]
}