{
  "block.hexkeys.mindscape_barrier": "Barrier of Mind",
  "hexcasting.spell.hexkeys:library": "Library Key",
  "hexcasting.spell.hexkeys:visit_library": "Visitor's Key",
  "hexcasting.spell.hexkeys:create_library_key": "Morpheus's Reflection",
  "hexcasting.spell.hexkeys:kleins_chest": "Klein's Chest",
  "hexkeys.entry.klein_storage": "Klein Storage",
  "hexkeys.entry.visit_mindscape": "Mindscape Visitation",
  "hexkeys.entry.mindscape": "Mindscape Library",
  "container.kleins_chest": "Klein's Chest",
  "hexkeys.page.kleins.1": "I seem to have found a way to convert matter into pure media while keeping its inherent properties. Sadly, it appears there is a limit to the number of items I can store in my own mind as there's only so much room up there. I call this unique form of storage the Klein chest as it's a space within my own mind that seems to empty just as much as it fills.",
  "hexkeys.page.kleins.open": "The cost of using this mental storage is an amethyst shard plus a quarter of an amethyst dust per slot filled. It takes a surprisingly large amount of mental energy to recall things that shouldn't be there in the first place.",
  "hexkeys.page.kleins.2": "I can feel it itching at the front of my mind... always itching... I know this discovery may lead to great convenience, but I wonder if I could use it to sooth my strained and broken mind... I'll have to decide later, I have an itch to scratch.",
  "hexkeys.page.mindscape.1": "I did it! It took more power than any being should have a right to hold, but I did it. I opened my mind to the physical world, in turn, it took on a physical form. A library of sorts. I'll call it the mindscape. A place to facilitate the interactions between my mind and the world around me. This place is mine and mine alone. The mindscape is my creation and for all intents and purposes, I'm its deity. I can soar freely in this space and modify it to my liking. Sadly despite my unrivaled power in my mental world, I was forced to encase the library in a barrier of sorts. I could feel that my mind wasn't ready for the things lurking outside in this expanse of physical and mental. Maybe I could remove this restriction in the future, but it's in my best interest to maintain it for now.",
  "hexkeys.page.mindscape.open": "It started with a crack... A small thing really. I felt a light breeze from it that told me things. I'm now certain that every mind has some form of physical representation. I just need to get there. If only I could push that crack wider...",
  "hexkeys.page.mindscape.2": "Extra Desc. Coming Soon(tm)",
  "hexkeys.page.visit_mindscape.1": "Recently I've wondered if there was a way to enter the minds of my enemies. Sadly that seems like a very dangerous thing to do. After all my effort I've developed a method to enter and leave different minds at will regardless of location, but first I need a key. A signature that will tell me where to go. Without proper direction it's possible to become separated from my own mind in very dangerous ways.",
  "hexkeys.page.visit_mindscape.visit": "I should also keep in mind that this method only seems to work on those like myself. Those of us who have \"opened\" our minds to the realm around us.",
  "hexkeys.page.visit_mindscape.2": "To share the identity of my own mindscape I'll need an identifier or key. A signature. But who will verify this signature? The very cognitive plane itself. This pattern will burn the identity of my minscape or cognitive library into the very fabric of the mental world. This signature can be shared with those willing to delve into my own mind... at their own risk.",
  "hexkeys.page.visit_mindscape.key": "",
  "sounds.hexkeys.bonk": "Bonk",
  "sounds.hexkeys.bonk2": "Rare Bonk",
  "advancements.enter_the_mindscape.title": "It's so empty...",
  "advancements.enter_the_mindscape.description": "You can't believe how empty your mind is... perhaps you could fill it?",
  "hexcasting.mishap.not_a_mindscape_key": "Visitor's Key expected a reference to someone's Library!",
  "hexcasting.mishap.mindscape_doesnt_exist": "The Library you are trying to visit doesn't exist!"

}