{
    "name": "Essential Resources",
    "icon": "roots:wildroot",
    "category": "basics",
    "advancement": "roots:root",
    "sortnum": 5,
    "pages": [
      {
        "type": "text",
        "text": "Druids need access to various natural resources to produce their magical effects. This includes magical herbs, each of which have ties to nature in different ways. Discovering a herb will unlock many mysteries hidden in nature, and provide access to new tools, spells and rituals for the aspiring druid."  
      },
      {
        "type": "text",
        "title": "Mundane",
        "text": "Other resources are far more mundane, but still critical to unlocking the full potential of the natural arts. Resources like $(l:resources/bark)bark$() and $(l:resources/aubergine)aubergine$() allow a druid access to the energies of nature itself. All of these resources are documented within this book."
      },
      {
        "type": "spotlight",
        "item": "minecraft:farmland",
        "title": "Renewables",
        "text": "Almost every resource a druid has access to is a renewable one. Wildroot and almost every herb you discover $(info) can be planted and grown on farmland, although those herbs which touch the elemental plains require special support."
      },
      {
        "type": "spotlight",
        "title": " ",
        "item": "minecraft:mossy_cobblestone",
        "text": "Even with resources that might seem tedious to obtain, an insightful druid might discover a ritual, spell or other process that allows for their creation. As always, be open to new ways of learning and explore every option available until you are certain you have exhausted everything."
      },
      {
        "type": "text",
        "title": "When at a loss",
        "text": "Worry not! You may find in this book $(l:basics/letter)a letter written to you$() from a fellow druid which outlines the ways they overcame obstacles similar to the ones you might face."
      },
      {
        "type": "relations",
        "entries": [
          "basics/letter",
          "basics/introduction",
          "rituals/ritual_overgrowth",
          "rituals/ritual_germination",
          "spells/spell_harvest",
          "spells/spell_growth_infusion",
          "spells/spell_rampant_growth",
          "apparatus/elemental_soil"
        ]
      }
    ]
  }