{
  "tooltip.hexerei.crystal_ball_shift": "WIP for uses for infusing or scrying",
  "tooltip.hexerei.candle_shift": "Candles will provide different benefits based on herbs infused. (WIP)",
  "tooltip.hexerei.candle_shift_2": "Can be matched in the same spot with other colored Hexerei candles.",
  "tooltip.hexerei.candle_shift_3": "Each candle can be lit individually.",
  "tooltip.hexerei.keychain_with_item": "You can overwrite the item attached with the same method.",
  "book.hexerei.items_index_page_1.passage_2": "  This chapter will be all about items and how you obtain them and what you do with them. If you click on another item on a page and if it has a page attached to that item the book will quickly turn it's pages there!",
  "book.hexerei.items_index_page_2.passage_1": "Item Index Page",
  "book.hexerei.items_mixing_cauldron_1.passage_2": "  The Mixing Cauldron is one of the main tools in the witches arsenal.",
  "book.hexerei.items_mixing_cauldron_3.passage_1": "  You are able to toss items into the cauldron from the top to fill the slots as well as use any item transporting block (ie. hoppers) to pump items in. It also has a GUI that you can access where you can place and take items.",
  "book.hexerei.items_mixing_cauldron_4.passage_1": "  You can click the center to access the JEI recipes. While scrolling through JEI you can now click the transfer button to transfer over your items for easy crafting.\n\n  The slot on the left is for Sigils, right now its only one which is the Blood Sigil. ",
  "book.hexerei.items_mixing_cauldron_5.passage_1": "  The cauldron can hold any kind of fluid up to two buckets. Fluid can be pumped in with other mods pipes. You can also use bottles on the base liquids and ones from this mod in the cauldron. \n  Although it seems like it would burn items when in lava but in fact they do stay safe.",
  "book.hexerei.items_mixing_cauldron_6.passage_1": "  All of these fluids are used in some way in the cauldron. Along with the fluid being used in crafting inside the cauldron it can also be used by the Dipper item which is placed on top of the cauldron. ",
  "book.hexerei.items_altar_1.passage_1": "Altar",
  "book.hexerei.items_altar_1.passage_2": "  The Altar will be used for not just reading the book on, but can be used for decoration as you can place any item down on the altar, and a special surprise for anything that can be potted that is placed onto the altar.",
  "book.hexerei.items_willow_broom_1.passage_2": "  A witches main tool of transportation, the broom. So far there are two types of brooms, this one being the lesser of the two. These can be upgraded in 3 different slots, Misc, Satchel, and Brush. A brush is what powers the brooms flight and comes with every fresh broom made.",
  "book.hexerei.items_mahogany_broom_1.passage_2": "  The faster of the two brooms. The mahogany broom as an item also has fire resistance so it cannot be lost in lava or burn to fire. Although, it can break when flying the broom into fire, unless the broom has a netherite tip attachment."
}