{
    "name": "Spawner Modifiers",
    "icon": "minecraft:clock",
    "category": "apotheosis:spawner/spawner",
	"flag": "apotheosis:spawner",
	"sortnum": 1,
    "pages": [
        {
            "type": "patchouli:text",
            "text": "After reading about $(l:apotheosis:spawner/stats)Spawner Stats$(), you may be wondering how to change them.$(p)Enter $(9)Spawner Modifiers$(), a system to edit spawners.$(p)A modifier consists of up to two items, and produces a certain change in a spawner's stats."
        },
		{
            "type": "patchouli:text",
			"title": "Viewing Modifiers",
            "text": "Every single modifier is visible in JEI.$(p)They can be accessed by looking at both the uses and recipes for $(9)Mob Spawners$(), or the uses for the modifier items.$(p)There's a lot of tooltips in there, so look around."
        },
		{
            "type": "patchouli:text",
			"title": "Notation",
            "text": "In JEI, stat changes are noted as$(br)$(9)+/- X Stat$().$(p)Some stats do not have numerical values, so they will be shown as $(9)+/- Stat$().$(p)In tooltips, non-numeric stats are not shown unless enabled."
        },
		{
            "type": "patchouli:text",
			"title": "Modifier Caps",
            "text": "Certain modifiers cannot reduce or increase stats past a certain value.$(p)These will be noted in the tooltip for that particular stat in JEI.$(p)These caps are modifier-specific, so one modifier may have a different cap than another for the same stat."
        },
		{
            "type": "patchouli:text",
			"title": "Applying Modifiers",
            "text": "To apply a modifier, simply hold the respective items in your hands, and right-click the $(9)Mob Spawner$().$(p)If the modification is successful, the items will be consumed.$(p)The main item is always consumed, but the secondary item may not be."
        },
		{
            "type": "patchouli:text",
            "text": "Even though JEI states that items must be held in particular hands, that is not required.$(p)You can apply a modifier as long as you are holding the items in your hands, regardless of which hand."
        }
	]
}