{
    "title": "Extra Utilities 2 使用手册",
    "author": "RWTema",
    "pages": [
        {
            "title": "介绍",
            "text": "本Mod仍在开发中，版本更新还会不断持续。因此，部分物品/方块并未完成，且/或在未来有所变动。如有风险，概不负责。"
        },
        {
            "title": "能量网",
            "text": "Extra Utilities 2 提供了一个被动式能量系统。它按照如下规则运作：\n\n 1.你不需要燃料，每个发电机都是被动地从环境中生产能量的。\n 2.没有线缆。你可以随处摆放发电机和用电器，甚至跨维度，它们都会自动接入玩家的能源网络.\n 3.网络是私有的，每个能量网络都是对每个玩家独立的。能量网络不能从玩家上分离，但是两个玩家之间可以分享能量网（待实现）。\n4.能量不能储存——只能消耗或浪费掉。\n5.若能量不足，所有设备会拒绝工作。"
        },
        {
            "title": "能源共享",
            "text": "如果愿意，一群人也可以共享他们的能源网络。使用命令 /xu_powesharing 以确认要同哪个玩家共享网络。如果他们确认要共享的话，你们的网络会被合并。"
        },
        {
            "entry": "PassiveGenerator",
            "meta": 7,
            "text": "最简单的产生能量的方法。只要玩家动手转动红石齿轮就会生成GP。并不符合可持续发展的观念，但是足以让玩家驱动谐振器以制造更复杂物品所需的材料。"
        },
        {
            "entry": "PassiveGenerator",
            "meta": 0,
            "text": "太阳能板是最简单的GP发电机。若不是因为青金石，它的制作并不复杂。但它们在夜晚不工作。"
        },
        {
            "entry": "PassiveGenerator",
            "meta": 1,
            "text": "月亮能板只在夜晚工作，据此可用来弥补太阳能板的不足。"
        },
        {
            "entry": "PassiveGenerator",
            "meta": 2,
            "text": "当放在熔岩旁时产生GP。此举不消耗熔岩。"
        },
        {
            "entry": "PassiveGenerator",
            "meta": 3,
            "text": "利用其每个面旁边的流动水来产生GP。重复，是流动水，不是静止水。另外它本身不消耗水。"
        },
        {
            "entry": "PassiveGenerator",
            "meta": 4,
            "text": "利用风能来产生GP。风速会随时间变化而变化。"
        },
        {
            "entry": "PassiveGenerator",
            "meta": 5,
            "text": "当放在火上的时候产生GP。"
        },
        {
            "entry": "Resonator",
            "text": "共振器从你的个人网络中收集能量，并慢慢地注入物品中。共振器生产的部件将用于制造更高级的机械。"
        },
        {
            "entry": "sunCrystal",
            "text": "通过将萤石粉抹在钻石上，并让它暴露于阳光直射下，奇怪的反应产生了。宝石开始发出一种奇怪的“幽光”，更不可思议的是这种光能穿透固体的墙，而且比原来的光传播的更远。也许你可以利用这种能量。"
        },
        {
            "entry": "wateringCan",
            "text": "植物生长需要泥土、水、光和爱。这个洒水壶能够提供少量的水，和大量的工业级别的爱。\n制作一个空的洒水壶，然后对着水源右击以灌水。然后你能按住右键以对3*3范围内的植物浇水。"
        },
        {
            "entry": "ItemBuildersWand",
            "text": "当你右击一个方块时，它会检查你的背包以确认是否有同种的方块。然后它就会尝试将这些方块在当前层的基础上再铺一层，铺的方向取决于你右击了方块的哪一面，最多一次铺9个方块。"
        },
        {
            "entry": "ItemDestructionWand",
            "text": "[TODO - 施工中]"
        },
        {
            "entry": "soundMuffler",
            "text": "你有开过一个羊圈的经历吗？若有，那些大声打着呼噜的羊们是不是让你恶心到只想让它们立刻都闭上嘴巴？好吧，现正式推出一款全新设备，能削弱半径8个方块内90%的声音，让你能够享受片刻的宁静。"
        },
        {
            "entry": "enderLilly",
            "text": "末影百合是一种古代出现过的植物，而它们的种子现在只能在地牢里找到了。这植物长得令人难以置信的慢，要大约一周的时间才能成熟，当它们成熟时即可收获一个末影珍珠。当心这植物长大后长出的荆棘。"
        },
        {
            "entry": "trashcan",
            "text": "如果你在为你充满了各种不要的垃圾的背包而受苦，这个简单的方块提供了一种快速有效的处理方法。"
        },
        {
            "entry": "angelBlock",
            "text": "当你在创造模式下想要在半空中建筑，或是要在远离陆地的海洋上建造家园时，这个方块就是你的最佳拍档——因为，只要在空气中右击，一个方块就会出现在你面前。"
        },
        {
            "entry": "RedstoneClock",
            "text": "这个简单便宜的钟会每秒发射一次红石脉冲。要关闭，通入红石信号即可。"
        },
        {
            "entry": "goldenLasso",
            "text": "当你用小麦引诱牛和羊的时候是否曾感到过灰心丧气？用黄金套索右击任何被动型生物就会把它魔法般地抓进套索。然后对地面右击就能再放出来。这个简单的工具使得移动动物变得简单许多了。\n诅咒套索是一种更加危险的套索，而它们能够抓住非Boss的怪物。但是要抓的怪物的血量必须被压到一个较低的水平，然后才能够被套索抓住。"
        },
        {
            "entry": "compressedCobblestone",
            "text": "是否曾有成箱的圆石环绕着你，而你只想用几个物品槽就能把它们存起来？ - 好吧现在你可以了。在工作台里放九个圆石便可合成压缩圆石。然后放置九个压缩圆石在工作台里便可合成二重压缩圆石。如此重复你最终能获得八重压缩圆石。"
        },
        {
            "entry": "GlassCutter",
            "text": "这个工具是用来切玻璃的（震惊脸）。它可以精准采集任何“玻璃材质”的方块。"
        },
        {
            "entry": "enderShard",
            "text": "刺穿末影珍珠滑而脆的表面通常会令其解体，但若用锋利的玻璃切割刀就能获得仍具有末影特性的碎片。"
        },
        {
            "entry": "BagOfHolding",
            "text": "这个手提包可让你随身携带大量物品。右击可打开其物品栏。"
        },
        {
            "entry": "RedOrchid",
            "text": "红石充满了能量，但是它们并不富含营养。然而，有种植物已经能进化到在红石矿石上生长，那就是红石兰。\n成熟后，它就会将周围一小部分石头粉末转化为可收获的红石粉末。成熟后它们会发射红石信号。"
        },
        {
            "entry": "angelRing",
            "text": "让你飞上天[todo]"
        },
        {
            "entry": "screen",
            "text": "显示图片[todo]"
        },
        {
            "entry": "ChunkLoader",
            "text": "当供能时持续加载周围3*3的区块。"
        },
        {
            "entry": "book",
            "text": "你在读的便是。"
        },
        {
            "entry": "Boomerang",
            "text": "这充满魔力的回旋镖总是会飞回来。右击以扔出，在击中墙或怪物前回旋镖都会一直向前运动，然后它就会返回到玩家所在处（如有必要也会穿墙）。在返程的路上它会收集掉落物和经验并把它们送回给玩家。你可以用滞留型药水同回旋镖合成以对任何击中的怪物附加药水效果，但这药水效果是有一定“耐久”的，当耐久没了以后药水效果也会消失，需要重新填充。还有一些附魔是专为回旋镖设计的。"
        },
        {
            "entry": "Wrench",
            "text": "扳手能让你改变方块和机器的设置。"
        },
        {
            "entry": "CursedEarth",
            "text": "用恶魔液滴（凋零骷髅的稀有掉落物）右击一泥土或草方块即可生成“诅咒之土”。在黑暗中，这邪恶的泥土会无视玩家距离生成怪物。比起普通的怪物，生成的怪物带有“黑暗光环”而使它们更加的强大，但这效果会在一分钟后消失。火焰是大范围摧毁诅咒之土的最佳方法。"
        },
        {
            "entry": "Scanner",
            "text": "一个探测器会持续检测面朝它的这个方块是否符合预设，如果是的话它就会发射红石信号。"
        },
        {
            "entry": "Crafter",
            "text": "给这个方块设定一个配方，它就会用内置物品栏内的物品合成目标物品，并把它放在内置物品栏里。如果有东西缺失，它就会尝试从周围的容器内拉取物品。你可以把合成器连成链以完成更复杂的合成。"
        },
        {
            "entry": "User",
            "text": "这个方块会尝试在世界中使用它物品栏内的物品（如果没有物品的话就是单纯地空手“右击”）。通过其GUI, 你可以配置它的行为以让它精确完成你交给它的任务。"
        },
        {
            "entry": "Miner",
            "text": "挖掘机会立刻挖掘它面前的任何方块，并将掉落物放在它的内部缓冲区。你还可用附魔书来为它添加附魔效果。"
        },
        {
            "entry": "pipe",
            "text": "传输管道是传输系统的构成方块。把它们放置在世界中，节点可以通过它们来传输物品和流体。右击一个连接可以把它设置为单向的，这意味着物品只能单向通过。如果两个连接都是单向的那么它们就不会连接。"
        },
        {
            "entry": "Grocket",
            "title": "传输节点",
            "text": "如果一个传输节点连接到了适宜的方块，它就会从其内部抽出物品或流体并通过运输管道寻找合适的方块以向其输入。你可以使用升级以改进它的表现，但这样做需要GP作为能量。你还可以增加过滤器以控制它交互的物品。"
        },
        {
            "entry": "Grocket",
            "title": "输入节点",
            "text": "输入节点和传输节点正好相反。它们会从传输管道抽出内容物并将它们输入相连接的合适的方块。"
        },
        {
            "entry": "Grocket",
            "meta": 1,
            "text": "过滤器可以用于更好的控制用传输节点传输什么物品/流体进入容器。把它们放在容器上那么通过传输管道传输的任何物品都会看它行事。"
        },
        {
            "entry": "Filter",
            "text": "这个过滤器可以用于匹配特定的物品。如果任意物品同标记槽内的物品匹配，那么它们就会被匹配。你可以在匹配槽内放置已匹配的过滤器以叠加它们的过滤内容。"
        },
        {
            "entry": "FilterFluids",
            "text": "这是过滤器的液体版。你可以用桶或别的液体容器在匹配槽内来声明细节。"
        },
        {
            "entry": "PlayerChest",
            "text": "玩家箱子可以提供同你个人背包的魔法般的连接。物品可以远程地从你的背包内输入/输出。你必须配置箱子以决定你背包中的何格可以被输入/输出以开始（默认都不行）。其他玩家也可以右击此方块来访问你的背包。"
        },
        {
            "entry": "Indexer",
            "text": "如果你将索引器同一个传输管道系统连接在了一起，它就会扫描并列出所有可以输出的物品。左击物品就会发送请求，然后索引器就会抽出一个物品(如果可行的话)并放在它的内部存储空间内。Shift+左击会请求一组物品，但是它一次还是只能抽出一个物品。另外，索引器有个返回槽，在这些槽内的物品可以被输出并正确地放入管道系统中。"
        },
        {
            "entry": "IndexerRemote",
            "text": "这个遥控器允许你在世界的每个角落打开索引器的GUI。对着索引器右击以与你的遥控器绑定。"
        },
        {
            "entry": "Indexer",
            "title": "索引器：JEI支持",
            "text": "如果你装了JEI的话你就可以用搜索文本框以筛选你想要的东西。另外，如果你想要合成一样东西，你可以右击＋号以尝试将所有需要的合成原料请求到索引器内。"
        },
        {
            "entry": "potion_second_chance",
            "text": "如果一个玩家在复活效果下承受了致死的伤害，他们就会立刻被治疗到满血。此后，复活buff会消失，同时会给予玩家一个虚弱效果。在一条命中能且只能触发一次。"
        },
        {
            "entry": "potion_love",
            "text": "对一群动物扔喷溅型爱情药水就会让它们进入繁殖期（如果可以的话）。对玩家无效果。"
        },
        {
            "entry": "potion_gravity",
            "text": "重力药水会把任何飞在天上的生物或玩家强行拉回地面。药水的效果同离地面的高度成正比。"
        },
        {
            "entry": "potion_fizzy_lifting",
            "text": "漂浮药水会让你飘起来。"
        },
        {
            "entry": "potion_greek_fire",
            "text": "永恒之火会让玩家或怪物着火。这火焰会一直烧下去，直到药水效果消失。"
        },
        {
            "entry": "potion_relapse",
            "text": "复发药水会阻止玩家治疗负面效果。如果玩家治愈了一个负面效果，那么这个效果会马上死灰复燃，但是时长会被缩短。"
        },
        {
            "entry": "villager_red_mechanic",
            "text": "这些带着红色绳子的村民崇拜红石和GP能量网，相信着它会给它们超人的能量。谁知道这是不是真的，但他们总会乐意传播自己的宗教制品。"
        },
        {
            "entry": "villager_alchemist",
            "text": "酿造艺术的狂热爱好者。这些学者乐于运用它们的知识和智慧来创造并销售强力的药水；如果原料短缺的话，它们也许也会用绿宝石买现成的药水。有趣的是：它们的胡子是用线挂起来的假货。"
        },
        {
            "entry": "villager_shady_merchant",
            "text": "这些可疑的村民看起来总有好东西出售，但在谈起它们的来历时他们却总是遮遮掩掩。如果你是个警察，你得去告诉它们，“这是规矩”。"
        }
    ]
}