{
    "name": "一封德鲁伊的遗信",
    "icon": "minecraft:paper",
    "category": "basics",
    "advancement": "roots:root",
    "priority": true,
    "sortnum": 2,
    "pages": [
      {
        "type": "text",
        "title": "致同行者,",
        "text": "白手起家，并非易事。如天时而地利，与自然和谐共处似顺风顺水；可当日落西山，夜幕垂笼，自然，却将变得极难于窥测。$(br2)你的工具大可以任你操使，但请谨记：秉承责任之心，崇敬自然万物！"
      },
      {
        "type": "crafting",
        "recipe": "roots:assorted_seeds",
        "text": "欲望是人的天性，饥饿则是欲望最原始的根源。无论处境多么艰难，那一捧微微焙烤过的种子，总能给你最简单的安慰与寄托。"
      },
      {
        "type": "text",
        "title": "野根",
        "text": "我对$(l:herbs/wildroot)野根$()有着较为深入的研究，这一奇异的，魔力充盈的根茎可能杂乱地生长在地里，也可能潜匿在繁密的高草丛之间。$(br2)许久以前，它曾是一种名为“野木”的巨树之根。虽再也无法在这片大地上得见当年野木，但它留存于世的根茎却仍生机盎然。$(br2)与其它作物一样，野根可以在潮湿的耕地中生长。"
      },
      {
        "type": "crafting",
        "recipe": "mysticalworld:stuffed_aubergine",
        "title": "茄子",
        "text": "$(l:resources/aubergine)茄子$()，这种不起眼的植物，既可单独烹制，亦可与其它其它蔬菜结合，细细烹调，亦为美味佳肴。$(br2)它所蕴藏的魔力较为微弱，但仍会是一些咒术及仪式中不可或缺的一员。与野根一样，茄子也可以种植与耕地上。"
      },
      {
        "type": "text",
        "title": "大地苔藓孢子",
        "text": "这种$(l:herbs/terra_moss)奇异的孢子$()藏匿在高草之中，水汽可以使得它快速生长。当其长成为苔藓后，你便可以用小刀将其轻轻刮下；单是将其拿在手心，你就能感觉到其中所蕴藏的魔法能量。$(br2)当然，你无需担心这一过程会耗费过多的时间，因为有着特定的仪式可以让你迅速获得这些苔藓，该仪式为$(l:rituals/ritual_overgrowth)过度生长$()仪式，它将会在合适的石头上生成苔藓，方便刮取。"
      },
      {
        "type": "text",
        "title": "其它作物",
        "text": "不必担心那些普通作物占据了你过多的田地，将其带回厨房精心制作，这些食物也能满足你的口腹之欲；同时，当你于草木山川之中游历时，你也能发现一些和你有着类似苦恼的人，只要你手头的货物是他们所需要的，它们就不会吝惜口袋中的钱财。$(br2)一个精心照料的田地总是能为你源源不断地产出收益，而为了守卫田地的和平宁静，你需要找到一些$(l:apparatus/runestone)能够驱逐那些试图入侵田地的怪物的方法$()。"
      },
      {
        "type": "text",
        "title": "其它德鲁伊",
        "text": "的确，在旅途中，你可能会找到一些与你在德鲁伊艺术之路上有着相同目标，但所研之精深还在你之上的德鲁伊，这些德鲁伊可能会愿意用一些关键物品以及资源来交换你手头的货物。$(br2)这一交换可能会在资源上给你一定的帮助，甚至如果你在早期就获得了这些资源，这些资源还有可能为你解锁新的想法和概念。有些德鲁伊甚至还有可能掏出传家宝与你进行交易！"
      },
      {
        "type": "text",
        "title": "稀有资源",
        "text": "在深入研究了咒术以及仪式的相关知识之后，我发现有一些咒术消耗的资源尤其昂贵，有些于热带的悬崖峭壁傲然而立，有些则生长于潮湿闷热的沼泽，而有些则蛰伏于干旱至极的沙漠之中。$(br2)年老体衰的我已不足以完成一次漫长的旅途，但我曾听说$(l:rituals/ritual_transmutation)有些仪式可以通过操纵符文石，将一种资源转换为另一种$()。$(br2)然而，我却从未找到过有关这种仪式的详细文本。"
      },
      {
        "type": "text",
        "text": "如我所言，时光之痕遍布我身，流逝的时光犹如一个封闭的圆圈，而这一圆圈暗示了我的生命循环也要迎来了终结。$(br2)孤身一人，有时我无法忍受作物成熟的漫长等待，在这种时候，我多么希望我能有一种可以对所有的作物都起效的肥料，这样不就不必陷入苦苦等待之中了。$(br2)在这些需求的驱使下，我发现了$(l:spells/spell_growth_infusion)生机灌注咒术$()对这种情况尤为适用，尽管用多了之后，这一方法也十分单调乏味。"
      },
      {
        "type": "text",
        "text": "我这还留有了一些文本，其中的一部分是关于如何利用咒术以及仪式来催生田地以及树林，而另一部分讲解了如何采收那些生长出来的资源，但这些内容之深奥玄妙超出了我的能力范围。只希望你能在这条路上走的比我更远。$(br2)我还有一言：保持信心！如果你感到前途暗淡，亦或者我所说的无法助你解开困局，请你再往回检查一下，是否每条研究道路的内容都被你钻研通透了。$(br2)尝试制作一些新的药草，这或许会给你新的启发。"
      },
      {
        "type": "text",
        "text": "一路顺风，我的朋友！尽管我不能亲自看着你如何一步步成长，然而我却也知道，即便是在最黑暗的时刻，总会有光，总会有知识，以一种我无法理解的形式出现你眼前，为你展开一片新的天地。$(br2)$(br2)- $(o)署名已模糊不清$()"
      },
      {
        "type": "empty"
      }
    ]
}