{
  "name": "Introduction to Modifiers",
  "icon": "minecraft:writable_book",
  "category": "spells",
  "priority": true,
  "sortnum": 2,
  "pages": [
    {
      "type": "text",
      "text": "The creation and management of spells is a complicated system to understand, and divided into multiple chapters.$(li)$(l:spells/introduction)The first introduction covers basic concepts, including imbuing.$()$(li)this chapter covers the mechanics of imposing modifiers$()$(li)$(l:spells/modifiers)The functional uses of modifiers and spells$()$(li)$(l:spells/library)The mechanics of the spell library and its uses$()."
    },
    {
      "type": "text",
      "text": "Spells each have a unique function. This function can be modified or augmented with modifiers. This section will discuss the process of applying modifiers using an imposer.$(br2)$(warning) For modifier costs and other functionality, see $(l:spells/modifiers)this entry$().$(br2)$(info) $(l:spells/introduction2#unlock)Unlocking$() modifiers is permanent for all your staffs."
    },
    {
      "type": "crafting",
      "title": "Imposers",
      "anchor": "imposer",
      "recipe": "roots:imposer",
      "text": "Inserting a staff into the imposer ($(l:spells/library)with spells selected$()) allows you to both insert modifiers globally and enable them for this staff.$(br2)$(info) Right-click an imposer with staff inside with a $(l:crafting/knives)knife$() to open the interface."
    },
    {
      "type": "image",
      "title": "Imposer: Spell Select",
      "images": ["roots:textures/gui/patchouli/imposer_spell_select.png"],
      "text": "The initial Imposer interface: click a spell to modify it."
    },
    {
      "type": "image",
      "title": "Imposer: Modifier Editing",
      "images": ["roots:textures/gui/patchouli/imposer_modifier_edit.png"],
      "text": "After clicking on a spell. [Player inventory present but not shown.]"
    },
    {
      "type": "text",
      "title": "Modifier Editing",
      "text": "As seen in the screenshots, you can click on a spell to open the modifier editing screen. The button labeled 'Back' will return you to the spell selection screen.$(br2)Colour of the border around the modifier, as well as the tooltip, $(l:spells/introduction2#colours)provide information.$()$(br2)$(info) A greyed-out square means that no modifier exists for this herb."
    },
    {
      "type": "text",
      "title": "Modifier Unlocking",
      "anchor": "unlock",
      "text": "The process of unlocking a modifier is a simple one. It requires that you have the relevant herb in your inventory when you access the imposer.$(br2)$(info) Either shift-click the herb to automatically fill the slot, or click it into the slot.$(br2)$(info) Once unlocked, this modifier is permanently unlocked in your spell library and all staffs you open."
    },
    {
      "anchor": "colours",
      "type": "text",
      "title": "Colour & Tooltip",
      "text": "Yellow colouring and tooltip of 'Modifier not unlocked' mean the modifier is available.$(br2)$(info) Insert the relevant herb into the slot to unlock it.$(br2)Red colouring and tooltip of 'Modifier not enabled' means the modifier is unlocked but not enabled.$(br2)$(info) Simply click the slot to enable it."
    },
    {
      "type": "text",
      "title": "Colour & Tooltip",
      "text": "Green colouring and no additional tooltip text mean the modifier is enabled.$(br2)$(info) Click the slot to disable it.$(br2)Purple colouring and 'Modifier conflicts' means this modifier conflicts with another modifier and cannot be enabled.$(br2)$(info) Disable the mentioned modifiers or hold Alt when clicking to disable them automatically."
    },
    {
      "type": "relations",
      "anchor": "related",
      "entries": [
        "spells/introduction",
        "spells/library",
        "spells/modifiers",
        "crafting/staff",
        "crafting/gramary",
        "crafting/imposer"
      ]
    }
  ]
}