{
  "itemGroup.ephemera.ephemera": "Ephemera",

  "item.ephemera.media_helmet": "Hexformed Helmet",
  "item.ephemera.media_chestplate": "Hexformed Chestplate",
  "item.ephemera.media_leggings": "Hexformed Leggings",
  "item.ephemera.media_boots": "Hexformed Boots",

  "block.ephemera.relay_tp_detector": "Network Gateway Probe",
  "block.ephemera.relay_index": "Network Routing Index",
  "block.ephemera.fakeslate": "Inert Slate",

  "hexcasting.action.ephemera:magearmor": "Instant Aegis",
  "hexcasting.action.book.ephemera:magearmor": "Instant Aegis",
  "hexcasting.action.ephemera:networkscan": "Network Distillation",
  "hexcasting.action.book.ephemera:networkscan": "Network Dstln.",
  "hexcasting.action.ephemera:networktp": "Network Gateway",
  "hexcasting.action.book.ephemera:networktp": "Network Gateway",
  "hexcasting.action.ephemera:networkindex": "Routing Distillation",
  "hexcasting.action.book.ephemera:networkindex": "Routing Dstln.",
  "hexcasting.action.ephemera:readframerotation": "Decorator's Purification",
  "hexcasting.action.book.ephemera:readframerotation": "Decorator's Prfn.",
  "hexcasting.action.ephemera:setframerotation": "Decorator's Gambit",
  "hexcasting.action.ephemera:paintconjured": "Externalize Pigment",
  "hexcasting.action.ephemera:particleburst": "Particle Burst",
  "hexcasting.action.ephemera:invisibility": "Hidden Sun's Zenith",
  "hexcasting.action.ephemera:getstatus": "Apothecary's Purification",
  "hexcasting.action.book.ephemera:getstatus": "Apothecary's Prfn.",
  "hexcasting.action.ephemera:getstatuscategory": "Apothecary's Purification II",
  "hexcasting.action.book.ephemera:getstatuscategory": "Apothecary's Prfn. II",
  "hexcasting.action.ephemera:getstatusduration": "Pharmacist's Distillation",
  "hexcasting.action.book.ephemera:getstatusduration": "Pharmacist's Dstln.",
  "hexcasting.action.ephemera:getstatuslevel": "Pharmacist's Dstln. II",
  "hexcasting.action.book.ephemera:getstatuslevel": "Pharmacist's Distillation II",
  "hexcasting.action.ephemera:getbystatus": "Zone Exaltation: Status",
  "hexcasting.action.book.ephemera:getbystatus": "Zone Exltn.: Status",
  "hexcasting.action.ephemera:getbystatusinverse": "Zone Exaltation: Not-Status",
  "hexcasting.action.book.ephemera:getbystatusinverse": "Zone Exltn.: Not-Status",
  "hexcasting.action.ephemera:getbystatussingle": "Entity Distillation: Status",
  "hexcasting.action.ephemera:removestatus": "Cleanse Status",
  "hexcasting.action.ephemera:getabsorption": "Ablation Purification",
  "hexcasting.action.ephemera:filteredentityraycast": "Scout's Exaltation",
  "hexcasting.action.ephemera:gaussianrand": "Entropy Reflection II",
  "hexcasting.action.ephemera:hash": "Hashing Purification",
  "hexcasting.action.ephemera:hashbits": "undocumented hash-to-numbers pattern",
  "hexcasting.action.ephemera:revealtoother": "Postman's Gambit",
  "hexcasting.action.ephemera:getrevealcost": "Postage Purification",
  "hexcasting.action.ephemera:clearrevealcost": "Postman's Gambit II",
  "hexcasting.action.ephemera:repair": "Induce Mending",
  "hexcasting.action.ephemera:getdurabilitymainhand": "Menderbug's Reflection",
  "hexcasting.action.book.ephemera:getdurabilitymainhand": "Menderbug's Rfln.",
  "hexcasting.action.ephemera:getdurabilityoffhand": "Menderbug's Reflection II",
  "hexcasting.action.book.ephemera:getdurabilityoffhand": "Menderbug's Rfln. II",
  "hexcasting.action.ephemera:thothyoink": "Seshat's Gambit",
  "hexcasting.action.ephemera:thothcount": "Seshat's Reflection",
  "hexcasting.action.book.ephemera:thothcount": "Seshat's Rfln.",
  "hexcasting.action.ephemera:collisionprobe": "Clearance Purification",
  "hexcasting.action.book.ephemera:collisionprobe": "Clearance Prfn.",
  "hexcasting.action.ephemera:getiotasize": "Flock's Purification",
  "hexcasting.action.book.ephemera:getiotasize": "Flock's Prfn.",
  "hexcasting.action.ephemera:getstacksizedeep": "Flock's Reflection II",
  "hexcasting.action.book.ephemera:getstacksizedeep": "Flock's Rfln. II",
  "hexcasting.action.ephemera:no": "No",
  "hexcasting.action.ephemera:getproperties": "State Purification",
  "hexcasting.action.ephemera:getpropertyvalue": "State Distillation",
  "hexcasting.action.ephemera:ridewisp": "Ride Wisp",
  "hexcasting.action.ephemera:dismount": "Dismount",
  "hexcasting.action.ephemera:getrider": "Equestrian Purification",
  "hexcasting.action.book.ephemera:getrider": "Equestrian Prfn.",
  "hexcasting.action.ephemera:getmount": "Equestrian Purification II",
  "hexcasting.action.book.ephemera:getmount": "Equestrian Prfn. II",
  "hexcasting.action.ephemera:cancelflight": "Terminate Flight",
  "hexcasting.action.ephemera:getflight/type": "Aviator's Purification II",
  "hexcasting.action.ephemera:getflight/remaining": "Aviator's Purification III",

  "hexcasting.mishap.location_ephemera:inputrelaytprange": "Target entity is too far from target node at %s.",
  "hexcasting.mishap.location_ephemera:outputrelaytprange": "Could not find connected node within range of %s.",
  "hexcasting.mishap.ephemera:nonconjured": "Expected a conjured block at %s, but got %s.",
  "hexcasting.mishap.ephemera:missingeffect": "Expected %s to be affected by %s, but they are not.",
  "hexcasting.mishap.ephemera:nothoth": "Expected to be cast from inside of Thoth's Gambit.",
  "ephemera.mishap.noitemframe": "an item frame",
  "ephemera.mishap.entitytypelistplease": "a list of entity types",
  "ephemera.mishap.toolongiota": "an iota that displays as less than 256 characters",
  "hexcasting.mishap.ephemera:blacklist": "This effect has been blacklisted via tag.",
  "hexcasting.mishap.ephemera:instant": "How did you even get that iota?",
  "hexcasting.mishap.ephemera:no": "no",

  "item.ephemeral.media_armor.tooltip.1": "Bestows %s %s upon the wearer.",

  "ephemera.entry.miscpatterns": "Misc. Ephemera Patterns",
  "ephemera.entry.invisibility": "Invisibility",
  "ephemera.entry.status_iotas": "Status Iotas",
  "ephemera.entry.network": "Link Amenities",
  "ephemera.entry.revealtoother": "Messaging",
  "ephemera.entry.mending": "Induce Mending",
  "ephemera.entry.hashing": "Iota Hashing",
  "ephemera.entry.specialslates": "Modified Slates",
  "ephemera.entry.metathoth": "Accumulator Manipulation",
  "ephemera.entry.flight": "Additional Flight Patterns",

  "ephemera.page.paintconjured.1": "Accepts a vector and an itemtype representing a pigment. Costs a negligible amount of media if targeting my own block, or 1 Amethyst Dust if not.",
  "ephemera.page.paintconjured.2": "Sets the colors of the conjured block corresponding to the vector to the colorset represented by the passed pigment, or mine if passed a NULL iota.$(br2)Not guaranteed to work with unconventional forms of conjured matter. ",
  "ephemera.page.paintconjured.3": "Feels strangely celebratory, as if something similar was once used in grand festivals where teams would splatter their colors all over their opponents' territory in a bid for ideological dominance.",

  "ephemera.page.miscpatterns.1": "I've found a couple patterns designed to interact with item frames. Nothing fancy, but they're nice utility for things like controlling my spell circles.$(br2)Additionally, it seems Sorter's Purification works on them just fine, so my attempts to find a dedicated frame-item pattern were pointless.",
  "ephemera.page.miscpatterns.2": "Accepts an item frame entity, and returns its rotation, from 0 to 7.",
  "ephemera.page.miscpatterns.3": "Accepts an item frame entity and an integer from 0 to 7, and sets its rotation to the number. Costs a negligible amount of media.",
  "ephemera.page.miscpatterns.4": "As $(l:patterns/basics#hexcasting:raycast/entity)Scout's Distillation$(/l), but also accepts a list of entity type iotas. Any entity whose type is not present in the list will be ignored. Costs an amount of media slightly less negligible than that of the aforementioned pattern.",
  "ephemera.page.miscpatterns.5": "Returns a random number with a gaussian distribution, with a mean of zero and a standard deviation of one.",
  "ephemera.page.miscpatterns.6": "Accepts a vector, and returns whether that vector is within (or just on the edge of) the block in that space. Seems to involve the boxes I see in my mind's eye.",
  "ephemera.page.miscpatterns.7": "Returns the total size of all iotas on my stack, including the contents of lists and similar. If this number ever reaches 1024, my stack shall come crashing down into garbage.",
  "ephemera.page.miscpatterns.8": "Accepts any iota, and returns its total size.",
  "ephemera.page.miscpatterns.9": "Accepts a vector, and returns a list of strings corresponding to values contained in the state of the block at the corresponding position.",
  "ephemera.page.miscpatterns.10": "Accepts a vector and a string, and uses the string as a key to retrieve the value it corresponds to in the target block's state, or null if there is no corresponding value.",
  "ephemera.page.miscpatterns.11": "Accepts one of my wisps (or a wandering wisp), and places me atop it, similar to sitting in a minecart. I must be within the wisp's ambit, or four blocks for wandering wisps. Costs one amethyst shard.",
  "ephemera.page.miscpatterns.12": "I should take care not to accelerate too quickly when riding a wisp, as unlike with Impulse, the acceleration is not applied evenly across my body, and can thus cause significant harm. The threshold for how quickly I can accelerate safely seems to be about 98 m/s over one second.$(br)I should take care when mounting fast wisps, as the instantaneous velocity involved can contribute to this damage if I am too far from my final seated position.",
  "ephemera.page.miscpatterns.13": "Takes me off of whatever entity I may be riding when cast. Costs 1/100 of a dust.",
  "ephemera.page.miscpatterns.14": "Accepts an entity, and returns a list of entities seated atop it.",
  "ephemera.page.miscpatterns.15": "Accepts an entity, and returns the entity it is seated atop.",

  "ephemera.page.flight.1": "I've often found the preexisting suite of flight-related patterns to be a bit lackluster. They work perfectly well if all you want to do is cast the spell and go, but they are not well-suited to doing anything more complex. These patterns should help with that.",
  "ephemera.page.flight.2": "Cancels my current flight ability, at a cost of one tenth of an Amethyst Dust. Casting a new flight spell in the same instant allows me to continue flying, potentially with different parameters.",
  "ephemera.page.flight.3": "Returns true if the target is under the effects of Anchorite's Flight, false if Wayfarer's Flight, null if neither.",
  "ephemera.page.flight.4": "Returns how close the target is to the end of their flight spell, represented as either their distance to the boundary or how many seconds remain.",

  "ephemera.page.particleburst.1": "Accepts two vectors and two numbers, and uses them to define a burst of particles. Costs a negligible amount of media.",
  "ephemera.page.particleburst.2": "The first vector determines the burst's origin position, and the second vector determines its direction and speed. The first number determines the scale of random numbers added to each position component, and the second does the same for the direction vector.",

  "ephemera.page.invisibility.1": "Functions just like the normal $(l:patterns/great_spells/zeniths)Zeniths$(/l), applying Invisibility. Costs one amethyst dust per three seconds.",

  "ephemera.page.status_iotas.1": "These patterns work with a type of iota that represents lingering effects on a creature, which can allow me to asses the state of a creature more thoroughly than with only Nurse's Purification.$(br)While my research suggests that status iotas representing instantaneous effects are possible, they would be very difficult to obtain, and I cannot think of any use case for them at the moment.",
  "ephemera.page.status_iotas.2": "Accepts a living entity, and returns a list of status iotas representing all effects on the target.",
  "ephemera.page.status_iotas.3": "Accepts a status effect type, and returns a number based on whether the effect is likely to be helpful, harmful, or neutral to a creature.",
  "ephemera.page.status_iotas.4": "Accepts an entity and a status effect type, and returns the effect on the target's duration in seconds.",
  "ephemera.page.status_iotas.5": "Accepts an entity and a status effect type, and returns the effect on the target's potency.",
  "ephemera.page.status_iotas.6": "Accepts a status effect type and a vector, and returns an entity at that position which has that effect.",
  "ephemera.page.status_iotas.7": "Accepts a status effect type, a vector, and a number ($(o)n$()), and returns a list of entities within radius $(o)n$() of the vector which have that effect.",
  "ephemera.page.status_iotas.8": "Accepts a status effect type, a vector, and a number ($(o)n$()), and returns a list of entities within radius $(o)n$() of the vector which do not have that effect.",
  "ephemera.page.status_iotas.9": "Accepts a living entity, and returns how much damage it can Absorb before its health is affected.",
  "ephemera.page.status_iotas.10": "Accepts an entity and a status effect type, and removes that status effect from the entity. Cost is based on the effect's innate harmfulness, its potency, and its remaining duration.",
  "ephemera.page.status_iotas.11": "Costs more if attempting to remove a positive effect from an entity other than myself.$(br2)All of the patterns which deal with a specific status effect on an entity have the side effect that if the entity does not currently have the specified effect, the pattern will fail and inflict nausea upon me.",

  "ephemera.page.magearmor.1": "I've discovered a rather interesting spell, capable of producing a defensive media barrier that can match and even exceed the protective abilities of many kinds of conventional armor. It can even apply a wide array of $(l:patterns/spells/status_iotas)persistent effects$(/l) to the wearer, allowing for incredible versatility.",
  "ephemera.page.magearmor.2": "Accepts a player to grant the armor to, the durability of the armor, the protection value of the armor (max 10), a status effect to apply, and that effect's level. The latter two can be replaced with any non-status iota to ignore them.",
  "ephemera.page.magearmor.3": "Of course, this barrier is by no means indestructible, and its durability decays steadily in addition to any damage it takes from hits. The base rate of this decay can be described as one \"point\" per second, plus additional points equal to the squared strength of any effect imbued into it. Additionally, it will disappear instantly if removed from the wearer, so there is no way to repair it, short of recasting the spell to overwrite its current state.",
  "ephemera.page.magearmor.4": "The media cost for this spell is a bit complicated: A base of one amethyst dust per 60 durability, multiplied by the armor's protection value raised to the power of 1.5, times the level+1 of any status effect. Thus, producing no-status strength 10 armor with one minute's worth of durability costs ~31.5 dust. Adding Regeneration 2 increases that media cost to ~94.5 dust, and causes it to only last 36 seconds.",
  "ephemera.page.magearmor.5": "This explanation assumes I am wearing no other armor, in practice the cost can be reduced to as little as 25%% of that formula's output if all but one of my armor slots is already occupied by more conventional armor.",

  "ephemera.page.network.1": "I've devised a suite of patterns (plus a couple of blocks) to make links a bit more useful for things other than data transmission and media sharing.$(br2)Note that the patterns which fetch information about the network make no promises regarding whether returned linkables are within ambit.",
  "ephemera.page.network.2": "Scans the link network connected to the input linkable up to a recursion depth equal to the input number (max 32), and returns a list of all connected linkables. Costs a negligible amount of media.",
  "ephemera.page.network.3": "Accepts an entity to teleport, a linkable to use for access to its network, and a destination. If the entity is within 8 blocks of the linkable, and there is a network node within 4 blocks of the destination, the entity will be teleported. Cost varies based on what entity is teleported.",
  "ephemera.page.network.4": "Outputs a brief redstone signal when an adjacent relay is used as the output for a casting of Network Gateway.",
  "ephemera.page.network.5": "When rclicked with a focus in the main hand, attempts to store its iota in the block. When the focus is in the offhand, writes the stored iota to the focus.",
  "ephemera.page.network.6": "Accepts a linkable to use for network access, and any iota. If a relay connected to the network has an adjacent Network Routing Index with the same iota, returns that relay's position. Costs half an amethyst dust.",

  "ephemera.page.revealtoother.1": "Accepts a player and any iota less than 256 characters long, and shows that iota to them as if they had cast Reveal, also telling them who sent the message. Cost is inversely proportional to the length of time since they were last targeted by this spell.",
  "ephemera.page.revealtoother.2": "Accepts a player and returns how much amethyst dust it would cost to send them a message via Postman's Gambit, between 1/10 of a dust and 10 dust.",
  "ephemera.page.revealtoother.3": "Resets the cost of sending me a message via Postman's Gambit back to 1/10 of a dust. Costs 1/10 of a dust.",

  "ephemera.page.mending.1": "Accepts a raw media item on the ground, and attempts to use it to repair a tool in my other hand.",
  "ephemera.page.mending.2": "Generally only works on items enchanted with Mending, which are already damaged. Restores twenty points of damage for each amethyst dust's worth of media.",
  "ephemera.page.mending.3": "Returns how many times the item in my other hand can be used without breaking, durability-manipulating effects notwithstanding.",
  "ephemera.page.mending.4": "As previous, targeting the item in the hand I'm casting this with. Most useful with delayed casts of one form or another.",

  "ephemera.page.hashing.1": "I've discovered a curious pattern which scrambles an iota into an unreadable mess. However, unlike Garbage iotas, $(o)this$() mess still contains data, and running the same iota through the pattern will always produce the same mess (known as a hash). While it is not possible to recover an iota from a hash, it can be quite useful for comparisons in situations where I cannot save the unaltered iota.",
  "ephemera.page.hashing.2": "Accepts any iota, and converts it into its hashed form.",

  "ephemera.page.specialslates.1": "I've designed a couple types of slate to be used in spell circles. While they don't provide any groundbreaking new functionality, they can be nice to have.",
  "ephemera.page.specialslates.2": "Works just like a normal slate, but is capable of sending the media wave into the block it is placed on.",
  "ephemera.page.specialslates.3": "Crafted with a normal slate and a stonecutter.$(br2)Looks just like a normal slate, but can't direct a media wave at all. Cannot be written to.",

  "ephemera.page.metathoth.1": "It seems that the list which $(l:patterns/meta#hexcasting:for_each)Thoth's Gambit$(/l) forms as it iterates over a data set functions as a stack, simply one that is a bit out of the way. As such, I have devised a couple of patterns for interacting with this hidden stack, called the accumulator.",
  "ephemera.page.metathoth.2": "Pops an iota from the accumulator and pushes it to the current stack. Mishaps if used outside of Thoth's Gambit.",
  "ephemera.page.metathoth.3": "Returns how many iotas are currently accessible via Seshat's Gambit. Returns -1 if used outside of Thoth's Gambit.",

  "ephemera.page.forgewarning.1": "Mod author's note for Forge users: This spell does not work on Forge. I do not know why. I've set the cost on Forge to zero so at least it won't waste media. Sorry.$(br2)I'll try to get it working eventually.",

  "hexcasting.iota.ephemera:potion": "Status Effect",
  "hexcasting.iota.ephemera:hash": "Hash",
  "ephemera.iota.hashlabel": "Hashed data: %s",

  "text.ephemera.clearHistoryResponse": "Cleared reveal history map.",
  "text.ephemera.revealIntroduction": "Transmission from %s: ",
  "text.ephemera.nosender": "unknown",

  "enchantment.ephemera.shame": "Curse of Shame",

  "death.attack.ephemera:acceleration": "%s was subjected to lethal acceleration."
}