{
	"hexcasting.spell.book.hexcellular:create_property": "Schrödinger's Refl.",
	"hexcasting.spell.book.hexcellular:observe_property": "Observation Purif.",
	"hexcasting.spell.book.hexcellular:set_property": "Schrödinger's Gambit",

	"hexcasting.mishap.invalid_value.class.property": "a property iota",

	"hexcellular.page.properties.title": "Property Iota",
	"hexcellular.page.properties.0": "Using Hexcasting, I can etch information into the laws of the universe themselves. These artificial bits of information are fittingly called properties and they can be accessed from anywhere with a property iota. Two hexcasters with copies of the same property can set the property's iota and read it to instantly share the iota with each other.",
	"hexcellular.page.properties.1": "I can also use it to communicate $(o)state$() within and between my Hexcasting appliances. For instance, a $(l:items/hexcasting)casting device$() that uses a property that it increments in order to keep track of how many times it has been used and do something different each time.$(br2)$(o)Spooky action from a distance...$()",
	"hexcasting.spell.hexcellular:create_property": "Schrödinger's Reflection",
	"hexcellular.page.create_property.summary": "Pushes a reference to a random property. Costs one charged amethyst to burn this property into the universe.",
	"hexcellular.page.properties.2": "When creating a property, the spell pushes a property iota with a randomly generated name. This name is the only reference to the created property. I should immediately store these property iota for safe-keeping because there is no way to recover one once all references to it have been lost and the only ways to interact with a property is through its iota.",
	"hexcasting.spell.hexcellular:observe_property": "Observation Purification",
	"hexcellular.page.observe_property.summary": "Observes the current value of the property iota. Free to use.",
	"hexcasting.spell.hexcellular:set_property": "Schrödinger's Gambit",
	"hexcellular.page.set_property.summary": "Sets the property iota. Costs about a tenth of a dust. All future observations of the property iota return the new value."
}