{
  "item.platos.control_key": "Control Key",
  "item.platos.wrench": "Disassembly Wrench",
  "item.platos.lift_jack": "Ship Lift Jack",
  "item.platos.clearing_scythe": "Clearing Scythe",
  "item.platos.boarding_stairs": "Boarding Stairs",
  "block.platos.ship_controller": "Ship Controller Assembly",
  "block.platos.wheel_block": "Wheel",
  "block.platos.float_block": "Water Float",
  "block.platos.balloon_block": "Airship Balloon",
  "scythe.platos.tooltip": "use this item to clear away grass!",
  "liftjack.platos.tooltip": "The player will be sitting on the block",
  "liftjack.platos.tooltip2": "above ground/water level",
  "boardingstairs.platos.tooltip": "Point at a distant vehicle and interact to get on!",
  "itemGroup.platos.tab": "Plato's Transporters",
  "category.platos.main": "Plato's Transporters",
  "key.platos.up": "Fly airship up",
  "key.platos.down": "Fly airship down",
  "key.platos.stop": "Freeze/Unfreeze airship direction",
  "book.platos.page1": "Welcome to platos transporters, this mod is in early release so there could be §lbugs",
  "book.platos.page2": "§lGetting Started§r \n\nTo get started you first need to craft a §oShip Controller§r and a §oControl Key§r you may also want to craft a §oShip Lift Jack§r. To create a vehicle, it requires the correct amount of floats, balloons or wheel for it's desired terrain",
  "book.platos.page3": "1 Water Float = 20 blocks \n\n1 Wheel = 10 blocks \n\n1 airship Balloon = 2 blocks \n\n(these are all configurable) assembly your ship out of valid boat materials and then place the controller",
  "book.platos.page4": "The controller will tell you if there is any mistakes or it will create your vehicle. By default the block the player sits on (in front of the controller) will be 1 block above the ground, to change this, use the lift jack",
  "book.platos.page5": "the lift jack can raise and lower where the player sits by using or shift-using it (on a block) respectively, to change the height (listed on the jack's tooltip) you can interact with the controller block with the jack in your main hand",
  "book.platos.page6": "Once the vehicle is created there is a few controls, to make the water and land variants go forward, one must simply hold the control key, whereas the airship will travel in the direction the player is looking when the key is being used",
  "book.platos.page7": "To disassemble the vehicle you must sit on it and then use the Disassembly wrench, it will turn back into blocks IN THE DIRECTION IT WAS BUILT IN if there is space"
}