{
  "name": "On Pentacles",
  "icon": "occultism:textures/gui/book/pentagram_rose.png",
  "category": "occultism:pentacles",
  "sortnum": 0,
  "pages": [
    {
      "type": "text",
      "text": "The name $(thing)Pentacle$() in this context refers to ritual drawings of any shape, not just five-pointed stars. Pentacles are used to summon and bind spirits from $(thing)The Other Place$(). They act both as a device to call on the entity, an amplifier for the summoner's commanding power and as a protecting circle preventing attacks from within against the summoner."},
    {
      "type": "text",
      "text": "Each pentacle consists of a central golden sacrificial bowl, surrounding runes of various colors and occult paraphernalia that improve the intended effect in various ways. The combination of chosen runes and supporting items as well as their exact spatial positioning determines the use and effectiveness of the pentacle. Ingredients are placed in $(thing)Sacrifical Bowls$() near the pentacle."},
    {
      "_comment": "exact duplicate of this is in first_ritual.json",
      "type": "image",
      "border": "true",
      "images": [
        "occultism:textures/gui/book/bowl_placement.png"
      ]
    },
    {
      "_comment": "exact duplicate of this is in first_ritual.json",
      "type": "text",
      "text": "$(thing)Sacrifical Bowls$() must be placed $(bold)anywhere$() within 8 blocks of the central $(thing)Golden Sacrifical Bowl$(). The exact location does not matter."},
    {
      "type": "text",
      "title": "Summoning Pentacles",
      "text": "The purpose of this type of pentacle is to summon spirits in their chosen form into the world. Spirits summoned thus suffer from strong essence decay, and only very powerful spirits can remain for extended periods of time."},
    {
      "type": "text",
      "title": "Infusion Pentacles",
      "text": "Infusion pentacles allow the binding of spirits into objects. While the spirits suffer from essence decay in some cases, this can often be averted with the right pentacle setup, and by embedding crystals and precious metals into the object to support the spirit."},
    {
      "type": "text",
      "title": "Possession Pentacles",
      "text": "These pentacles force spirits to possess a living being, which, depending on the ritual context, gives the summoner control over various aspects of that being, ranging from it's strength to it what it drops when killed, and in some cases even allows total control."}
  ]
}