{
    "name": "Aura Bottling",
    "icon": "naturesaura:aura_bottle{stored_type:'naturesaura:overworld'}",
    "category": "practices",
    "advancement": "naturesaura:wood_stand",
    "turnin": "naturesaura:aura_bottle_overworld",
    "pages": [
        {
            "type": "text",
            "text": "$(aura) and its presence in the world has been a conundrum to researchers for a long time now. Back in the day, they used to use $(item)Bottles$() to collect $(aura) and to be able to analyze it in greater detail as it becomes visible to the naked eye that way. Soon after, complaints from uninformed civilians started troubling them: \"Other scientists already have a use for bottles, this will cause issues\", they said."
        },
        {
            "type": "crafting",
            "text": "As such, and to shut out all the incoherent blabber, they created the $(item)Bottle and Cork$(): A similar, yet slightly different utensil to the bottle that can be used exclusively to collect $(aura) by simply interacting with the air while holding it.",
            "recipe": "naturesaura:bottle_two_the_rebottling"
        },
        {
            "type": "spotlight",
            "item": "naturesaura:aura_bottle{stored_type:'naturesaura:overworld'}",
            "link_recipe": true,
            "text": "Of course, based on the world that you are currently in, the type of $(aura) collected will slightly vary. For instance, in the normal world, $(aura) can be gathered in the form of sunlight, while in the Nether realm, $(aura) can be gathered in the form of ghosts, and in the End realm, $(aura) is present in the form of an overabundance of darkness."
        },
        {
            "type": "text",
            "text": "Additionally, the collection of $(aura) in this manner can be automated easily using $(item)Dispensers$(): Putting empty $(item)Bottles and Corks$() into them will cause them to be shot out open, making them fill up with $(aura) in the process. As they are not sucked up by the Dispenser again afterwards, an additional tool like a $(item)Hopper$() is required."
        }
    ]
}