{
    "name": "Bee Attributes",
    "icon": "productivebees:gene",
    "category": "productivebees:genetics",
    "pages": [
        {
            "type": "text",
            "text": "Bee attributes can be transferred from one bee to another. See the page on $(l:genetics/collecting#crystalline)collecting genes$(/l)."
        },
        {
            "type": "text",
            "title": "Productivity",
            "text": "Bees with higher level of productivity will produce more combs per trip.$(br)Levels are:$(br)Normal$(br)Medium$(br)High$(br)Very High"
        },
        {
            "type": "text",
            "title": "Endurance",
            "text": "Affects the bees max health.$(br)With a high endurance the bee has a chance to not loose it's stinger when attacking.$(br)Levels are:$(br)Weak$(br)Normal$(br)Medium$(br)Strong"
        },
        {
            "type": "text",
            "title": "Weather Tolerance",
            "text": "Normally bees will retreat to the safety of their hive during rain and thunderstorms. Bees can become tolerant to harsh weather conditions by leaving them leashed outside during bad weather. Beware though that they have a risk of taking damage and dying until they become accustomed so keep an eye on them and honey treats on hand.$(br)Levels are:$(br)None - can only work in clear weather$(br)Rain - can work during rain$(br)Any - can work in any weather"
        },
        {
            "type": "text",
            "title": "Behavior",
            "text": "Most bees operate during daytime, but a few bees are nocturnal by nature allowing them to fly around at night. Bees can become accustomed to operating at night by leaving them leashed outside during night time. Beware though that the bees can take damage when left leashed outside. Keep honey treats handy.$(br)Levels are:$(br)Diurnal - works only during daytime$(br)Nocturnal - works only during nighttime$(br)Metaturnal - works all day and night"
        },
        {
            "type": "text",
            "title": "Temper",
            "text": "Bees have different temper, some will attack on sight and others will avoid harmful interaction altogether. A bee that has been fed a lot of honey treats will improve it's temper.$(br)Levels are:$(br)Passive$(br)Normal$(br)Aggressive$(br)Hostile"
        },
        {
            "type": "text",
            "title": "Effects",
            "text": "Some bees can apply effects to nearby players, both positive and negative."
        }
    ]
}