{
  "blue_skies.blue_journal.turn_page": "Turn page",
  "blue_skies.blue_journal.back": "Back",
  "blue_skies.blue_journal.read_page": "Read page",
  "blue_skies.blue_journal.tagline": "An Adventurer's Guide\nby the Gatekeeper",
  "blue_skies.blue_journal.welcome": "This Journal is written to assist newcomers in their journeys across the Everbright and Everdawn worlds. If something has unique functionality, chances are I’ve written about it in this book. You might find new journal entries as you progress, so remember to check back periodically. I’ve marked each section with a bookmark on the side of the book.",
  "blue_skies.section.search": "Search",
  "blue_skies.section.everbright": "Everbright",
  "blue_skies.section.everdawn": "Everdawn",
  "blue_skies.section.general": "General",
  "blue_skies.everbright.everbright_portal.title": "Everbright Portal",
  "blue_skies.everbright.everbright_portal.lore": "The entrance to the Everbright dimension. The portal is made of Turquoise Stone Bricks, and can be lit with a Zeal Lighter. It seems the Everbright is constantly day, but it's somehow always brittle and cold. The world is home to lots of large thick-coated fauna. Plenty of snow, and spirit-like enemies can be found here. During the snow, more enemies like to show their faces, as they much prefer the colder weather.",
  "blue_skies.everbright.brewberry_bush.title": "Brewberry Bush",
  "blue_skies.everbright.brewberry_bush.lore": "A foliage found in the Everbright. When grown, it produces Brewberries. After further investigation, the type of Brewberry that the bush wields can be influenced based on the block you grow it on, however it doesn’t seem to guarantee that you get said berry. Cherry Grass causes the bush to be able to produce Pink Brewberries, which grant you a small amount of regeneration. Growing it on Mycelium seems to allow it to grow Black Brewberries, which cure poisonous status effects. I was also able to find that growing the bushes on fertile soil, such as Farmland or Podzol, allowed the bush to produce an extra berry or so.",
  "blue_skies.everbright.snowcap_mushroom.title": "Snowcap Mushroom",
  "blue_skies.everbright.snowcap_mushroom.lore": "With this world being much colder, sources of heat are harder to come across. However, thanks to some of my experimentation, I was able to find that some plants can be used as fuel. The most notable being the Snowcap Mushroom. It absorbs heat, making the nearby surroundings chilled to the touch. It can occasionally reach such a cold temperature that lava hardens on the spot. And as it turns out, this heat can be released in a furnace to produce a similar flame to that of coal.",
  "blue_skies.everbright.snowcap_pinhead.title": "Snowcap Pinhead",
  "blue_skies.everbright.snowcap_pinhead.lore": "A small variation of the Snowcap Mushroom. It can be compressed into giant mushroom blocks, which, just as the Snowcap Mushroom is, can be used as quite the fuel source.",
  "blue_skies.everbright.snowcap_oven.title": "Snowcap Oven",
  "blue_skies.everbright.snowcap_oven.lore": "With this creation, I was able to harness the Snowcap Mushroom’s heating and cooling power. By sapping the heat out of warm objects, it can cook whatever you put inside, occasionally leaving the frozen byproduct of the fuel behind. It even allows for things such as water to be used as a fuel source, albeit not a very good one.",
  "blue_skies.everbright.brumble.title": "Brumble",
  "blue_skies.everbright.brumble.lore": "One of the few ocean vegetations that can be found in the Everbright. Its faded red color contrasts very well with the rest of the ocean, it’s very interesting to see such a color mixed amongst the blues and purples of the Everbright. I’m sure this could be smelted to create beautiful building materials.",
  "blue_skies.everbright.taratite.title": "Taratite",
  "blue_skies.everbright.taratite.lore": "A smooth, almost minty blue-green colored stone. If polished, I’m sure this will make for a great building material.",
  "blue_skies.everbright.rimestone.title": "Rimestone",
  "blue_skies.everbright.rimestone.lore": "A rough icey stone. If polished, I’m sure this will make for a great building material.",
  "blue_skies.everbright.ventium.title": "Ventium",
  "blue_skies.everbright.ventium.lore": "A red metal, it can be found in most of the non-mountainous biomes in the Everbright. It seems to mostly take on the role of an iron equivalent in this world. Ventium can be used to create things like buckets, shears, and the Tool Box.",
  "blue_skies.everbright.falsite.title": "Falsite",
  "blue_skies.everbright.falsite.lore": "This magical metal can be found inside the non-mountainous biomes of the Everbright. It has mysterious properties that allow for strengthening the durability of almost any tool from both the Everbright and Everdawn using a Tool Box.",
  "blue_skies.everbright.pearl.title": "Pearl",
  "blue_skies.everbright.pearl.lore": "Obtained from the mouth of a Seclam. This shiny pearl seems to have some sort of mysterious property. Most enemies seem to not like me holding it. I might be able to combine it with Falsite to create something greater.",
  "blue_skies.everbright.warding_pearl.title": "Warding Pearl",
  "blue_skies.everbright.warding_pearl.lore": "By combining a pearl and a Soul Fragment with Falsite to create this, I’m able to prevent hostile mobs from appearing within a large radius. This is very helpful in this world, since light sources like Moonstone don’t prevent mobs from appearing like they do in the Overworld.",
  "blue_skies.everbright.soul_fragment.title": "Soul Fragment",
  "blue_skies.everbright.soul_fragment.lore": "A fragment of an evil soul. With all the ghostly enemies in the Everbright, these are quite a common item. I’m able to harness its power either when crafting it with a pearl and some Falsite, there are likely more uses I have yet to find as well.",
  "blue_skies.everbright.azulfo_horn.title": "Azulfo Horn",
  "blue_skies.everbright.azulfo_horn.lore": "The horn of the mighty Azulfo. As most bones can be, I’m able to create Bone Meal from these. This allows for me to farm significantly faster.",
  "blue_skies.everbright.summoning_table.title": "Summoning Table",
  "blue_skies.everbright.summoning_table.lore": "After visiting the Blinding Dungeon, I managed to get my hands on a Summoning Table and Tome. With this, I was able to change what the Summoning Tome does. It has the option of either shooting a Fluctuant Sphere, or summoning an Artificial Golem to fight alongside me.",
  "blue_skies.everbright.soulbound_spear.title": "Soulbound Spear",
  "blue_skies.everbright.soulbound_spear.lore": "When I visited the Everbright’s Blinding Dungeon, I found myself a Soulbound Spear. This spear seemed to function like a normal spear, however it always would come back to me after throwing it. This might come in handy when dealing with most of the enemies in this world.",
  "blue_skies.everbright.summoning_tome.title": "Summoning Tome",
  "blue_skies.everbright.summoning_tome.lore": "Amongst the other useful tools I was able to get for myself at the Everbright’s Blinding Dungeon, I was able to get a Summoning Tome. This allows me to harness some of the Summoner’s attacks. When I obtained the tome, right away it had the ability to conjure a Fluctuant Sphere. Using it I’m able to hit multiple enemies at once with a single projectile, as it damages anything within a radius of it. However, once I used the tome at the Summoning Table, I was surprised to see it had yet another ability! It granted me the ability to summon an Artificial Golem to fight alongside myself. The Golem seemed to be temporary though, only lasting me about a minute, so I’d better use it wisely!",
  "blue_skies.everbright.nature_dungeon.title": "Nature Dungeon",
  "blue_skies.everbright.nature_dungeon.lore": "I managed to stumble upon a giant green pyramid structure in the Snow Covered Pines. After entering, I was greeted by many of its inhabitants. They seemed to be golems constructed entirely of the structure’s stone, held together with Starlit Vines. As I was nearing the top of the dungeon, I started to realize that the build quality had been getting better the whole time! The bottom floors seemed to be very aged, and weathered away, while the upper floors were in almost pristine condition. Each floor seems to have a dungeon key in it, I’ll assume that just like the Blinding Dungeon, there is a Keystone at the end of the tunnels to use. However, due to some rumors I’ve heard, I likely won’t be going to see it for myself. I’ve decided to call this giant structure the §oNature §oDungeon§r.",
  "blue_skies.everbright.crushing_hammer.title": "Crushing Hammer",
  "blue_skies.everbright.crushing_hammer.lore": "It seems like this hammer came directly from the Starlit Crusher itself! This mighty hammer has the power to slam the ground, just as the Starlit Crusher can. It hurts everything around me when I use it, causing each enemy to fly into the air! This thing also packs quite a punch, doing lots of melee damage, it seems to be very heavy though.",
  "blue_skies.everdawn.everdawn_portal.title": "Everdawn Portal",
  "blue_skies.everdawn.everdawn_portal.lore": "The entry to the Everdawn Dimension, created with Lunar Stone Bricks and lit with a Zeal Lighter. This world is always hot and humid, but the time is always at sunrise. Insects thrive here, especially during the rain when more of them leave their homes. The insects have grown to scary sizes, some being about half my size! The rain seems less heavy here, usually only being a slight drizzle. The fauna here seem to be mostly reptilian, with few exceptions.",
  "blue_skies.everdawn.baneful_mushroom.title": "Baneful Mushroom",
  "blue_skies.everdawn.baneful_mushroom.lore": "When exploring the Shaded Woodlands, I had to step with caution. Across this area, I found a seemingly harmless purple mushroom. However, after closer inspection, it has poisonous properties. The Baneful Mushroom reacts to contact by spraying anything on top of it with toxic spores as a defense mechanism. I should be sure to avoid this mushroom at all costs.",
  "blue_skies.everdawn.crystal_flower.title": "Crystal Flower",
  "blue_skies.everdawn.crystal_flower.lore": "This flower is an interesting one. It’s somehow a mix of crystal, and foliage. Upon closer inspection, if fertilized with something like bone meal, it is able to grow into a fully-fledged tree!",
  "blue_skies.everdawn.spider_webbing.title": "Spider Webbing",
  "blue_skies.everdawn.spider_webbing.lore": "An interesting type of web, it has the ability to attach to corners, unlike normal webs. It seems to only be able to connect to either itself, or other walls.",
  "blue_skies.everdawn.crescent_fruit.title": "Crescent Fruit",
  "blue_skies.everdawn.crescent_fruit.lore": "Thanks to the warm climate, the Everdawn is capable of nurturing some rather tropical food sources, the primary ones being Crescent Fruits. I’ve found that this fruit will grow on the bottom of almost any Crescent Fruit leaf and can be harvested seemingly indefinitely so long as the leaves are in bloom.",
  "blue_skies.everdawn.sunstone_crystal.title": "Sunstone Crystal",
  "blue_skies.everdawn.sunstone_crystal.lore": "These crystals are hot to the touch, sporting a glowing orange color. They can be used as fuel at any furnace, as well as a way to charge the Horizonite Forge. These can be found deep in the Sunset Maple Forest, and the Searing Grasslands.",
  "blue_skies.everdawn.horizonite_forge.title": "Horizonite Forge",
  "blue_skies.everdawn.horizonite_forge.lore": "I’ve done it! I have harnessed the power of Horizonite! With this, I’m able to smelt things without any fuel. This does come at the cost of re-charge time. It can be charged instantly using anything composed of Horizonite. I can also use Sunstone as another means of charging it quicker. The Forge will only recharge if there is nothing cooking inside of it. Having multiple of these would likely be very beneficial.",
  "blue_skies.everdawn.cinderstone.title": "Cinderstone",
  "blue_skies.everdawn.cinderstone.lore": "This magma-like stone could definitely be used as quite the building material. I’m sure it can be polished into something nice as well.",
  "blue_skies.everdawn.umber.title": "Umber",
  "blue_skies.everdawn.umber.lore": "A smooth brown stone. This could probably be polished into an even smoother building material.",
  "blue_skies.everdawn.crystallized_tree.title": "Crystallized Tree",
  "blue_skies.everdawn.crystallized_tree.lore": "This tree has incredibly strange properties. It can’t be made into sticks, and it doesn’t burn. The wood seems to be entirely made from crystal, it’s even transparent. With their properties, I’m sure the logs could be made into walls. That would make for a great fence replacement. Since the tree isn’t exactly pure foliage, it doesn’t have any saplings. I discovered that Crystal Flowers, if fertilized using bone meal, can be grown into a full tree.",
  "blue_skies.everdawn.horizonite.title": "Horizonite",
  "blue_skies.everdawn.horizonite.lore": "Found in the Crystal Dunes, this metal is extremely hot, I can’t believe it doesn’t just melt! I’m not sure how it stores so much heat. I discovered that any tools created from it are able to smelt ores right from the stone! I was also able to create a furnace from this stuff, which I called the Horizonite Forge.",
  "blue_skies.everdawn.moonstone_shield.title": "Moonstone Shield",
  "blue_skies.everdawn.moonstone_shield.lore": "This shield is quite a bit more durable than a normal wooden shield, it also sports a transparent look like Raw Moonstone does, allowing you to see things through it.",
  "blue_skies.everdawn.fox_pelt.title": "Fox Pelt",
  "blue_skies.everdawn.fox_pelt.lore": "Obtained from Cosmic Foxes, this can be used to create Camel Saddles, and the Bag of Spoils.",
  "blue_skies.everdawn.spike_shield.title": "Spike Shield",
  "blue_skies.everdawn.spike_shield.lore": "After my visit to the Everdawn’s Blinding Dungeon, I was able to obtain a Spike Shield for myself. This shield is quite a bit more durable than both the wooden shield, and the Moonstone shield. This shield seems to have some extra melee damage, so it can double as a weaker weapon.",
  "blue_skies.everdawn.alchemy_table.title": "Alchemy Table",
  "blue_skies.everdawn.alchemy_table.lore": "During my visit to the Everdawn’s Blinding Dungeon, I managed to get my hands on an Alchemy Table. Using this, I can change most raw Everdawn materials to Everbright ones, and vise-versa. I could see this being especially helpful when building. If I wanted to, I could change Lunar Stone into Turquoise Stone if I had an abundance of it. It seems I can also combine stone with my Arc, allowing me to get dungeon stone. I’m sure this will work with the other arcs, if only I had them…",
  "blue_skies.everdawn.alchemy_scroll.title": "Alchemy Scroll",
  "blue_skies.everdawn.alchemy_scroll.lore": "Following my exploration of the Everdawn’s Blinding Dungeon, I found an Alchemy Scroll. Using this I can mimic the Alchemist’s Decaying Spike attack. It spawns Decaying Spikes in a line above me wherever I point it. I can also use the second variation of the attack by crouching, which spawns the spikes facing upward beside me, knocking close foes away from me.",
  "blue_skies.everdawn.poison_dungeon.title": "Poison Dungeon",
  "blue_skies.everdawn.poison_dungeon.lore": "During my exploration of the Sunset Maple Forest, I was able to locate a strange looking tree. It was covered in webs, and to my surprise, inside of it was a giant spider nest! This place is home to many Venom Spiders. I was also surprised to see that the Overworld’s Cave Spider made its way into this nest. Each floor has a dungeon key in it, I’ll assume that just like the Blinding Dungeon, there is a Keystone at the end of the tunnels to use. I can hear what sounds like loud hissing through the halls of this place, I can’t imagine what’s at the end... I think I’ll call this place the §oPoison Dungeon§r.",
  "blue_skies.everdawn.venom_sac.title": "Venom Sac",
  "blue_skies.everdawn.venom_sac.lore": "Following my trip through the Poison Dungeon, I managed to obtain a Venom Sac. With this, I can fire spurts of venom, just as the Arachnarch is rumored to do. The damage the projectile inflicts is minor, but it also infects the victim with a deadly venom.",
  "blue_skies.everdawn.different_sword.title": "Different Sword",
  "blue_skies.everdawn.different_sword.lore": "A very interesting sword, meant for quick combat. This weapon seems to have been designed with the intent of slaying the target as quickly as possible. If I were to wait too long after hitting the target, they would heal off more damage than I delt. Knowing this, it’s likely a good idea to avoid using it on bulkier targets.",
  "blue_skies.general.blinding_dungeon.title": "Blinding Dungeon",
  "blue_skies.general.blinding_dungeon.lore": "In my travels, I was able to find a giant tower structure. I decided to dub it the §oBlinding §oDungeon§r. It seems this dungeon has 2 variations, one in the Everbright, and one in the Everdawn. Both are home to Illagers. The Everbright has the Summoner, and the Everdawn has the Alchemist. The two can be visited by bringing 4 Blinding Dungeon keys to the Keystone at the top floor of their respective dungeons. I myself don’t plan on picking too much of a fight with either of them.",
  "blue_skies.general.moonstone.title": "Moonstone",
  "blue_skies.general.moonstone.lore": "Found underground in both worlds, it seems to purely be a source of light. It functions underwater, and can be made into larger blocks that also emit light. It also has a crystal variation found in some of the caves in these worlds. I don’t believe it does anything special like the Sunstone crystal does, but it does look rather pretty.",
  "blue_skies.general.pyrope.title": "Pyrope",
  "blue_skies.general.pyrope.lore": "This gemstone can be found anywhere underground in either world. It seems tools created from such a material are very light, so I can use them very fast. These tools don’t seem to be very durable though, so I’d better use them with caution.",
  "blue_skies.general.aquite.title": "Aquite",
  "blue_skies.general.aquite.lore": "This aqua blue mineral seems to be similar to the Overworld’s iron when it comes to tools and armor. After some testing it does seem very enchantable on top of that.",
  "blue_skies.general.diopside.title": "Diopside",
  "blue_skies.general.diopside.lore": "This spiky, almost crystalline shaped gemstone has a lime green color to it. I found it deep underground in both worlds. The armor and tools created from this material are §overy§r durable and strong. The tools are very heavy, and inflict extreme damage to anything I hit. Something to note though, due to their heaviness, these are much harder to swing than most tools. I’ll have to be careful when dealing with fast targets. This set of tools and armor competes with Charoite, being a slower, but stronger alternative.",
  "blue_skies.general.charoite.title": "Charoite",
  "blue_skies.general.charoite.lore": "A more neutral set of armor and tools, being similar to diamond in most regards. This set of tools and armor competes with Diopside, being a faster, but weaker alternative.",
  "blue_skies.general.star_emitter.title": "Star Emitter",
  "blue_skies.general.star_emitter.lore": "Usually accompanied by a Stargazer villager, this interesting device can put the Astrolabe to use. Using an Astrolabe on the block will set its teleport position to the Star Emitter’s position, allowing you to teleport back to it.",
  "blue_skies.general.trough.title": "Trough",
  "blue_skies.general.trough.lore": " A simple wooden trough. If baby animals are near this, they have a chance to eat from it. When an animal does eat from the block, it will allow it to grow up faster. It can be filled with most animal breeding items, like carrots, potatoes, scalefruit, and pine fruit. If a villager decides to work here, they will be a Wrangler.",
  "blue_skies.general.tool_box.title": "Tool Box",
  "blue_skies.general.tool_box.lore": "This very useful workbench can be used to enhance and upgrade tools. This seems to be Falsite’s primary use, it can increase durability when put along almost any tool from these worlds. Yet another discovery, any stick from these worlds can be swapped in onto any tool. It seems almost all the sticks have different uses, I’ll have to see which ones work well on each tool set.",
  "blue_skies.general.bag_of_spoils.title": "Bag of Spoils",
  "blue_skies.general.bag_of_spoils.lore": "A small bag that can carry anything. This can be used to carry 5 items inside of it. I figured out I could pick-pocket any villager by crouching and using it on them while they weren’t looking. It seems if they saw me do it, they would be quite upset, the Iron Golem of the village even attacked me. The only villager I was not able to pick-pocket was the Nightwatcher, who gave me the bag in the first place.",
  "blue_skies.general.food_prep_table.title": "Food Prep Table",
  "blue_skies.general.food_prep_table.lore": "A table made for preparing meals. It can accept a maximum of 5 ingredients, with 3 being the minimum needed to create a proper dish. By using lots of unique ingredients, I’m able to make better meals than usual. The more hearty the ingredients, the more servings the meal will have. Knowing this, using meat seems to be the most beneficial toward making my food last longer.\n\nBy incorporating flowers as a sort of seasoning, it seems possible to draw out their latent potion effects. I’ve heard of people in the Overworld doing this to make stews, though I’m certain my methods are superior.\n\nFor a longer lasting or more potent effect, Potions may also be used like a sauce. Though it seems I can only use one without causing instability...\n\nThrough experimentation, I discovered that using a Brewberry can enhance the flavor of all effects, extending their duration. It’s possible to make a dish based purely on effect-granting ingredients. Doing this won’t make the dish very filling, but it could be exactly what I need in some situations. Though I wouldn’t complain if I could find a flower that enhances the heartyness of my food.",
  "blue_skies.general.astrolabe.title": "Astrolabe",
  "blue_skies.general.astrolabe.lore": "I was able to find this useful item by trading with one of the village’s local Stargazers. By combining this item with a Star Emitter, I can teleport short distances across the world. This isn’t free however, as the Astrolabe will go on a cooldown for the amount of distance I teleported.",
  "blue_skies.general.spears.title": "Spears",
  "blue_skies.general.spears.lore": "Incredibly useful tools designed to hurt targets from afar. These function as a mix of the Overworld’s trident and bow, being cheap to make, and usable underwater. I found spears may be enchanted with things such as loyalty, and piercing.",
  "blue_skies.everbright.azulfo.title": "Azulfo",
  "blue_skies.everbright.azulfo.lore": "The largest of the Everbright’s fauna. I found plenty of these along my journey. They can be found in large herds, and generally follow the herd leader. Hunting them can be quite hard, as unlike the Overworld’s animals, these won’t go down without a fight. In fact, the whole herd will get riled up when you do this. I found that spears tend to be the most useful tool you can use to hunt them.",
  "blue_skies.everbright.stardust_ram.title": "Stardust Ram",
  "blue_skies.everbright.stardust_ram.lore": "The Everbright’s most common fauna. These wooly creatures are very similar to the Overworld’s sheep. They can be sheared using shears, and hunted for mutton.",
  "blue_skies.everbright.reindeer.title": "Reindeer",
  "blue_skies.everbright.reindeer.lore": "The reindeer is one of the most useful animals I found in the Everbright. They can be tamed using pine fruit, and equipped with a saddle. They can be ridden at a moderately fast speed, and can jump around 2 blocks high. I was only able to find these critters in open snowy areas, such as the Brightlands and Snow Covered Pines. Reindeer may also be hunted for venison, however with their more picky living climates, I generally avoid doing so.",
  "blue_skies.everbright.snow_owl.title": "Snow Owl",
  "blue_skies.everbright.snow_owl.lore": "These beautiful sounding creatures can only be found in the Frostbitten Forest. They generally live atop the trees of the biome. They can be heard from large distances, which adds to the mysterious feeling of the Frostbitten Forest.",
  "blue_skies.everbright.grittle_flatfish.title": "Grittle Flatfish",
  "blue_skies.everbright.grittle_flatfish.lore": "Being one of the most unique fish creatures in the oceans, the Grittle Flatfish is very skittish. It tends to be scared very easily, attacking whoever might come near, and making a run for it shortly after. It doesn’t hurt very much, but I can’t help but feel bad for the little thing whenever I do manage to scare one. These fish are quite the delicacy, and tend to fill me up more than any other fish.",
  "blue_skies.everbright.armored_frost_spirit.title": "Armored Frost Spirit",
  "blue_skies.everbright.armored_frost_spirit.lore": "The Frost Spirit is one of the most common enemies I found on my journey. These creatures aren’t quite what they seem, they might look aggressive and angry, but underneath that ice is a small spirit that couldn’t hurt a fly. Once freed, it will try to escape, likely dodging most strikes you’ll make towards it. Once slain you might be able to get yourself a soul fragment or two. I found that using any pickaxe does more damage to its icey body, usually slaying it quicker than my weaker swords.",
  "blue_skies.everbright.crynocerous.title": "Crynocerous",
  "blue_skies.everbright.crynocerous.lore": "I didn’t see this one too often, the Crynocerous seems to be a much larger, more powerful version of the Armored Frost Spirit, sharing much of the same qualities. It has more range, and strength than the Armored Frost Spirit does. I was only able to find this beast inside snowy climates, like the Brightlands. Just as the frost spirit does, it takes more damage when hit with a pickaxe than hitting it with a sword.",
  "blue_skies.everbright.polargeist.title": "Polargeist",
  "blue_skies.everbright.polargeist.lore": "On my journey I encountered a ghostly bear. This creature is surprisingly fast, being able to outrun me in most cases. It has ice hanging from its belly, and has fangs made of ice. When it attacks, it stands up on two legs, and slams down on its target. I found that it will not attack if you knock it back quickly enough, as it takes time for it to stand up.",
  "blue_skies.everbright.whistleshell_crab.title": "Whistleshell Crab",
  "blue_skies.everbright.whistleshell_crab.lore": "This large crab creature is able to walk both on land and in water. It looks like its claw almost resembles a mouth with teeth. On land, it’s very fast, and leaves almost no time to run away. Although they have lots of speed, they don’t have much range, so it’s easy to avoid attacks on land. In water it’s quite a bit slower, but is able to dash through the water when grounded. The easiest way to take it out in water is to stay high, since it can’t swim.",
  "blue_skies.everbright.shrumpty.title": "Shrumpty",
  "blue_skies.everbright.shrumpty.lore": "Oftentimes when I would explore the Slushlands, I would be startled by a Shrumpty. These sneaky fellows camouflage with the Snowcap Mushrooms, and strike when a predator is near. Their touch is very cold, causing their targets to freeze up and slow down. They even laugh creepily when they manage to land a hit, very strange…",
  "blue_skies.everbright.diophyde_prowler.title": "Diophyde Prowler",
  "blue_skies.everbright.diophyde_prowler.lore": "Amongst the many enemies I’ve faced in the Everbright, there’s not one similar to the Diophyde Prowler. This enemy circles its prey, pouncing in when the time is right. I found the easiest way to avoid their attacks is to strafe in the opposite way it’s moving. It’s so fast that there’s no sense in outrunning it, it’s more worthwhile just to fight it. I also found that using one of the Everdawn’s shields can stop it in its tracks, leaving it vulnerable to attack.",
  "blue_skies.everbright.seclam.title": "Seclam",
  "blue_skies.everbright.seclam.lore": "Occasionally, when I would traverse the deep oceans of the Everbright, I might encounter a Seclam. These calm creatures don’t move at all, instead just showing off their beautiful pearl. Whenever a possible predator might approach it, the clam will close its mouth, preventing anything from stealing its shiny pearl. I found after hitting it a few times, it would open up, and I could safely take the pearl from its mouth. I had to be careful however, as if I was too slow it would close on me, which would likely hurt a ton.",
  "blue_skies.everbright.stonelet.title": "Stonelet",
  "blue_skies.everbright.stonelet.lore": "During my visit to the Nature Dungeon, I encountered plenty of these strange looking enemies. These are the protectors of the dungeon, attacking anyone who dares to trespass in it. I figured out that similarly to the frost spirit, these creatures are hurt more by pickaxes than anything else. Knowing this, I was easily able to traverse the dungeon.",
  "blue_skies.everbright.spewter.title": "Spewter",
  "blue_skies.everbright.spewter.lore": "During my exploration of the Nature Dungeon I had found these interesting plant creatures growing in the gardens of the top floor. They spit seed bombs at me whenever I would go near them, so I had to keep my distance.",
  "blue_skies.everbright.summoner.title": "Summoner",
  "blue_skies.everbright.summoner_pre.lore": "At the top of the Everbright’s Blinding Dungeon, I got into a fight with an individual wearing a collared purple coat. They had used their magic powers to summon golems composed of the dungeon’s stone. I found that most times I approached the sorcerer, they would teleport themself to another section of the room. I did notice however, if they happened to be spellcasting, I could approach safely, possibly being able to land a blow. I was able to understand that if I kept the count of the golems lower than what he summoned, but higher than 1, he would begin spawning more. I used this as my time to strike. Unfortunately, my visit to the dungeon was cut short by my power being outmatched by this individual, so I had to escape early.",
  "blue_skies.everbright.summoner_post.lore": "After combining my own first-hand knowledge with some of the tales from the locals, I can finally write a more detailed description on who the locals called, the Summoner. This sorcerer lives atop the Everbright’s Blinding Dungeon. Unlike the Alchemist, the Summoner uses his summons to do the fighting for him. He can use magic to first summon ranged golems that fire projectiles at who dares enter the top floor. This is then followed by several more melee oriented golems also attacking the trespasser. These golems are known as Artificial Golems. The individual tends to favor keeping multiple Artificial Golems around. The Summoner also teleports to safety if approached while not casting a spell. Knowing these facts, by defeating some of the golems, the Summoner will leave himself open to attacks while summoning more. For a more general attack, the Summoner uses balls of magic known as Fluctuant Spheres to hit anything that might come near him. Something that must be known though, is that if approached too quickly while casting one of these spheres, the Summoner will instead create powerful strange lightning, bringing levitating blue fire into the mix. After learning and piecing together all of this information, I can’t help but think I’ve met this individual before.",
  "blue_skies.everbright.starlit_crusher.title": "Starlit Crusher",
  "blue_skies.everbright.starlit_crusher_pre.lore": "I’ve only heard rumors of the legendary Nature Dungeon guardian. They say it protects itself with giant wooden walls, and can summon other plant-like enemies to aid it in battle. I’ve heard that the only way people have found to leave it vulnerable is by throwing something with a sharp point at it, such as a spear, after chopping down one of its walls. If it were me, I would almost certainly want to also come equipped with an axe to chop it down.",
  "blue_skies.everbright.starlit_crusher_post.lore": "I’ve finally learned enough about the Starlit Crusher! I’ve learned that it uses 4 walls to protect itself in battle, shielding itself from any attacks. While the walls are up, the Crusher will grow things such as roots, Spewters, and Wooden Snow Owls to assist it in battle. Once it has sustained enough damage, said roots will grow bigger in size. Once one of the walls has been destroyed, it will begin smashing the ground in anger, leaving itself vulnerable to any projectiles, such as a spear. Once stunned, it can be attacked with any weapon, however an axe is said to be ideal to chop it down.",
  "blue_skies.everdawn.cosmic_fox.title": "Cosmic Fox",
  "blue_skies.everdawn.cosmic_fox.lore": "One of the smallest animals I found in the Everdawn had to be the Cosmic Fox. I managed to find the little critter in more open areas, such as the Searing Grasslands and the Unorthodox Valley. I was able to tame the fella using Crescent Fruits, and it would follow me around wherever I went. It even listens to commands!",
  "blue_skies.everdawn.crystal_camel.title": "Crystal Camel",
  "blue_skies.everdawn.crystal_camel.lore": "The beautiful Crystal Camel. Only located in sandy biomes, this incredible creature walks the desert, enjoying the heat of the area. I found that they enjoy eating Pine Fruits, and I was able to tame one for myself. After creating myself a Camel Saddle, I was able to ride it. I learned that I can mount a chest on its back, allowing me to carry lots of items easily. One con to this however, is that camels aren’t exactly the fastest animals, so I was only able to move at a slower pace.",
  "blue_skies.everdawn.shade_monitor.title": "Shade Monitor",
  "blue_skies.everdawn.shade_monitor.lore": "Being the most common of the Everdawn’s fauna, this animal looks to be the prime hunting choice of most in this world. They adapt to whatever area they might be in, having a different camouflaged look based on the biome. Beware if you try to hunt these animals however, as they won’t back down without a fight! They aren’t as powerful as the Everbright’s Azulfo, but they still hurt quite a bit.",
  "blue_skies.everdawn.crogre.title": "Crogre",
  "blue_skies.everdawn.crogre.lore": "My personal favorite, the Crogre. A giant frog living almost exclusively in the Moonlit Reservoir. They jump very high, clearing around 4-5 blocks of height. The giant insects of the Everdawn seem to not like this fella very much, usually running away as soon as they manage to get close. I found they enjoy consuming bug guts, allowing me to tame one for myself. Afterwards, I was able to saddle one up and ride it! I found I could also ride it on water, allowing me to traverse the reservoir with ease over land and water!",
  "blue_skies.everdawn.nyctofly.title": "Nyctofly",
  "blue_skies.everdawn.nyctofly.lore": "One of my biggest concerns while in the Everdawn was the Nyctofly. The air-born insect lives in heavily wooded areas, such as the Shaded Woodlands. It has quite the eyes on it, being able to see targets from incredible distances. Whenever I would hear its wings fluttering, I knew it was time to fight. A big thing I learned is that they can be much harder to fight in an open area, so I advise staying in a tight space.",
  "blue_skies.everdawn.venom_spider.title": "Venom Spider",
  "blue_skies.everdawn.venom_spider.lore": "One of the more common enemies I would have to face in the Everdawn was the Venom Spider. They tend to be quite smart, switching their attack tactics based on where you are. If I chose to go straight in to attack it, then it would try to bite me directly with its venomous fangs. If I would decide to keep my distance, it would spit at me with poisonous spit. Using a shield helped me out in most scenarios when fighting these creatures.",
  "blue_skies.everdawn.emberback.title": "Emberback",
  "blue_skies.everdawn.emberback.lore": "These giant beetle creatures can be a challenge to fight without being aware of their battle tactics. The Emberback can be found flying towards its targets. Once near, the insect will drop down, expelling flaming hot air from under its shell. These insects are very smart, and can detect whether you’ve consumed a fire resistance potion, and will instead try to bite you for lower damage output. An easy way to take care of these bugs is either by using a shield, or by luring them to a body of water.",
  "blue_skies.everdawn.infested_swarmer.title": "Infested Swarmer",
  "blue_skies.everdawn.infested_swarmer.lore": "This elusive insect can only be found underground, or rarely aboveground in heavily crystallized areas, such as the Crystal Roughs. These giant ants don’t have much for battle tactics, instead they mostly have speed and size. I almost feel bad for the poor thing with how strangely mutated it has become.",
  "blue_skies.everdawn.nested_spider.title": "Nested Spider",
  "blue_skies.everdawn.nested_spider.lore": "At the end of my Poison Dungeon trek, I encountered what seemed to be spider nests. I would occasionally see a Nested Spider peek its head outside, so I’d assume that this is where the smaller spiders rest.",
  "blue_skies.everdawn.alchemist.title": "Alchemist",
  "blue_skies.everdawn.alchemist_pre.lore": "Atop the Everdawn’s Blinding Dungeon, I got into a battle with a person wearing a hooded red garment. They used magic to conjure bundles of arrows, and spiky rocks made of the world’s native stone. It seemed the arrow bundles could easily be blocked by using a shield. This character was also able to drop potion clouds within the corners of the room, granting them a place to flee. A pattern I was able to notice is that every attack that I could not block, was able to be easily avoided. It seems the most powerful attack they have at their disposal is the spikes, as they can pierce through armor. Unfortunately this short match did not play out in my favor, so I had to escape before I could learn more.",
  "blue_skies.everdawn.alchemist_post.lore": "After hearing tales from the locals, I was able to expand my knowledge on who they dubbed, the Alchemist. The sorcerer that hides out atop the Everdawn’s Blinding Dungeon. In contrast to the Everbright’s Summoner, the Alchemist does most of the fighting himself, throwing projectiles, and using area of effect attacks like potion clouds. Similarly to the Summoner, the Alchemist can escape anything that might approach him by teleporting away. He cannot teleport when spellcasting however, meaning every time he attacks he leaves himself open. \n\nStarting by mentioning the projectiles, in my own encounter, I found Decaying Spikes can pierce through armor, and hurt quite a bit. Unfortunately for the Alchemist, these are very easy to dodge. If you approach him too quickly however, they will appear from around his feet facing upward. For the other projectile, the Alchemist can use arrow bundles. These arrows do have quite the punch to them, and can send you flying across the room. From what the locals said, as the Alchemist gets weaker, there’s a chance some may be set aflame. Thankfully there’s water fountains in the room for most of the fight. This can change however as I’ve yet to mention another ability the Alchemist has, fluid conversion. The Alchemist is able to convert water to lava, and vise-versa. This can change the tide of the battle quickly if you manage to be burned by him. \n\nNow I’ll get to the last things the Alchemist can do. He is able to temporarily blind everyone in his room, this is rumored to only last for a short time, so I wouldn’t worry too much. The final thing he is able to do is heal himself when weak. Since he is left open for attacks the entire time, with proper weaponry and aggression, his healing can be out-damaged. After hearing all these rumors and putting this information together, I can’t help but feel like I’ve met this person before.",
  "blue_skies.everdawn.arachnarch.title": "Arachnarch",
  "blue_skies.everdawn.arachnarch_pre.lore": "With some of the rumors I’ve heard about this giant arachnid, I would be terrified to face it myself. From what I understand, it is able to use its giant size to lunge at any of its targets when grounded. With what I’ve learned from most of the Everdawn’s predators, a shield would likely do wonders against it. I’ve also heard that unlike most of the giant spiders in the world, this one is able to latch on to the ceiling to avoid most attacks.",
  "blue_skies.everdawn.arachnarch_post.lore": "With some newfound information I’ve learned, I’m able to write a full entry on the Arachnarch. This creepy crawler is able to latch onto the ceiling, keeping itself away from most, if not all attacks. If this is true, I would advise stalling it out until it is no longer able to keep itself on the ceiling. Then when grounded, I’ve also heard it can lunge itself towards targets using its massive amount of weight. As with most Everdawn enemies, I tend to use a shield against things like this. From what I understand, the collision against the shield causes the spider to become dizzy, leaving it vulnerable to attacks."
}