{
    "name": "Devices",
    "icon": "mimi:deviceconfig",
    "category": "mimi:11midi",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "There are multiple categories of MIDI devices that perform different kinds of actions. Some devices fit into multiple MIDI device categories, while others may only fit into one."
        },
        {
            "type": "patchouli:text",
            "title": "Controllers",
            "text": "These devices produce MIDI data based on user input (like a digital piano) to be sent to other MIDI devices.$(br2)Controllers generally are synonymous with instruments however some controllers are designed to modify received MIDI data rather than produce brand new data."
        },
        {
            "type": "patchouli:text",
            "title": "Synthesizers",
            "text": "These devices receive MIDI data and produce sound from it. There are generally two kind of Synthesizers:$(br2)$(l)Hardware Synthesizers$() - A physical device specifically built to generate sound from MIDI data.$(br2)$(l)Software Synthesizers$() - A program built to generate sound from MIDI data (such as Windows Media Player or this mod)."
        },
        {
            "type": "patchouli:text",
            "title": "Sequencers",
            "text": "These devices create, modify, save, and play sequences of MIDI notes (such as a .mid file).$(br2)Most MIDI sequencers are software programs used to compose music, however there are also hardware sequencers that are often used during live performances to record and then play back short sequences."
        },
        {
            "type": "patchouli:text",
            "title": "Network Devices",
            "text": "These devices are used to help connect other kinds of MIDI devices together.$(br2)Generally they receive one or more MIDI data streams and split or combine them and then send them to one or more downstream MIDI devices."
        }
    ],
    "sortnum": 1
}