{
    "name": "Programs",
    "icon": "mimi:microphone",
    "category": "mimi:11midi",
    "pages": [    
        {
            "type": "patchouli:text",
            "text": "When listening to music you hear a huge variety of different kinds of sounds produced by many different instruments. In MIDI these sounds are referred to as Programs and are an important component of MIDI data."
        },
        {
            "type": "patchouli:text",
            "title": "Controllers",
            "text": "Many MIDI controllers are designed to only deal with a single program. A digital piano, for example, might only be able to produce piano sounds.$(br2)Other MIDI controllers may be able to produce data for multiple different programs, such as a digital wave synthesizer."
        },
        {
            "type": "patchouli:text",
            "title": "Synthesizers",
            "text": "Similarly to MIDI controllers MIDI synthesizers may be able to produce sound in one or more different programs. A digital piano, for example, might only be able to produce piano sounds.$(br2)Many Synthesizers can produce a large number of different programs. This allows for MIDI data sent in one program to be turned into sound by a synthesizer using the same program or another program."
        },
        {
            "type": "patchouli:text",
            "title": "Synthesizers",
            "text": "This ability for Synthesizers to re-map MIDI data from one program to another is one of the most powerful aspects of MIDI.$(br2)It allows you to produce MIDI data using whatever controller you have available but then output it into any kind of sound such as a piano generating guitar sounds or $(l:https://youtu.be/SAcYxc1M55s?t=467)a Vacuum playing a bunch of recorders.$(/l)"
        },
        {
            "type": "patchouli:text",
            "title": "General MIDI",
            "text": "In order for many different kinds of MIDI devices to work properly together a standard set of MIDI data was developed in the early 1990s known as General MIDI 1.0 (GM / GM1).$(br2)One aspect of GM was the creation of a standard set of 128 MIDI programs (also called programs) each mapped to a specific number so that any MIDI synthesizer would known what program the data is trying to use."
        },
        {
            "type": "patchouli:text",
            "title": "General MIDI",
            "text": "The 128 programs of GM are split into multiple generic categories from Piano to Brass to Percussion. The full General MIDI specification can be found $(l:https://en.wikipedia.org/wiki/General_MIDI)here$(/l)."
        }
    ],
    "sortnum": 2
}