{
    "name": "Play a MIDI File",
    "icon": "mimi:filecaster",
    "category": "mimi:1overview",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "There are several ways to play MIDI files with your instruments in MIMI but the easiest way is to use the FileCaster to play MIDI files that are on your PC.$(br2)First, you'll need to craft a FileCaster and a Switchboard to insert into your instrument and allow it to connect to the FileCaster."
        },
        {
            "type": "patchouli:crafting",
            "title": "Recipes",
            "recipe": "mimi:filecaster",
            "recipe2": "mimi:switchboard"
        },
        {
            "type": "patchouli:text",
            "title": "The Switchboard",
            "text": "The Switchboard stores many settings that are used by MIMI Instruments and other MIMI Items and Blocks to control their behavior and interactions with eachother.$(br2)More information about all of the individual Switchboard properties is available later in this guide. For now, you'll just need to open up the Instrument Screen for your desired instrument(s) and insert a Switchboard."
        },
        {
            "type": "patchouli:text",
            "title": "Opening the FileCaster",
            "text": "To open the FileCaster Screen, first select it on your hotbar with your main hand or place it in your off hand slot. Then, simply right click while holding the FileCaster to open the FileCaster Screen.$(br2)You can also open the FileCaster Screen with a key bind ($(bold)$(k:key.mimi.midi.gui.filecaster)$()) as long as any FileCaster item is on your hotbar or in your off hand slot."
        },
        {
            "type": "patchouli:text",
            "title": "The FileCaster Screen",
            "text": "The FileCaster screen allows you to select a folder on your PC to play MIDI files from. First, enter the folder path in the textbox and then click the Load Folder button to load the list of MIDI files into the playlist.$(br2)When a song is selected, the MIDI Channel Assignments for that song will display on the screen."
        },
        {
            "type": "patchouli:text",
            "text": "You can think of MIDI Channels as representing separate parts of the song (like a singer, lead guitar, bass guitar, drums, and piano); Some MIDI Files may use up to 16 channels while some may only use 1 and channel 10 is always reserved for drums.$(br2)Looking at the channels assignments for a song will give you an idea of what MIMI instruments might sound best playing a particular channel for that song."
        },
        {
            "type": "patchouli:text",
            "text": "You can also change the Transmit Mode for the FileCaster from the FileCaster Screen. This is covered more later in the guide, and leaving this setting as the default 'Public' ('P') for now is good.$(br2)Once a song is playing you can close the FileCaster screen and it will continue to play as long as you keep at least one FileCaster item on your hotbar or in your off hand."
        },
        {
            "type": "patchouli:text",
            "title": "Connecting Instruments",
            "text": "The last step is to connect your instrument(s) to the FileCaster. Open the Instrument Screen and click the Edit (pencil) button to bring up the Switchboard's properties.$(br2)Press 'PUB' in the transmission section to enable Public transmissions and press 'O' in the channels section to enable all channels (but un-tick channel 10). You should now hear your song!"
        },
        {
            "type": "patchouli:text",
            "text": "You can close the Instrument Screen once your instrument starts playing and it will continue to play as long as you continue to hold it (handheld instruments) or remain seated at it (block instruments). This means you can play up to 3 instruments at the same time!$(br2)Play around with enabling and disabling channels on each of the instruments that you're playing to remix the way a song sounds."
        }
    ],
    "sortnum": 4
}