{
    "name": "The Instrument Screen",
    "icon": "minecraft:oak_sign",
    "category": "mimi:2instruments",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "The Instrument Screen is the screen that you see upon right-clicking a handheld or block instrument which allows you to directly play the instrument and configure its Switchboard."
        },
        {
            "type": "patchouli:text",
            "title": "Playing",
            "text": "You can play directly play the instrument that you have opened using the keyboard keys shown on the piano keys on the screen, or by just clicking on the piano keys.$(br2)If you hold down Spacebar while playing, notes will hold in the same way as holding the sustain pedal on a piano."
        },
        {
            "type": "patchouli:text",
            "title": "Key Layouts",
            "text": "$(li)$(l)MIMI$() - Keyboard keys are assigned currently visible piano keys.$(br)$(li)$(l)VPiano$() - Based on $(o)virtualPiano.net$(), assigns each keyboard key to a specific piano key meaning you can play keys that are $(o)not$() currently visible but cannot play very high or very low notes. Keyboard keys in this layout are case-sensitive.$(br2)"
        },
        {
            "type": "patchouli:text",
            "title": "Shifting",
            "text": "The notes currently visible on screen can be shifted using the 'Visible Note Shift' buttons. You can also shift notes in the same way using the Keyboard:$(br)$(li)By Note: Left/Right Arrows$(br)$(li)By Octave: Up/Down Arrows$(br2)The colored bars on the piano keys match with the note indicators in the shift section to show what notes are visible."
        },
        {
            "type": "patchouli:text",
            "title": "Switchboard",
            "text": "The slot on the lower left side of the screen allows you to insert/remove a Switchboard item with your instrument.$(br2)The Switchboard allows your instrument to be controlled by a transmission (from a FileCaster, Transmitter, or Broadcaster) or by a MIDI Input Device and it stores several properties that define how the instrument interacts with those controllers."
        },
        {
            "type": "patchouli:text",
            "text": "When a Switchboard is present in the instrument, clicking the Edit (pencil icon) button will bring up a menu that allows you to modify the Switchboard's properties (covered later).$(br2)Clicking the Edit button again while the menu is open will close the menu."
        }
    ],
    "sortnum": 3
}