{
    "name": "Connecting a Device",
    "icon": "mimi:keyboard",
    "category": "mimi:4devices",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "This section will teach you how to connect a compatible MIDI Input Device to your PC.$(br2)If you already know how to connect a MIDI Input Device to your system feel free to skip this section.$(br2)"
        },
        {
            "type": "patchouli:text",
            "title": "Compatible Devices",
            "text": "If your device supports directly connecting to a PC via a USB cable then it is likely that it supports MIDI over USB to send MIDI messages to your PC; consult the user manual for more info.$(br2)If your device does not support MIDI-over-USB but does have a 'MIDI Out' port (like $(l:https://s3.amazonaws.com/ww2.sonicftp.com/news/images/33983_658.jpg)this$()) then you can use a MIDI to USB converter (found easily on Amazon and other sites) to connect it to your PC."
        },
        {
            "type": "patchouli:text",
            "title": "Connecting your Device",
            "text": "To connect the deice to your PC follow the instructions in the device's user manual (for direct connections) or the MIDI to USB converter manual (when using a MIDI to USB converter).$(br2)Once you think your device is connected and powered on you'll want to test it to ensure that it's working properly."
        },
        {
            "type": "patchouli:text",
            "text": "There are many ways to test a device, but one easy way is to visit $(l:https://multiplayerpiano.com)multiplayerpiano.com$() (MIDI currently only works in Google Chrome), click 'Play Alone', and configure the MIDI In/Out to use your device for MIDI In.$(br2)If you don't see your device or are unable play notes when it is selected consult your user manual or the web.$(br2)If you are able to play the piano using your device then it is working correctly."
        }
    ],
    "sortnum": 1
}