{
    "name": "Connect an Instrument",
    "icon": "mimi:switchboard",
    "category": "mimi:4devices",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "To connect an instrument to your selected MIDI Input Device, you will need to insert a Switchboard into the instrument and enable the 'System MIDI Input' Switchboard property."
        },
        {
            "type": "patchouli:text",
            "title": "Enable Channels",
            "text": "You will also need to ensure that the proper MIDI Channels are enabled in the Switchboard so that it will receive data from your device.$(br2)Every device handles channels a bit differently so consult your device's manual to determine which channels it is using (typically it's 1 and/or 2, or 10 for electric drums)."
        },
        {
            "type": "patchouli:text",
            "text": "If your device says to use channel 0 you should enable channel 1 in MIMI. Device manufacturers can label channels differently; some call them 0-15, while others call them 1-16 but either way they are the same 16 channels.$(br2)MIMI uses 1-16 so if you don't hear any notes after enabling the channel that your manual recommends, also try enabling the one(s) next to it in MIMI. (EX: If you enabled 1, also enable 2; If you enabled 8, also enable 7 and 6; Etc.)."
        },
        {
            "type": "patchouli:text",
            "title": "Play your Device",
            "text": "Once you are able to hear notes from your instrument in MIMI when you play on your device you are good to go!$(br2)You can close the Instrument Screen and continue to hear notes on your instrument as long as you continue to hold it or stay seated at it. This allows you to play up to 3 instruments at the same time with your device (one in each hand, and one block instrument)."
        },
        {
            "type": "patchouli:text",
            "title": "Latency",
            "text": "If you notice that there is a significant delay between when you press a note on your device and when you hear it in MIMI this could be due to inherit latency from your device or PC, but some settings in MIMI may help.$(br2)Check out the 'Client Config' section of this guide for more information."
        }
    ],
    "sortnum": 3
}