{
    "name": "The Transmitter",
    "icon": "mimi:transmitter",
    "category": "mimi:5files",
    "pages": [
        {
            "type": "patchouli:spotlight",
            "title": "The Transmitter",
            "item": "mimi:transmitter",
            "text": "The Transmitter is an item similar to the FileCaster but that allows you to play the MIDI File from an inserted Floppy Disk.$(br2)To use a Transmitter first craft one and then hold it in your main or off hand and right click to open the Transmitter Screen."
        },
        {
            "type": "patchouli:crafting",
            "title": "Recipe",
            "recipe": "mimi:transmitter"
        },
        {
            "type": "patchouli:text",
            "anchor": "screen",
            "title": "Transmitter Screen",
            "text": "This screen allows you to insert/remove a written Floppy Disk for this Transmitter, control the playback of the Floppy Disk, and view details about the MIDI File that the Disk contains.$(br2)The top section of the screen will list out the Channel Mapping for the current Floppy Disk in the same way as the $(l:5_2filecaster#screen)FileCaster Screen$()."
        },
        {
            "type": "patchouli:text",
            "text": "In the event of an error when loading the MIDI File from the Floppy Disk the error message will instead show in the top section of the screen.$(br2)More information on the error messages that can show can be found in the $(l:5_7errors)Error Messages$() section.$(br2)This screen will also allow you to set the Transmission Mode for the Transmitter in the same was as the $(l:5_2filecaster#transmission)FileCaster Screen$()."
        },
        {
            "type": "patchouli:text",
            "text": "You can close the Transmitter Screen once the song starts playing and it will continue to play as long as you do not drop the Transmitter or move it to a different slot in your inventory.$(br2)To quickly open the Transmitter Screen for the Transmitter that's currently playing you can use a key bind ($(l)$(k:key.mimi.midi.gui.transmitter)$())"
        },
        {
            "type": "patchouli:text",
            "title": "Connecting Instruments",
            "text": "You can connect instruments/receivers to your Transmitter in the same way as the $(l:5_2filecaster#connect)FileCaster$()."
        }
    ],
    "sortnum": 5
}