{
    "name": "The Broadcaster",
    "icon": "mimi:broadcaster",
    "category": "mimi:5files",
    "pages": [
        {
            "type": "patchouli:spotlight",
            "title": "The Broadcaster",
            "item": "mimi:broadcaster",
            "text": "The Broadcaster is a block version of the Transmitter that allows you to play the MIDI File from an inserted Floppy Disk.$(br2)To use a Broadcaster craft one, place it into the world, and then right click on it to open the Broadcaster Screen."
        },
        {
            "type": "patchouli:crafting",
            "title": "Recipe",
            "recipe": "mimi:broadcaster"
        },
        {
            "type": "patchouli:text",
            "title": "Broadcaster Screen",
            "text": "The Broadcaster Screen works in the exact same way as the $(l:5_5transmitter#screen)Transmitter Screen$(), except that inserted Floppy Disks automatically start playing when they are inserted (like a Minecraft Jukebox)."
        },
        {
            "type": "patchouli:text",
            "title": "Redstone Output",
            "text": "The Broadcaster block will output a a Redstone signal on all sides when a valid Floppy Disk is loaded and is either Playing or Paused.$(br2)If no Disk is present, an error occurs while loading the Disk, playback is stopped, or the song ends then the Broadcaster will not output any Redstone signal."
        },
        {
            "type": "patchouli:text",
            "title": "Automation",
            "text": "If you place a hopper below the Broadcaster it will remove the Floppy Disk that it has unless it is outputting a Redstone signal, which locks the Hopper.$(br2)If you place a Hopper so that it points into the Broadcaster a new Floppy Disk can be inserted when the Broadcaster is empty which it will automatically start playing."
        },
        {
            "type": "patchouli:text",
            "title": "Unloading",
            "text": "If the Chunk containing a Broadcaster is unloaded, because no players are near it, the Broadcaster will automatically stop playing the Floppy Disk that it contains and reset its playback position to the beginning.$(br2)When the Chunk is loaded again the Broadcaster will automatically start playing the Floppy Disk that it contains."
        }
    ],
    "sortnum": 6
}