{
    "name": "Error Messages",
    "icon": "minecraft:barrier",
    "category": "mimi:5files",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "When attempting to play a Floppy Disk in a Transmitter or a Broadcaster several kinds of errors may occur when trying to load the Floppy Disk.$(br2)This sections explains each of these errors and what they mean."
        },
        {
            "type": "patchouli:text",
            "title": "Failed to Load",
            "text": "This error message means that MIMI was unable to download the MIDI file from the URL you provided or the file that it got was not a valid MIDI file.$(br2)This could mean that the website is having issues, the URL doesn't point $(o)directly$() to a valid MIDI file, or the file that it points to is corrupted."
        },
        {
            "type": "patchouli:text",
            "title": "Inaccessible/Invalid",
            "text": "This error message means that the URL saved on the Floppy Disk is invalid or that MIMI was unable to reach it.$(br2)This could mean that the website is down or the URL is incorrect."
        },
        {
            "type": "patchouli:text",
            "title": "Web MIDI Disabled",
            "text": "This error message means that the server you are playing on has disabled playing MIDI files from the web in MIMI. If you are playing in Singleplayer this means your local mod settings have disabled this.$(br2)You should talk to the server owner if you get this error. If you are the Server Owner check out the 'Server Admin' section of the guide."
        },
        {
            "type": "patchouli:text",
            "title": "Site Not Allowed",
            "text": "This error message means that the server you are playing on does not allow playing MIDI files from the website that the Floppy Disk points to. If you are playing in Singleplayer this means your local mod settings don't allow this site.$(br2)You should talk to the server owner if you get this error. If you are the Server Owner check out the 'Server Admin' section of the guide."
        },
        {
            "type": "patchouli:text",
            "text": "If you want to see a list of all of the websites that the current server allows for Web MIDI Files you can run the '$(c:/mimi web list)/mimi web list$()' command."
        },
        {
            "type": "patchouli:text",
            "title": "File Not Found",
            "text": "This error message means shows only for Server URLs and means that the server cannot find a Server MIDI File that corresponds to the name in the Floppy Disk.$(br2)To see a list of available server songs you can run the '$(c:/mimi server list)/mimi server list$()' command."
        }
    ],
    "sortnum": 7
}