{
    "itemgroup.lapisworks.lapismagicshitgroup": "Magical Lapis Shit (Lapisworks)",
    "item.lapisworks.amel": "Amethyst Lazuli",
    "item.lapisworks.amel2": "Amethyst Lazuli",
    "item.lapisworks.amel3": "Amethyst Lazuli",


    "advancements.lapisworks.gotlapis.name": "Lapisworks Research",
    "advancements.lapisworks.gotlapis.description": "A deep blue, precious mineral. Just as they wrote..",


    "hexcasting.action.lapisworks:imbue_lap": "Imbue Lapis",
    "hexcasting.action.book.lapisworks:imbue_lap": "Imbue Lapis",
    "hexcasting.action.lapisworks:swap_amel": "Change Amel Appearance",
    "hexcasting.action.book.lapisworks:swap_amel": "Change Amel Appearance",
    "hexcasting.action.lapisworks:moar_health": "Enchant Skin",
    "hexcasting.action.book.lapisworks:moar_health": "Enchant Skin",
    "hexcasting.action.lapisworks:moar_attack": "Enchant Fists",
    "hexcasting.action.book.lapisworks:moar_attack": "Enchant Fists",
    "hexcasting.action.lapisworks:moar_speed": "Enchant Feet",
    "hexcasting.action.book.lapisworks:moar_speed": "Enchant Feet",
    "hexcasting.action.lapisworks:gib_dexterity": "Enchant Arms",
    "hexcasting.action.book.lapisworks:gib_dexterity": "Enchant Arms",
    "hexcasting.action.lapisworks:fireyfists": "Enchant with FireyFists",
    "hexcasting.action.book.lapisworks:fireyfists": "Enchant with FireyFists",
    "hexcasting.action.lapisworks:lightningbending": "Enchant with Lightningbending",
    "hexcasting.action.book.lapisworks::lightningbending": "Enchant with Lightningbending",


    "lapisenchantments.lapisworks.fireyfists": "FireyFists",
    "lapisenchantments.lapisworks.lightningbending": "Lightningbending",


    "hexcasting.mishap.bad_item.lapis_lazuli": "Lapis Lazuli",
    "hexcasting.mishap.bad_item.amel": "Amethyst Lazuli",

    "mishaps.lapisworks.not_enough_offhand_items": "At least %dx %s required, but only %dx %s found in offhand.",
    "mishaps.lapisworks.already_enchanted": "Cannot enchant %s with %s, as it is already enchanted with the maximum level of %s it can have right now (%d).",


    "categories.lapisworks.lapisworks": "Lapisworks",
    "categories.lapisworks.lapisworks.desc": "I have found a seemingly obscure branch of Hex Casting, \"Lapisworks\". All of their texts are blank, but some outsider texts about the branch say they are encrypted with a \"deep blue, precious mineral\".",

    "pages.lapisworks.lapisworks_placeholder.title": "Objective",
    "pages.lapisworks.lapisworks_placeholder.text": "TODO: Acquire a \"deep blue, precious mineral\" and (presumably) bring it near the \"encrypted\" pages to decipher them and reveal their text.",

    "pages.lapisworks.lapisworks_lore.title": "Eureka! Lapis Lazuli",
    "pages.lapisworks.lapisworks_lore.page1": "I held the deep blue mineral known as \"Lapis Lazuli\" near the pages of the book and the mineral was sucked into them. I tried to get it off but had to be rough, and when I looked at the pages to check their condition, they had text on them! It seems I neeed to rub Lapis Lazuli on them to see their text. Let's see..",
    "pages.lapisworks.lapisworks_lore.page2": "The branch of Lapisworks is all about harnessing the enchantment powers of Lapis Lazuli and enhancing one's own body with it. To do this media is struck into Lapis Lazuli, forming a loosely-held-by-media material known as Amethyst Lazuli, or Amel for short. The media breaches the mineral's surface and cuts the Lapis Lazuli into many extremely small chunks then connects them like a glue. Continued..",
    "pages.lapisworks.lapisworks_lore.page3": "This allows any outside media to suck out all the enchantment energy of the Lapis Lazuli by interacting with the Amel's media layer. While I have found many patterns (documented just beside this entry), some pages of the texts remain blank and not even rubbing with Lapis Lazuli or Amel can decipher them. I suppose I will find out soon enough (or even never as the deciphering could be lost to time) and must be content with what I have now.",

    "pages.lapisworks.lapisworks_patterns.title": "Lapisworks Patterns",
    "pages.lapisworks.lapisworks_patterns.imbue_lap.summary": "Transform all the Lapis Lazuli in my offhand into a loosely-held material called Amethyst Lazuli or Amel for short. Costs twice the number of Amethyst Shards as Lapis Lazuli in my offhand.",
    "pages.lapisworks.lapisworks_patterns.swap_amel.summary": "While I could shape Amel into whatever I want, I have decided on three primary shapes which are familiar to me. I can use this pattern to mold the Amel in my offhand for free.",
    "pages.lapisworks.lapisworks_patterns.bodily_enchantments_wait": "It is worth noting here that the next patterns can enchant my body, but the enchantments disappear upon death.",
    "pages.lapisworks.lapisworks_patterns.moar_health.summary": "Pass in an entity and a number of half-hearts, and it enchants that entity's skin thus increasing their health. The amount of expended Amel is the number given and the cost in media is twice the expended Amel. Continued..",
    "pages.lapisworks.lapisworks_patterns.moar_health.detailed": "The limit to this is twice the entity's maximum healthiness and it will not expend any Amel or media above that limit (no wastefulness). Curiously, the enchanted skin also protects against Nature taking it's due, making it impossible for Nature to take a piece of the entity's mind. Interestingly enough, old texts suggest that beyond a certain level of power mages would lose sanity, and this is how certain powerful mages were able to keep their sanity. In any case my maximum healthiness is about twenty half-hearts.",
    "pages.lapisworks.lapisworks_patterns.moar_attack.summary": "Pass in an entity and a number of half-hearts, and it enchants that entity's fists thus increasing their physical damage upon hit. Expends one Amel and five Amethyst Shards per half-heart. Limit is four times the norm or just four for me.",
    "pages.lapisworks.lapisworks_patterns.moar_speed.summary": "Enchants the given entity's feet to increase their movement speed. Costs 1x Amel and 5x Amethyst Shards. Limit is 3x the norm. The norm for me is about 1.",
    "pages.lapisworks.lapisworks_patterns.gib_dexterity.summary": "Enchants the given entity's arms, increasing the rate at which they may attack. Costs 1x Amel and 16x Amethyst Shards. Limit is 4 PLUS the norm.",

    "pages.lapisworks.lapisworks_great.title": "ENCHANTMENTS",
    "pages.lapisworks.lapisworks_great.aahhhhelp": "I HAVE SEEN I HAVE SEEN I NEED IT I NEED MY SANITY BACK ENCHANT SKIN CAN I ENCHANT MIND PLEASE MUST NOT LOSE SELF TAKE FIVE MINTUE BREAK HAVE NO TIME MUST DOCUMENT BEFORE",
    "pages.lapisworks.lapisworks_great.explanation": "THE EMPTY PAGES. WINKS OF MEDIA IN MY EYES GATHER TOGETHER. I CAN SEE I CAN SEE I CAN READ MUST WRITE DOWN. ALL OF THESE PATTERNS COST 64 AMEL FROM MY OFFHAND.",
    "pages.lapisworks.lapisworks_great.fireyfists.summary": "ENCHANT AN ENTITY'S FISTS WITH FIRE, AND IT WILL HENCEFORTH LIGHT ANY ENTITIES IT HITS ON FIRE FOR THREE SECONDS. CONSUMES 10 CHARGED AMETHYST. HAS 1 LEVEL.",
    "pages.lapisworks.lapisworks_great.lightningbending.summary": "ENCHANT AN ENTITY'S FISTS WITH LIGHTNING. CONSUMES 20 CHARGED AMETHYST PER LEVEL. 3 LEVELS, EACH IMPROVING THE USER'S ABILITY TO CHANNEL LIGHTNING.",
    "pages.lapisworks.lapisworks_great.lightningbending.detailed": "LEVEL ONE: EACH STRIKE CHANNELS THE LIGHTNING IN A THUNDERSTORM TO THE STRUCK VICTIM.$(br2)LEVEL TWO: STRIKES HIT WITH LIGHTNING UNDER RAIN AS WELL.$(br2)LEVEL THREE: SO GREAT EACH STRIKE IS EMPOWERED WITH LIGHTNING, NO MATTER THE WEATHER CONDITIONS.",

    "pages.lapisworks.lapisworks_mishaps.title": "Lapisworks Mishaps",
    "pages.lapisworks.lapisworks_mishaps.summary": "With a new branch of Hex Casting comes new mishaps. I've documented them here.",
    "pages.lapisworks.lapisworks_mishaps.notenoughamel.title": "Not Enough Items",
    "pages.lapisworks.lapisworks_mishaps.notenoughamel.summary": "I have the correct item in my offhand, but not enough of it. Brown particles. Upends my held items and throws them to the ground.",
    "pages.lapisworks.lapisworks_mishaps.leveltoohigh.title": "Already at Maximum Level",
    "pages.lapisworks.lapisworks_mishaps.leveltoohigh.summary": "Perhaps real enchantments like my enchanted tools was what those empty pages were about? Anyway. This means the entity is already enchanted at the maximum level of this enchantment. Differing particles for each enchantment, and no punishment."
}