{
	"name": "Introduction",
	"icon": "qmd:textures/particles/proton.png",
	"category": "qmd:particles",
	"sortnum": 0,
	"pages": [
		{
			"type": "text",
			"text": "Fundamental to the core mechanics of QMD are subatomic particles. In QMD you create, manipulate, transmute and annihilate particles."
		},
		{
            "type": "text",
            "title": "Particle stacks",
            "text": "In QMD particles are stored in particle stacks like items in minecraft are stored in item stacks. But there are major differences between particle stacks and item stacks. Particle Stacks cannot be held by the player they are not items but generally beams of particles. Particle stacks have 4 properties: $(li)Type $(li)Amount $(li)Energy $(li)Focus"
        },
        {
            "type": "text",
            "title": "Type",
            "text": "Particles come in many different types. Some examples are protons, neutrons and electrons which make up all the atoms around you. Each of them have different properties like mass, charge and spin and they can be used for different things. Their properties can be seen on JEI particle information tab by looking up their recipes in JEI."
        },
        {
            "type": "text",
            "title": "Energy",
            "text": "Each particle stack has an associated kinetic energy measured in electron volts (eV), basically how fast the particle is moving. The energy is most important property of a particle stack as it can determine what reactions (recipes) they can do."
        },
        {
            "type": "text",
            "text": "The energy of particles are manipulated using accelerators. $(l:accelerators/linear_accelerator)Linear$(/l) and $(l:accelerators/ring_accelerator)Synchrotron$(/l) accelerators increase their energy while $(l:accelerators/decelerators)decelerators$(/l) decrease their energy. The energy of particles can also be changed in reactions."
        },
        {
            "type": "text",
            "title": "Focus",
            "text": "Focus is how confined a beam of particles is (it can be thought of a measure of the inverse area of the beam). Focus's main purpose is to tell you how far the beam of particles can travel. If a particle stack focus is less than ore equal to zero then it can't propagate. Each block the particles travel they lose focus equivalent to the beam attenuation rate. This rate can be seen on the tool tips for Beam blocks and Beamlines."
        },
        {
            "type": "text",
            "text": "Focus also has use in some recipes. some recipes have a minimum focus or focus range they required to work these are stated on the recipes (specifically if you hover over the input particle to a recipe in JEI it focus will be the minimum required). "
        },
        {
            "type": "text",
            "title": "Amount",
            "text": "Is the amount of particles measured in particle units (pu). Generally it represents the particle units per tick for example a tungsten filament gives off 100 pu of electrons in a Ion Source this means it gives 100 pu/t. But in recipes like the $(l:particle_chambers/target_chamber)Target Chamber$(/l), $(l:particle_chambers/beam_dump)Beam Dump$(/l) and $(l:containment_chambers/neutral_containment)Neutral Containment Chamber$(/l) it is the cumulative amount needed to complete the recipe. For example a recipe that requires 120 kpu will take 1200 ticks to complete with a 100 pu/t input."
        },
        {
            "type": "text",
            "title": "Amount",
            "text": "Increasing pu/t is the hardest property to increase it can only be done with clever manipulation of particles in $(l:particle_chambers/target_chamber)target chambers$(/l) and/or $(l:particle_chambers/decay_chamber)decay chambers$(/l) to create effective particle multiplier setups."
        }
		
	]
}