{
	"name": "Laser Tree Farm",
	"icon": "warpdrive:laser_tree_farm",
	"category": "0_basics",
	"pages": [
		{
			"type": "text",
			"text": "A $(item)Laser Tree Farm$() is your all around automatic farm for planting and harvesting. It supports trees, crops and even rubber wet spots.$(br2)The laser itself is produced by a $(l:0_basics/laser_medium)Laser Medium$() attached to the farming block. The latest scans the area around it looking for soil to plant, crops and logs to harvest right above it."
		},
		{
			"type": "text",
			"text": "As it's packed with optical systems and computing power, you'll need to place an external container to hold your harvest. Any chest or assimilated container placed next to it will work.$(br2)By order of the $(item)Galactical energy conservation act$(), farming operation automatically stops when no more storage is available. Overflowing items are dropped on the ground, so remember to cleanup the mess before nature does its work."
		},
		{
			"type": "text",
			"title": "History",
			"text": "While developing the next mining laser, one of our interns mistyped the target coordinates and started 'mining' our own space station biodome instead of the expected test asteroid.$(br2)Condemned to food rations, the engineering team quickly converted the existing rubber collection laser prototype into a fully functional farming tool for the crew."
		},
		{
			"type": "crafting",
			"recipe": "warpdrive:laser_tree_farm@0",
			"title": "Laser tree farm",
			"text": "Place your $(item)Laser Tree Farm$() block at ground level, same as your soil.$(br2)You need at least one $(l:0_basics/laser_medium)Laser Medium$() to output a laser beam, placed on any horizontal side, or below the $(item)Laser Tree Farm$()."
		},
		{
			"type": "text",
			"text": "Each $(l:0_basics/laser_medium)Laser Medium$() needs a power connection in $(item)FE$(), $(item)RF$() or $(item)EU$() form. You'll need to recharge the medium periodically to sustain continuous farming.$(br2)Harvested items are stored in the storage containers found next to the $(item)Laser Tree Farm$(). Place a Chest (or equivalent) on any horizontal side, or below the $(item)Laser Tree Farm$(). The same chest is used to provide saplings and seeds to be planted."
		},
		{
			"type": "text",
			"title": "Control",
			"text": "Right click the $(item)Laser Tree Farm$() while holding a Redstone torch to enable/disable it.$(br2)For finer control, place an Advanced Computer right next to it, horizontally or below it.$(br)Refer to $(l:0_basics/programmable_blocks)Programmable blocks$() to initialize it, then type $(item)farm help$().$(br)Once started, farming continues on its own as the script only shows the current state.$(br)To stop farming, reset the computer, then type $(item)stop$()."
		},
		{
			"type": "text",
			"title": "Upgrades",
			"text": "Adding more $(l:0_basics/laser_medium)Laser Mediums$() will increase the range, which is mandatory for taller trees like Jungle wood.$(br2)Multiple farming setup can be connected to a single Computer using Networking cables and Wired modem (for ComputerCraft), or Cables (for OpenComputers). The preloaded script automatically detects all connected $(item)Laser Tree Farms$() and control them."
		},
		{
			"type": "text",
			"title": "Hints",
			"text": "By default, Jungle logs will turn into $(l:0_basics/rubber)Raw rubber clumps$().$(br2)Computer controls allow to collect leaves or not, drastically changing the speed of operation.$(br2)With IC2, you can choose to just collect rubber without breaking the wet spot of the rubber trees."
		}
	],
	"sortnum": 8
}