{
	"name": "Mining Laser",
	"icon": "warpdrive:mining_laser",
	"category": "0_basics",
	"pages": [
		{
			"type": "text",
			"text": "A ship's $(item)Mining Laser$() does the work of many men through the use of a powerful laser precisely cutting through the blocks and pulling them aboard the ship.$(br2)The first $(item)Mining Laser$() was made by one of our (lazy) geology research interns who decided that gathering samples from asteroids with a pick axe was too tedious."
		},
		{
			"type": "text",
			"text": "Many different version of the $(item)Mining Laser$() have been created since, up to the current ship mounted one. While other versions still exist in the wild, they're considered fairly unstable and not accepted aboard ships, so we won't talk about them here...$(br2)The laser itself is produced by a $(l:0_basics/laser_medium)Laser Medium$() attached to the mining block. The latest scan a layer before mining it."
		},
		{
			"type": "text",
			"text": "As it's packed with optical systems and computing power, you'll need to place an external container to collect mined materials. Any chest or assimilated container placed next to it will do.$(br2)By order of the $(item)Galactical energy conservation act$(), mining operation automatically stops when no more storage is available. Overflowing items are dropped on the ground, so remember to cleanup the mess before nature does its work."
		},
		{
			"type": "crafting",
			"recipe": "warpdrive:mining_laser@0",
			"title": "Mining Laser",
			"text": "Place your $(item)Mining Laser$() block at the bottom of your ship.$(br2)You need at least one $(l:0_basics/laser_medium)Laser Medium$() to output a laser beam, placed on any horizontal side, or above the $(item)Mining Laser$()."
		},
		{
			"type": "text",
			"text": "Each $(l:0_basics/laser_medium)Laser Medium$() needs a power connection in $(item)FE$(), $(item)RF$() or $(item)EU$() form. You'll need to recharge the medium periodically to sustain continuous mining.$(br2)Mined items are stored in the storage containers found next to the $(item)Mining Laser$(). Place a Chest (or equivalent) on any horizontal side, or above the $(item)Mining Laser$()."
		},
		{
			"type": "text",
			"title": "Control",
			"text": "Right click the $(item)Mining Laser$() while holding a Redstone torch to enable/disable it.$(br2)For finer control, place an Advanced Computer right next to it, horizontally or above it.$(br)Refer to $(l:0_basics/programmable_blocks)Programmable blocks$() to initialize it, then type $(item)mine help$().$(br)Once started, mining continues on its own as the script only shows the current state.$(br)To stop mining, reset the computer, then type $(item)stop$()."
		},
		{
			"type": "text",
			"title": "Upgrades",
			"text": "Adding more $(l:0_basics/laser_medium)Laser Mediums$() will increase the range.$(br2)Multiple mining setup can be connected to a single Computer using Networking cables and Wired mode (for ComputerCraft), or Cables (for OpenComputers). The preloaded script automatically detects all connected $(item)Mining Lasers$() and control them."
		},
		{
			"type": "text",
			"title": "Hints",
			"text": "While you can start mining at an offset from the $(item)Mining Laser$(), you'll still need a clear line of sight as the laser won't go through force field or glass blocks.$(br2)Computer controls allow to collect everything or only ores, saving a bit of storage space for the same speed.$(br)You can enable silktouch for an extra energy cost, allowing you to maximize processing output."
		}
	],
	"sortnum": 10
}