{
	"name": "Subspace Capacitor",
	"icon": "warpdrive:capacitor.superior",
	"category": "0_basics",
	"pages": [
		{
			"type": "text",
			"text": "Energy storage has always been a long struggle, even before space travel was invented. While many researchers looked into it, money was hard to come for financing the most ambitious ones and sometime, money isn't the right answer."
		},
		{
			"type": "text",
			"text": "The real solution came from a small research team from Parsylonia IV while they were working on a lithium quartz based atomic clock.$(br2)As they were low on budget, it was frequent for them to use dinnerware instead of test tube. That is until their team leader poured his favorite intense peppermint tea in a cup with remains of lithium quartz dust..."
		},
		{
			"type": "text",
			"text": "A few seconds later, a $(item)Subspace drain$() was created from the unusual mixture and started sucking power from all nearby sources, whether it was chemical, electrical or mechanical.$(br2)While it took a few minutes for the team to understand what happened, it was months before their could actually extract power from the drain, effectively making the first $(item)Subspace capacitor$()."
		},
		{
			"type": "text",
			"text": "Upon publishing their results, many hobbyists wanted to reproduce the original experiment in their basement, causing Peppermint to reach the status of $(item)Green gold$() (or $(item)Leprechaun gold$() depending on who you ask, since it's fairly easy to produce).$(br2)While Green gold is no longer a thing these days, $(item)Subspace capacitors$() are still fairly common and Parsylonia still produces the most efficient ones around."
		},
		{
			"type": "text",
			"title": "General principles",
			"text": "$(item)Subspace capacitors$() are you ultimate universal energy storage. They exist in various storage capacity and transfer rate with upgrades.$(br2)Each side of the capacitor can be configured using any $(l:0_basics/tuning_tools)Tuning tool$() to either $(#4680E8)$(l)input$(), $(#E88018)$(l)output$() or $(l)disabled$() mode."
		},
		{
			"type": "image",
			"border": true,
			"images": [ "warpdrive:textures/book/subspace_capacitors.png" ],
			"text": "They accept and provide any standard energy like $(item)FE$(), $(item)RF$() or $(item)EU$()."
		},
		{
			"type": "text",
			"text": "Due to their inner nature, $(item)EU$() transfer rates are defined per block while $(item)FE$() & $(item)RF$() transfer rates are defined per face, hence it's usually much faster to use the latest.$(br2)While the original design was greatly improved over time, Subspace energy is still coming with a small loss when converting power to/from subspace form."
		},
		{
			"type": "crafting",
			"recipe": "warpdrive:capacitor.basic@0",
			"title": "Basic Sub. Capacitor",
			"text": "A Basic laser medium is fairly cheap and sufficient for most simple setups. However, it can't be stacked to upgrade the system."
		},
		{
			"type": "crafting",
			"recipe": "warpdrive:capacitor.advanced@0_direct",
			"recipe2": "warpdrive:capacitor.advanced@0_upgrade",
			"title": "Advanced Sub. Capacitor",
			"text": ""
		},
		{
			"type": "crafting",
			"recipe": "warpdrive:capacitor.superior@0_direct",
			"recipe2": "warpdrive:capacitor.superior@0_upgrade",
			"title": "Superior Sub. Capacitor",
			"text": ""
		},
		{
			"type": "crafting",
			"recipe": "warpdrive:component@21_direct",
			"title": "Superconductor",
			"text": "A typical capacitor loose 5 to 7% depending on energy type and transfer rates.$(br)Adding $(item)Superconductors$() to the conversion circuit will greatly reduce the lost down to 2%, or even 0% in some edge cases."
		},
		{
			"type": "text",
			"title": "Zero Point Module",
			"text": "Years have passed and researchers are still dreaming of that ultimate Subspace capacitor capable of storing near infinite energy. They call it from an old mythology going back to great Egypt time: the $(item)Zero Point Module$() or $(item)ZPM$() in short. Those who've seen one are few as only the Creative ones are able to get it... so far..."
		}
	],
	"sortnum": 9
}