{
  "ars_caelum.ritual_desc.ritual_conjure_island_blazing": "Creates an island of Blazing Archwoods and lava, converts the area to Archwood Forest. Requires a full jar of Source to begin. NOTE: This ritual should be performed at least 14 blocks from any other block. ",
  "ars_caelum.ritual_desc.ritual_conjure_island_cascading": "Creates an island of Cascading Archwoods, coral, and sugarcane. Requires a full jar of Source to begin. NOTE: This ritual should be performed at least 14 blocks from any other block. ",
  "ars_caelum.ritual_desc.ritual_conjure_island_end_portal": "Creates an island with an end portal. This ritual requires a full jar of Source. NOTE: This ritual must be performed 14 blocks away from other blocks.",
  "ars_caelum.ritual_desc.ritual_conjure_island_flourishing": "Creates an island of Flourishing Archwoods, moss, glow berries, and bamboo. Converts the area to Mangrove Swamp. Requires a full jar of Source to begin. NOTE: This ritual should be performed at least 14 blocks from any other block. ",
  "ars_caelum.ritual_desc.ritual_conjure_island_geode": "Creates an island in the shape of an Amethyst Geode. Requires a full jar of Source to begin. NOTE: This ritual should be performed at least 14 blocks from any other block. ",
  "ars_caelum.ritual_desc.ritual_conjure_island_sculk": "Creates an island of Sculk and turns the biome to Deep Dark. Requires a full jar of Source to begin. NOTE: This ritual should be performed at least 14 blocks from any other block. ",
  "ars_caelum.ritual_desc.ritual_conjure_island_starter": "",
  "ars_caelum.ritual_desc.ritual_conjure_island_vexing": "Creates an island of Vexing Archwoods, source berries, mycelium, and mushrooms. Converts the area to Mushroom Island. Requires a full jar of Source to begin. NOTE: This ritual should be performed at least 14 blocks from any other block. ",
  "ars_caelum.ritual_desc.ritual_conjure_island_village": "Conjures an archwood village island with several villagers.",
  "ars_caelum.ritual_desc.ritual_elder_summon": "Summons waves of Guardians. Can be augmented with a Sea Lantern to summon an Elder Guardian.",
  "ars_caelum.ritual_desc.ritual_mana_regeneration": "Grants mana regeneration to all players nearby.",
  "ars_caelum.ritual_desc.ritual_sedimentation": "Converts four nearby water sources and will produce cobblestone on the last source consumed. Augment with Deepslate to produce Deepslate instead.",
  "ars_caelum.tablet_of": "Tablet of %s",
  "item.ars_caelum.ritual_conjure_island_blazing": "Conjure Island: Blazing",
  "item.ars_caelum.ritual_conjure_island_cascading": "Conjure Island: Cascading",
  "item.ars_caelum.ritual_conjure_island_end_portal": "Conjure Island: End Portal",
  "item.ars_caelum.ritual_conjure_island_flourishing": "Conjure Island: Flourishing",
  "item.ars_caelum.ritual_conjure_island_geode": "Conjure Island: Geode",
  "item.ars_caelum.ritual_conjure_island_sculk": "Conjure Island: Deep Dark",
  "item.ars_caelum.ritual_conjure_island_starter": "Conjure Island: Starter",
  "item.ars_caelum.ritual_conjure_island_vexing": "Conjure Island: Vexing",
  "item.ars_caelum.ritual_conjure_island_village": "Conjure Island: Village",
  "item.ars_caelum.ritual_elder_summon": "Summon Guardians",
  "item.ars_caelum.ritual_mana_regeneration": "Mana Regeneration",
  "item.ars_caelum.ritual_sedimentation": "Sedimentation"
}