{
  "name": "Electrostatic Compressor",
  "icon": "pneumaticcraft:electrostatic_compressor",
  "category": "compressors",
  "advancement": "pneumaticcraft:advanced_pressure_tube",
  "pages": [
    {
      "type": "text",
      "text": "The $(item)Electrostatic Compressor/$ is a $(l:base_concepts/pressure_tiers)tier 2/$ air $(l:base_concepts/pressure)compressor/$, which uses $(thing)lightning/$ for the energy to produce compressed air.$(p)When it is struck by lightning it will instantly produce 200,000mL of air. Seems like a lot, but how often do you see a Charged Creeper sneaking around? You have to have it get struck."
    },
    {
      "type": "text",
      "text": "To increase the chance of this happening, you can connect $(item)Iron Bars/$ to this machine which act as a conductor for the lightning bolt.$(p)Advice would be to create a large $(thing)grid/$ of Iron Bars: they can be up 5 blocks away horizontally (circular radius), and up to 5 blocks above or below, but they must all be connected to the $(item)Electrostatic Compressor/$ via each other."
    },
    {
      "type": "image",
      "images": [
        "pneumaticcraft:textures/patchouli/electrostatic_compressor.png"
      ]
    },
    {
      "type": "text",
      "text": "Note that in the image to the left, only the central compressor has a sufficiently large grid surrounding it for maximum efficiency; the other compressors will have a lower chance of a triggering a strike (though this is still more effective than having only a single compressor in the middle of the grid)."
    },
    {
      "type": "text",
      "text": "With multiple $(item)Electrostatic Compressors/$ on a $(thing)grid/$, the air from a strike is shared equally amongst them.$(p)To prevent a compressor from blowing up when the pressure gets too high after a strike, you can connect up $(item)Iron Bars/$ on the bottom side of the compressor. This way the energy can be dissipated to ground instead of going into the machine."
    },
    {
      "type": "text",
      "text": "This dissipation only happens when the danger pressure of the compressor has been reached, not sooner. Each $(item)Iron Bar/$ $(italic)directly/$ below the compressor (on the same Y axis) will dissipate 10,000mL of excess air. $(p)Thus, with 10 compressors on a shared $(thing)grid/$, $(ttcolor)$(t:200000 / 10 = 20000 air produced per compressor; 10000 x 2 = 20000 air dissipated)only 2 Iron Bars/$ are needed below each compressor. (You could also add $(l:base_concepts/upgrades#security)Security Upgrades/$ to the compressor, but that's more expensive and less effective)"
    },
    {
      "type": "text",
      "text": "To improve the chance of a strike, you can also place up to 10 $(item)Iron Bars/$ directly $(italic)above/$ the compressor to form a $(thing)lightning rod/$. Each bar will slightly improve the strike chance."
    },
    {
      "type": "text",
      "text": "$(bold)Note:/$ unlike in previous versions of $(pncr), natural lightning bolts do $(italic)not/$ add air to the compressor (this was highly abusable using other mods to create lightning). Instead the compressor has a small chance to create a \"fake\" bolt. This chance is $(italic)very/$ small in clear weather, but improves when $(thing)raining/$, and improves greatly in a $(thing)thunderstorm/$."
    },
    {
      "type": "crafting",
      "text": "Creating an $(item)Electrostatic Compressor/$",
      "recipe": "pneumaticcraft:electrostatic_compressor"
    }
  ]
}