{
  "name": "Thermal Compressor",
  "icon": "pneumaticcraft:thermal_compressor",
  "category": "compressors",
  "advancement": "pneumaticcraft:pressure_tube",
  "pages": [
    {
      "type": "text",
      "text": "The $(item)Thermal Compressor/$ is a simple compressor which uses the $(l:base_concepts/heat)temperature/$ differential on opposite (horizontal) sides to produce $(l:base_concepts/pressure)compressed air/$. The greater the temperature gradient, the more air that is produced.$(p)Note: trying to run this compressor purely from a $(l:machines/vortex_tube)Vortex Tube/$ won't work; you will get a net pressure loss."
    },
    {
      "type": "image",
      "images": [
        "pneumaticcraft:textures/patchouli/thermal_compressor.png"
      ],
      "border": "true",
      "text": "$(italic)A Thermal Compressor using Lava and Packed Ice to provide a temperature gradient/$"
    },
    {
      "type": "text",
      "text": "The $(item)Thermal Compressor's/$ North-South and East-West faces are thermally connected to another, but there's no cross-connection between N-S or E-W, so you can have two independent temperature gradients on one compressor.$(p)Heat will equalize across the connections, so some effort will be required to maintain a useful temperature differential."
    },
    {
      "type": "text",
      "title": "Applications",
      "text": "There are three primary situations where the $(item)Thermal Compressor/$ may be of use:$(li)To utilise waste heat (or cold!) from $(italic)one/$ side of a $(item)Vortex Tube/$. Normally you will only be using the hot or cold side of a Vortex Tube, and venting the other side via a $(l:machines/heat_sink)Heat Sink/$. However, the $(item)Thermal Compressor/$ offers the opportunity to reclaim some of this waste heat or cold as air pressure."
    },
    {
      "type": "text",
      "title": "Applications (cont.)",
      "text": "$(li)To utilise the waste heat from advanced compressors such as the $(l:compressors/advanced_air_compressor)Advanced Air Compressor/$. Normally you would dump this heat into the atmosphere using one or more $(l:tools/heat_sink)Heat Sinks/$, but with the Thermal Compressor, it's also possible to reclaim some of this waste heat as pressure."
    },
    {
      "type": "text",
      "title": "Applications (cont.)",
      "text": "$(li)If you have the means to obtain large quantities of naturally hot or cold substances, e.g. $(l:base_concepts/heat_sources)lava, or blocks from other mods/$, you may be able to use them to generate some pressure. You will likely also need to be able to automate the placement and removal of heat sources and spent sources; $(l:tools/drone)Drones/$ can do this, as can many other modded solutions."
    },
    {
      "type": "text",
      "title": "Redstone Control",
      "text": "This compressor can be controlled by a $(#f00)redstone signal/$; if disabled, pressure generation stops, and the thermal resistance between the North-South and East-West faces greatly increases (a little heat will still leak across, but far less than when the compressor is running). This can be useful to store up energy as a heat differential when pressure is not needed, e.g. when your tube network is fully pressurized."
    },
    {
      "type": "crafting",
      "text": "Creating a $(item)Thermal Compressor/$",
      "recipe": "pneumaticcraft:thermal_compressor"
    }
  ]
}
