{
  "name": "Incense Altar",
  "icon": "bloodmagic:incensealtar",
  "category": "bloodmagic:utility",
  "pages": [
    {
      "type": "text",
      "text": "  The $(item)Incense Altar$() is a multiblock structure that can be used to boost your self-sacrificing at a $(l:bloodmagic:altar/blood_altar)Blood Altar.$(/l) By standing nearby your setup, the $(item)Incense Altar$() will calm your soul based on the area's total \"Tranquility\", allowing you to significantly increase your LP gains."
    },
    {
      "type": "crafting",
      "recipe": "bloodmagic:incense_altar"
    },
    {
      "type": "text",
      "text": "  The basic Tier 1 setup of an $(item)Incense Altar$() is the altar itself; place it down anywhere (You may want to set up a 3x3 block platform, this will be helpful later) and stay within a 5 block radius of the altar.$(br2)  While the altar is working, it will emit flame particles from its top and transform your $(l:bloodmagic:altar/blood_altar#knife)Sacrificial Knife.$(/l) Once your knife starts to shine, holding and releasing right click near a Blood Altar will sacrifice 90% of your health all at once."
    },
    {
      "type": "image",
      "images": [
        "bloodmagic:images/entries/utility/incense_altar1.png"
      ],
      "title": "Basic Setup",
      "border": true,
      "text": "Basic setup showing the 3x3 square of blocks before the path blocks."
    },
    {
      "type": "text",
      "text": "  What is more, based on the total Tranquility of the area you will receive a bonus to the LP added to the altar. Hovering over the $(item)Incense Altar$() with either a $(l:bloodmagic:alchemy_array/sigil/divination)Divination Sigil$(/l) or $(l:bloodmagic:alchemy_array/sigil/seer)Seer's Sigil$() will display the total Tranquility of the setup (top number) and the percentage bonus received when sacrificing (bottom number). When you sacrifice, it will take the LP that you would normally get and multiply it by (1 + bonus/100)."
    },
    {
      "type": "image",
      "images": [
        "bloodmagic:images/entries/utility/incense_altar2.png"
      ],
      "title": "Incense HUD",
      "border": true,
      "text": "Incense HUD, default in top left corner, showing a self-sacrifice bonus of +20%."
    },
    {
      "type": "text",
      "text": "  \"But Way, how can I increase this bonus?\" Why, by increasing the tranquility of the surrounding area! ...That may be a bit ambiguous.$(br2)  To increase the Tranquility of the area, you must place paths leading out from your Incense Altar. These paths need to be constructed from a three wide set of Path blocks, such as the $(item)Wooden Path$(), that extend from the 3x3 set of solid reference blocks in all four cardinal directions."
    },
    {
      "type": "crafting",
      "recipe": "bloodmagic:path/path_wood",
      "recipe2": "bloodmagic:path/path_woodtile"
    },
    {
      "type": "crafting",
      "recipe": "bloodmagic:path/path_stone",
      "recipe2": "bloodmagic:path/path_stonetile"
    },
    {
      "type": "crafting",
      "recipe": "bloodmagic:path/path_wornstone",
      "recipe2": "bloodmagic:path/path_wornstonetile"
    },
    {
      "type": "text",
      "text": "  Each new \"ring\" of path blocks follow a set of rules:$(li)All path blocks on the same ring have to be on the same level.$(li)The next ring of path blocks may not be more than 5 blocks higher/lower than the previous ring.$(li)The blocks that are the same level or up to two blocks above the path blocks' ring count towards the total Tranquility - these are indicated by the glass blocks in the picture."
    },
    {
      "type": "image",
      "images": [
        "bloodmagic:images/entries/utility/incense_altar.png"
      ],
      "title": "Incense Altar",
      "border": true,
      "text": "Incense Altar with different Path orientations."
    },
    {
      "type": "text",
      "text": "Furthermore:$(li)The efficacy of each type of path block only lasts a certain distance: wooden paths can only go three rings, stone paths for up to five rings, worn stone paths for seven rings, and obsidian paths for nine rings.$(bn2)  Now obviously, not every type of block will count towards your Tranquility. Not just any ol' cobble will do, no! We need crops, dirt, and even... lava?"
    },
    {
      "type": "text",
      "text": "  There are multiple block categories that count towards the total Tranquility. In no particular order, they are: Plants, Crops, Trees, Earthen, Water, Fire, and Lava. The Incense Altar will look at all of the blocks that are within its range (set by the path blocks) and tabulate how much total Tranquility of each Type there is. Once done, it will calculate the total Tranquility by square-rooting the Tranquility of each type and then adding them together."
    },
    {
      "type": "text",
      "text": "This means that for later-game setups, it is best to have many different types of Tranquility. Although other mods may add their own, and more will be added later, the blocks that contribute to Tranquility are: Lava, Water, Life Essence, Netherrack, Dirt, Farmland, Potatoes, Carrots, Wheat, Netherwart, Beetroots, Leaves, Logs, Fire, and Grass."
    },
    {
      "type": "image",
      "images": [
        "bloodmagic:images/entries/utility/incense_altar3.png"
      ],
      "title": "Incense Altar Setup",
      "border": true,
      "text": "Late-game Incense Altar setup with many different levels."
    },
    {
      "type": "text",
      "text": "Of course, your setup can be as steep or as shallow as you want (Within reason, as defined earlier in this entry). $(br2) It is important to note that the tranquility bonus is capped by the size of your altar (and thus, the tier of path you are using). The caps are as follows: $(li) No Path: 20%. $(li) Wooden Path: 60%. $(li) Stone Path: 120%. $(li) Worn Stone Path: 200%. $(li) Obsidian Path: 300%. (Obsidian is NYI, sadly)"
    },
    {
      "type": "image",
      "images": [
        "bloodmagic:images/entries/utility/incense_altar4.png"
      ],
      "title": "Incense Altar Setup",
      "border": true,
      "text": "A very simple Incense Altar. Note the (optional) mixing of different path blocks."
    }
  ]
}