{
  "name": "Soul Types",
  "icon": "elementaristics:incantation_light",
  "category": "soulogy",
  "advancement": "elementaristics:progress_ascension_2",
  "pages": [
    {
      "type": "text",
      "text": "My studies have shown that there are apparently different soul types. $(br)I can identify my own soul type with the ritual called $(marked)Enlightenment's Sighing$(). "
    },
    {
      "type": "concentrator_recipe",
      "anchor": "recipe_light",
      "recipe": "elementaristics:incantation_light",
      "text": "$(o)Sighs in enlightenment$()"
    },
    {
      "type": "text",
      "title": "Common Souls",
      "text": "I have sorted the soul types in three different groups: the common, rare and legendary souls. As one can think, the groups are sorted by rarity. The group of $(marked)Common Souls$() completely consists of $(marked)Elemental Souls$(), which are healthy souls with a focus on a certain element. "
    },
    {
      "type": "text",
      "title": "Elemental Souls",
      "text": "The sub-group of Elemental Souls includes five soul types: Air, Earth, Fire, Water and Magan Souls. They have all been created by multiversal influences with a dominating aspect. $(br)One should be aware that there is no such thing as an \"Aether Soul\", as the Aether is really just the space, and does not offer the possibility of radiation."
    },
    {
      "type": "spotlight",
      "title": "Air Soul",
      "item": "elementaristics:essence:0",
      "text": "Due to the dominating influence of the air aspect during their creation, these souls have developed an affinity for said aspect.$(br)Creatures of these souls tend to be agile, fast and deft."
    },
    {
      "type": "spotlight",
      "title": "Earth Soul",
      "item": "elementaristics:essence:1",
      "text": "These souls are bound to earth and the body.$(br)Creatures of these souls are sturdy like stone, and tend to have connections to the more material world."
    },
    {
      "type": "spotlight",
      "title": "Fire Soul",
      "item": "elementaristics:essence:3",
      "text": "Fire souls burn with the raw energy of fire. Their passion is expressed in warmth, and their rage is put to use in flames.$(br)They have a potential of power generally not seen in common souls."
    },
    {
      "type": "spotlight",
      "title": "Water Soul",
      "item": "elementaristics:essence:2",
      "text": "Water souls go with the flow of energies, the flow of sentiments and the flow of the blood.$(br)They have one of the strongest connections to life and purity."
    },
    {
      "type": "spotlight",
      "title": "Magan Soul",
      "item": "elementaristics:essence:5",
      "text": "Unlike the other common souls, the magan soul was not majorly influenced by one aspect, but by multiple aspects.$(br)Although this removed all professions, it granted them a healthy repertoire of magical power."
    },
    {
      "type": "text",
      "title": "Rare Souls",
      "text": "The $(marked)Rare Souls$() are often built incorrectly or were lowly manipulated by an external force (of the special kind, mind you). $(br)People with rare souls often get interesting advantages at a cost."
    },
    {
      "type": "spotlight",
      "title": "Mana Soul",
      "item": "elementaristics:essence:17",
      "text": "Mana souls have received an unhealthy amount of mana upon creation.$(br)Although this mana grants an immense capacity for magan, it interferes with other important functions, such as emotions.$(br)People with mana souls will still perceive the emotion; however, they will not $(o)feel$() it."
    },
    {
      "type": "spotlight",
      "title": "Unstable Soul",
      "item": "elementaristics:essence:13",
      "text": "When the Silver Thread of a soul is damaged, the mind of the future inheritor is damaged, too. When this happens, an Unstable Soul is born.$(br)These souls have broken boundaries, which can have beneficial effects, but also harms $(t:This can also express as Warp)sanity$()."
    },
    {
      "type": "spotlight",
      "title": "Immutable Soul",
      "item": "elementaristics:essence:7",
      "text": "Some souls were born under more cruel circumstances than other souls. These souls can often only persist by acquiring a stronger Astral Body, which enhances their magic resistance.$(br)However, this comes at the cost of low magic affinity.$(br)These hardly changeable souls are called Immutable Souls."
    },
    {
      "type": "spotlight",
      "title": "Balanced Soul",
      "item": "elementaristics:essence:14",
      "text": "Unlike most other rare souls, these souls suffer no disadvantages whatsoever. They might have been protected by some sort of higher entity, though this cannot be confirmed.$(br)One might consider them a jack of all trades."
    },
    {
      "type": "text",
      "title": "Extraordinary Souls",
      "text": "The $(marked)Extraordinary Souls$() are kin of higher entities. Their power is immense (compared to the power of the other souls).$(br)These powers generally come without many disadvantages."
    },
    {
      "type": "spotlight",
      "title": "Ancient Soul",
      "item": "elementaristics:essence:15",
      "text": "Ancient Souls directly descended from the Great Old Ones. Their magic power is equal the power of mana souls, except that it's provided by elder gods.$(br)Their connections to other deities are just as wide spread as their repertoire of spells."
    },
    {
      "type": "spotlight",
      "title": "Dragon Soul",
      "item": "elementaristics:essence:12",
      "text": "The lullaby of these souls was the cosmic ballad, with its symphonies of fire and water, air and earth, in the field of aether.$(br)These souls have strong connections to all primal aspects, and the multiversal dragons."
    },
    {
      "type": "text",
      "title": "Ascended Souls",
      "text": "Not all souls are directly created by the multiverse.$(br)Some are created by gods, nature, or even humans.$(br)These souls always keep a part of what they used to be; however, they are still one of the greatest mysteries to Soulogy."
    }
  ]
}