{
  "name": "The Mind",
  "icon": "elementaristics:block_silver_thread",
  "category": "soulogy",
  "advancement": "elementaristics:progress_ascension_identification",
  "pages": [
    {
      "type": "text",
      "text": "$(marked)The Mind$() is one of the more unusual places for a cultist to visit, yet it is indeed very important. $(br)It is the place where one must fight the $(marked)Silver Thread$(), an entity of the soul which sets boundaries (and sanity etc. we all know that)."
    },
    {
      "type": "text",
      "text": "In order to enter the Mind, one must first consume $(l:alchemy/entry_laudanum)Magic Laudanum$() through the flame and then sleep in a bed.$(br)Then, they will find themselves in the Mind, though it is highly recommended to be secured with some kind of occult help for what may be done here."
    },
    {
      "type": "image",
      "images": [
        "elementaristics:textures/images/ground.png",
        "elementaristics:textures/images/fly.png"
      ],
      "border": true,
      "text": "$(l)The Mind$()"
    },
    {
      "type": "text",
      "text": "The Player will find themselves between two layers, from which one is made out of $(item)Fabric of Passion$() (above) while the other one is made out of $(item)Fabric of Reason$() (below), though more Fabric of Passion might be found underneath it. $(br)Additionally, another layer of Passion can be found over the current one."
    },
    {
      "type": "image",
      "images": [
        "elementaristics:textures/images/anomaly.png",
        "elementaristics:textures/images/thread.png"
      ],
      "border": true,
      "text": "Looking around in this place, one might sooner or later find an anomaly."
    },
    {
      "type": "spotlight",
      "item": "elementaristics:block_silver_thread",
      "text": "In the center of those, a tangible fraction of the Silver Thread can be found. When activated, it will summon the actual Silver Thread, which has to be slain. Once it is slain by a player, the player can use this block to teleport back to their bed."
    },
    {
      "type": "entity",
      "entity": "elementaristics:silver_thread",
      "offset": 0.1,
      "text": "$(l)The Silver Thread$()"
    },
    {
      "type": "text",
      "text": "The Silver Thread on its own is not that strong, compared to other more powerful entities. However, it has the ability to only be damaged by two units, and that only by players. This makes the fight against it a fight of time, in which the player must try not to get hit. Shields and items that slow down enemies are recommended.$(br)As the Silver Thread will change location upon being hit, the fighting player must be cautious."
    },
    {
      "type": "text",
      "text": "In order to leave the Mind, one must activate the tangible Silver Thread again, after the Silver Thread entity has been slain."
    }
  ]
}