{
  "hexcasting.action.movesthemind:create":"Summon Creature",
  "hexcasting.action.movesthemind:destroy":"Banish Creature",

  "hexcasting.action.movesthemind:move/stopall":"Halt Creature",
  "hexcasting.action.movesthemind:move/walk":"Bid: Walking",
  "hexcasting.action.movesthemind:move/strafe":"Bid: Strafing",
  "hexcasting.action.movesthemind:move/look":"Bid: Looking",
  "hexcasting.action.movesthemind:move/jump":"Bid: Jumping",
  "hexcasting.action.movesthemind:move/sneak":"Bid: Sneaking",
  "hexcasting.action.movesthemind:move/sprint":"Bid: Sprinting",

  "hexcasting.action.movesthemind:move/use":"Bid: Use Item",
  "hexcasting.action.movesthemind:move/attack":"Bid: Attack",
  "hexcasting.action.movesthemind:move/swap_hands":"Bid: Swap Hands",
  "hexcasting.action.movesthemind:move/hotbar":"Bid: Select Toolbar",
  "hexcasting.action.movesthemind:move/drop":"Bid: Drop Item",


  "movesthemind.entry.spells" : "Carpet Player Manipulation",

  "movesthemind.page.spells.0" : "They appear like me, but their demeanor does not match. Familiarly, this--dare I say--creature, is distinctly unhuman. And yet, I can communicate with it; It's as if someone's cauterized all its inputs, save the signal to start its work. $(br2)And so that signal is what I shall give it. The following pages will refer to them as Bids.",
  "movesthemind.page.spells.move/stopall" : "An important signal, I'd argue even more so than the process of bringing about the creature. Costs a single amethyst dust.",
  "movesthemind.page.spells.create": "Bids the creature to the given location. Costs a charged amethyst.",
  "movesthemind.page.spells.destroy" :  "Banishes the creature, making it disappear until I call it back. One amethyst dust.",

  "movesthemind.page.spells.move/walk" : "Instructs the creature to walk along its facing. A 1 beckons it forth, and a -1 backward. Interestingly, a 0 causes it to stop, as if I had halted it.",
  "movesthemind.page.spells.move/strafe" :  "As previous, but along strafing. A 1, then, beckons it to the left, and a -1 to the right. Note the one amethyst dust cost.",
  "movesthemind.page.spells.move/look" : "Instructs the creature to look in a direction. The vector can be of any length.",
  "movesthemind.page.spells.move/jump" :  "Simply instructs the creature to hop. As is trending, the cost is one amethyst dust.",
  "movesthemind.page.spells.move/sneak" : "Takes a boolean and tells the creature to start or stop sneaking. One amethyst dust.",
  "movesthemind.page.spells.move/sprint" :  "As previous, but with sprinting. When stationary, produces sprinting particles. One amethyst dust.",

  "movesthemind.page.spells.move/use" : "Now, an interesting pair of instructions. Begin to use or attack with the held item at an interval, in twentieths of a second.",
  "movesthemind.page.spells.move/attack" :  "Given 0, uses it continuously, such as eating or channeling, or in the case of Attack, mining. Given -1, uses or attacks once and stops.",
  "movesthemind.page.spells.move/hotbar" : "Takes a number from 1 to 9 inclusive, and instructs to select that slot in its toolbar.",
  "movesthemind.page.spells.move/swap_hands" :  "Instructs the creature to hand its mainhand item into its offhand, and vice versa.",
  "movesthemind.page.spells.move/drop" : "Instructs the creature to drop the item or stack of items it holds in its main hand."
}