{
    "name": "The Rotor",
    "icon": "bigreactors:reinforced_turbinerotorshaft",
    "category": "bigreactors:turbine",
    "read_by_default": true,
    "sortnum": 2,
    "pages": [
        {
            "type": "patchouli:text",
            "text": "The Rotor is the most important component of your Turbine as its design will have a direct impact on the $(l:bigreactors:turbine/innerworking)energy production$(/l) of the Turbine.$(br2)A Rotor is built using four types of blocks:$(li)a single $(l:bigreactors:turbine/part-rotorbearing)Rotor Bearing$(/l)$(li)some $(l:bigreactors:turbine/part-rotorshaft)Rotor Shaft$(/l) blocks$(li)a number of $(l:bigreactors:turbine/part-rotorblade)Rotor Blades$(/l)$(li)a single $(l:bigreactors:turbine/part-casing)Housing$(/l) block."
        },
        {
            "type": "bigreactors:zcmultiblock",
            "multiblock_id" : "bigreactors:bookturbinerotor"
        },
        {
            "type": "patchouli:text",
            "text": "$(bold)Building the Rotor$()$(br2)The Rotor can be build following any of the three axis (X, Y, or Z) of the Turbine.$(br2)The first block of your Rotor mush be a $(l:bigreactors:turbine/part-rotorbearing)Rotor Bearing$(/l) placed on one face of the Turbine, usually in the middle.$(br2)Starting from the bearing, place down as many $(l:bigreactors:turbine/part-rotorshaft)Rotor Shaft$(/l) blocks as needed to reach the opposite face of the Turbine where it should meet a $(l:bigreactors:turbine/part-casing)Housing$(/l) there."
        },
        {
            "type": "patchouli:text",
            "text": "After the shaft is complete, it's time to place some $(l:bigreactors:turbine/part-rotorblade)Rotor Blades$(/l) down. They can be placed in any position that is perpendicular, and adjacent, to a $(l:bigreactors:turbine/part-rotorshaft)Rotor Shaft$(/l) or next to an already placed blade.$(br2)Your Rotor can have as many blades as you like, in any combination.$(br)However, it's important to note that the number of blades, along with their vapor capacity, has a direct relation to the Rotor speed."
        },
        {
            "type": "patchouli:text",
            "text": "$(bold)How many Blades?$()$(br2)Each Blade variant come with a maximum vapor capacity, the maximum amount of vapor they can capture and $(italic)use$() to spin the Rotor.$(br2)Hover on a Blade in your inventory to see it's capacity.$(br2)Use this value to calculate how many Blades you need to handle the vapor flow rate you've set for your Turbine (in the Controller graphical interface)."
        },
        {
            "type": "patchouli:text",
            "text": "$(bold)Inductor Coils$()$(br2)To actually generate energy, you need to place al least some $(l:bigreactors:turbine/coils)Inductor Coils$(/l) at the end of your Rotor (near the closing $(l:bigreactors:turbine/part-casing)Housing$(/l) block.$(br2)$(italic)And remember to engage them in the $(l:bigreactors:turbine/part-controller)Controller$(/l) graphical interface!$()$(br2)You can place up to three rings of coils, each ring consisting of up to eight coil blocks."
        },
        {
            "type": "patchouli:text",
            "text": "Mixing coil types is permitted and, if you do so, the Turbine will make the average of the values of their properties.$(br2)Doing so allows you to start with easily available, or cheap, coils and then replace them gradually instead of waiting to have the more rare or expensive coils on hand.$(br2)In the following page you can see the example Rotor shown previously with some $(l:bigreactors:turbine/coils)Inductor Coils$(/l) added."
        },
        {
            "type": "bigreactors:zcmultiblock",
            "multiblock_id" : "bigreactors:bookturbinerotor_coil"
        }
    ]
}