{
  "itemGroup.lordcraft.main": "Lord Craft",
  "itemGroup.lordcraft.cosmetic": "Lord Craft Cosmetic",
  "item.lordcraft.book": "Book of Knowledge",
  "item.lordcraft.book.book_text": "The Book of Knowledge is a powerful item used by the mod to allow the player to do research, activate their abilities or select legacies, it can even be used to find the uses of other items in the mod such as you are doing now.",
  "item.lordcraft.monutan_stone": "Monutan's Orb",
  "item.lordcraft.monutan_stone.book_text": "An unusual artifact with little known about it, it appears to have little use to the average Lord but perhaps in future it will serve a purpose.",
  "item.lordcraft.chalk": "Ritual Chalk",
  "item.lordcraft.chalk.book_text": "A magic chalk which can be used to draw ritual circles for use in ritual recipes. Right click with it to place a circle.",
  "item.lordcraft.inscription_tile": "Imbued Inscription Tile",
  "item.lordcraft.inscription_tile.book_text": "An item that can be used in research to skip the mirror puzzle mini-game, the amount needed depends on the difficulty of the research.",
  "item.lordcraft.void_crystal": "Void Crystal",
  "item.lordcraft.void_crystal.book_text": "Void crystals can store void pips to power various contraptions in this mod, such as the Arcane Forge or Arcane Furnace. Right Click to store a pip in the crystal, shift right click to return one back to the player. Crystals are player specific when pips are stored in them. The more pips stored in the crystal the faster it will make devices run.",
  "item.lordcraft.spell_crystal": "Spell Focus",
  "item.lordcraft.spell_crystal.book_text": "This crystal can be used to store spells. It can be equipped on certain casting devices such as staves and wands to allow the casting of the spell.",
  "item.lordcraft.mana_siphon": "Mana Siphon",
  "item.lordcraft.mana_siphon.book_text": "The Mana Siphon is an item that is used in conjunction with the void interface to increase the pool of available mana.",
  "item.lordcraft.void_eye": "Void Eye",
  "item.lordcraft.void_eye.book_text": "The Void Eye can be opened to allow the user to view their mana potential in a numerical form at any time.",
  "item.lordcraft.chalk_arcana": "Advanced Ritual Chalk",
  "item.lordcraft.chalk_arcana.book_text": "A magic chalk which can be used to draw ritual circles for use in ritual recipes. Right click with it to place a circle. This improved version does not take damage.",
  "item.lordcraft.water_staff_1_1": "Iron Capped Simple Water Staff",
  "item.lordcraft.water_staff_1_1.book_text": "Staves are used to cast spells stored in Spell Foci, casting spells requires your offhand to be free. Spell Foci that have been given spells may be loaded into it right right clicking. You can remove a spell focus by crouching and scrolling the mouse wheel. The materials used to construct the staff affect it's stats, the metal affects the melee damage with it as a weapon, the wood affects the maximum mana cost for a spell that the staff can handle. This particular staff will provide a discount for water spells cast with it.",
  "item.lordcraft.earth_staff_1_1": "Iron Capped Simple Earth Staff",
  "item.lordcraft.earth_staff_1_1.book_text": "Staves are used to cast spells stored in Spell Foci, casting spells requires your offhand to be free. Spell Foci that have been given spells may be loaded into it right right clicking. You can remove a spell focus by crouching and scrolling the mouse wheel. The materials used to construct the staff affect it's stats, the metal affects the melee damage with it as a weapon, the wood affects the maximum mana cost for a spell that the staff can handle. This particular staff will provide a discount for earth spells cast with it.",
  "item.lordcraft.fire_staff_1_1": "Iron Capped Simple Fire Staff",
  "item.lordcraft.fire_staff_1_1.book_text": "Staves are used to cast spells stored in Spell Foci, casting spells requires your offhand to be free. Spell Foci that have been given spells may be loaded into it right right clicking. You can remove a spell focus by crouching and scrolling the mouse wheel. The materials used to construct the staff affect it's stats, the metal affects the melee damage with it as a weapon, the wood affects the maximum mana cost for a spell that the staff can handle. This particular staff will provide a discount for fire spells cast with it.",
  "item.lordcraft.air_staff_1_1": "Iron Capped Simple Air Staff",
  "item.lordcraft.air_staff_1_1.book_text": "Staves are used to cast spells stored in Spell Foci, casting spells requires your offhand to be free. Spell Foci that have been given spells may be loaded into it right right clicking. You can remove a spell focus by crouching and scrolling the mouse wheel. The materials used to construct the staff affect it's stats, the metal affects the melee damage with it as a weapon, the wood affects the maximum mana cost for a spell that the staff can handle. This particular staff will provide a discount for air spells cast with it.",
  "item.lordcraft.light_staff_1_1": "Iron Capped Simple Light Staff",
  "item.lordcraft.light_staff_1_1.book_text": "Staves are used to cast spells stored in Spell Foci, casting spells requires your offhand to be free. Spell Foci that have been given spells may be loaded into it right right clicking. You can remove a spell focus by crouching and scrolling the mouse wheel. The materials used to construct the staff affect it's stats, the metal affects the melee damage with it as a weapon, the wood affects the maximum mana cost for a spell that the staff can handle. This particular staff will provide a discount for light spells cast with it.",
  "item.lordcraft.dark_staff_1_1": "Iron Capped Simple Dark Staff",
  "item.lordcraft.dark_staff_1_1.book_text": "Staves are used to cast spells stored in Spell Foci, casting spells requires your offhand to be free. Spell Foci that have been given spells may be loaded into it right right clicking. You can remove a spell focus by crouching and scrolling the mouse wheel. The materials used to construct the staff affect it's stats, the metal affects the melee damage with it as a weapon, the wood affects the maximum mana cost for a spell that the staff can handle. This particular staff will provide a discount for dark spells cast with it.",
  "item.lordcraft.wand_1_1": "Iron Capped Simple Wand",
  "item.lordcraft.wand_1_1.book_text": "Wands are used to cast spells stored in Spell Foci with the exchange of a little power compared to a staff this is a one handed casting tool. Spell Foci that have been given spells may be loaded into it right right clicking. You can remove a spell focus by crouching and scrolling the mouse wheel. The materials used to construct the staff affect it's stats, the metal affects the melee damage with it as a weapon, the wood affects the maximum mana cost for a spell that the staff can handle..",
  "item.lordcraft.wand_1_2": "Gold Capped Simple Wand",
  "item.lordcraft.wand_1_3": "Magmite Capped Simple Wand",
  "item.lordcraft.wand_2_1": "Iron Capped Complex Wand",
  "item.lordcraft.wand_3_1": "Iron Capped Ultimate Wand",
  "item.lordcraft.wand_2_2": "Gold Capped Complex Wand",
  "item.lordcraft.wand_3_2": "Gold Capped Ultimate Wand",
  "item.lordcraft.wand_2_3": "Magmite Capped Complex Wand",
  "item.lordcraft.wand_3_3": "Magmite Capped Ultimate Wand",
  "item.lordcraft.water_staff_1_2": "Gold Capped Simple Water Staff",
  "item.lordcraft.water_staff_1_3": "Magmite Capped Simple Water Staff",
  "item.lordcraft.water_staff_2_1": "Iron Capped Complex Water Staff",
  "item.lordcraft.water_staff_3_1": "Iron Capped Ultimate Water Staff",
  "item.lordcraft.water_staff_2_2": "Gold Capped Complex Water Staff",
  "item.lordcraft.water_staff_3_2": "Gold Capped Ultimate Water Staff",
  "item.lordcraft.water_staff_2_3": "Magmite Capped Complex Water Staff",
  "item.lordcraft.water_staff_3_3": "Magmite Capped Ultimate Water Staff",
  "item.lordcraft.earth_staff_1_2": "Gold Capped Simple Earth Staff",
  "item.lordcraft.earth_staff_1_3": "Magmite Capped Simple Earth Staff",
  "item.lordcraft.earth_staff_2_1": "Iron Capped Complex Earth Staff",
  "item.lordcraft.earth_staff_3_1": "Iron Capped Ultimate Earth Staff",
  "item.lordcraft.earth_staff_2_2": "Gold Capped Complex Earth Staff",
  "item.lordcraft.earth_staff_3_2": "Gold Capped Ultimate Earth Staff",
  "item.lordcraft.earth_staff_2_3": "Magmite Capped Complex Earth Staff",
  "item.lordcraft.earth_staff_3_3": "Magmite Capped Ultimate Earth Staff",
  "item.lordcraft.fire_staff_1_2": "Gold Capped Simple Fire Staff",
  "item.lordcraft.fire_staff_1_3": "Magmite Capped Simple Fire Staff",
  "item.lordcraft.fire_staff_2_1": "Iron Capped Complex Fire Staff",
  "item.lordcraft.fire_staff_3_1": "Iron Capped Ultimate Fire Staff",
  "item.lordcraft.fire_staff_2_2": "Gold Capped Complex Fire Staff",
  "item.lordcraft.fire_staff_3_2": "Gold Capped Ultimate Fire Staff",
  "item.lordcraft.fire_staff_2_3": "Magmite Capped Complex Fire Staff",
  "item.lordcraft.fire_staff_3_3": "Magmite Capped Ultimate Fire Staff",
  "item.lordcraft.air_staff_1_2": "Gold Capped Simple Air Staff",
  "item.lordcraft.air_staff_1_3": "Magmite Capped Simple Air Staff",
  "item.lordcraft.air_staff_2_1": "Iron Capped Complex Air Staff",
  "item.lordcraft.air_staff_3_1": "Iron Capped Ultimate Air Staff",
  "item.lordcraft.air_staff_2_2": "Gold Capped Complex Air Staff",
  "item.lordcraft.air_staff_3_2": "Gold Capped Ultimate Air Staff",
  "item.lordcraft.air_staff_2_3": "Magmite Capped Complex Air Staff",
  "item.lordcraft.air_staff_3_3": "Magmite Capped Ultimate Air Staff",
  "item.lordcraft.light_staff_1_2": "Gold Capped Simple Light Staff",
  "item.lordcraft.light_staff_1_3": "Magmite Capped Simple Light Staff",
  "item.lordcraft.light_staff_2_1": "Iron Capped Complex Light Staff",
  "item.lordcraft.light_staff_3_1": "Iron Capped Ultimate Light Staff",
  "item.lordcraft.light_staff_2_2": "Gold Capped Complex Light Staff",
  "item.lordcraft.light_staff_3_2": "Gold Capped Ultimate Light Staff",
  "item.lordcraft.light_staff_2_3": "Magmite Capped Complex Light Staff",
  "item.lordcraft.light_staff_3_3": "Magmite Capped Ultimate Light Staff",
  "item.lordcraft.dark_staff_1_2": "Gold Capped Simple Dark Staff",
  "item.lordcraft.dark_staff_1_3": "Magmite Capped Simple Dark Staff",
  "item.lordcraft.dark_staff_2_1": "Iron Capped Complex Dark Staff",
  "item.lordcraft.dark_staff_3_1": "Iron Capped Ultimate Dark Staff",
  "item.lordcraft.dark_staff_2_2": "Gold Capped Complex Dark Staff",
  "item.lordcraft.dark_staff_3_2": "Gold Capped Ultimate Dark Staff",
  "item.lordcraft.dark_staff_2_3": "Magmite Capped Complex Dark Staff",
  "item.lordcraft.dark_staff_3_3": "Magmite Capped Ultimate Dark Staff",
  "item.lordcraft.stone_runestone": "Simple Runestone",
  "item.lordcraft.stone_runestone.book_text": "This Runestone is a powerful casting tool that can hold three spells. Spell focuses that have been given spells may be loaded into it right right clicking. You can change which spell slot you have selected by crouching while scrolling the mouse wheel. If you hold alternate effect while doing so, it will instead un-equip the currently selected focus if it is able to.",
  "item.lordcraft.stone_runestone_advanced": "Lordic Runestone",
  "item.lordcraft.stone_runestone_advanced.book_text": "This improved Runestone is a powerful casting tool that can hold six spells. Spell Foci that have been given spells may be loaded into it right right clicking. You can change which spell slot you have selected by crouching while scrolling the mouse wheel. If you hold alternate effect while doing so, it will instead un-equip the currently selected focus if it is able to.",
  "item.lordcraft.text_scrap": "Scrap of Lordic Text",
  "item.lordcraft.text_scrap.book_text": "This scrap of text can be found in dungeon and mineshaft chests, reading it provides 5 XP Levels. In addition it will provide progress towards Legacy Research if available.",
  "item.lordcraft.mage_boots_water": "Water Infused Mage Boots",
  "item.lordcraft.mage_boots_water.book_text": "These Boots provide a mana cost discount for Water spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_legs_water": "Water Infused Mage Leggings",
  "item.lordcraft.mage_legs_water.book_text": "These Leggings provide a mana cost discount for Water spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_robe_water": "Water Infused Mage Robes",
  "item.lordcraft.mage_robe_water.book_text": "These Robes provide a mana cost discount for Water spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_hood_water": "Water Infused Mage Hood",
  "item.lordcraft.mage_hood_water.book_text": "This Hood provide a mana cost discount for Water spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_boots_earth": "Earth Infused Mage Boots",
  "item.lordcraft.mage_boots_earth.book_text": "These Boots provide a mana cost discount for Earth spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_legs_earth": "Earth Infused Mage Leggings",
  "item.lordcraft.mage_legs_earth.book_text": "These Leggings provide a mana cost discount for Earth spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_robe_earth": "Earth Infused Mage Robes",
  "item.lordcraft.mage_robe_earth.book_text": "These Robes provide a mana cost discount for Earth spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_hood_earth": "Earth Infused Mage Hood",
  "item.lordcraft.mage_hood_earth.book_text": "This Hood provide a mana cost discount for Earth spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_boots_fire": "Fire Infused Mage Boots",
  "item.lordcraft.mage_boots_fire.book_text": "These Boots provide a mana cost discount for Fire spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_legs_fire": "Fire Infused Mage Leggings",
  "item.lordcraft.mage_legs_fire.book_text": "These Leggings provide a mana cost discount for Fire spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_robe_fire": "Fire Infused Mage Robes",
  "item.lordcraft.mage_robe_fire.book_text": "These Robes provide a mana cost discount for Fire spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_hood_fire": "Fire Infused Mage Hood",
  "item.lordcraft.mage_hood_fire.book_text": "This Hood provide a mana cost discount for Fire spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_boots_air": "Air Infused Mage Boots",
  "item.lordcraft.mage_boots_air.book_text": "These Boots provide a mana cost discount for Air spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_legs_air": "Air Infused Mage Leggings",
  "item.lordcraft.mage_legs_air.book_text": "These Leggings provide a mana cost discount for Air spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_robe_air": "Air Infused Mage Robes",
  "item.lordcraft.mage_robe_air.book_text": "These Robes provide a mana cost discount for Air spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_hood_air": "Air Infused Mage Hood",
  "item.lordcraft.mage_hood_air.book_text": "This Hood provide a mana cost discount for Air spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_boots_light": "Light Infused Mage Boots",
  "item.lordcraft.mage_boots_light.book_text": "These Boots provide a mana cost discount for Light spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_legs_light": "Light Infused Mage Leggings",
  "item.lordcraft.mage_legs_light.book_text": "These Leggings provide a mana cost discount for Light spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_robe_light": "Light Infused Mage Robes",
  "item.lordcraft.mage_robe_light.book_text": "These Robes provide a mana cost discount for Light spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_hood_light": "Light Infused Mage Hood",
  "item.lordcraft.mage_hood_light.book_text": "This Hood provide a mana cost discount for Light spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_boots_dark": "Dark Infused Mage Boots",
  "item.lordcraft.mage_boots_dark.book_text": "These Boots provide a mana cost discount for Dark spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_legs_dark": "Dark Infused Mage Leggings",
  "item.lordcraft.mage_legs_dark.book_text": "These Leggings provide a mana cost discount for Dark spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_robe_dark": "Dark Infused Mage Robes",
  "item.lordcraft.mage_robe_dark.book_text": "These Robes provide a mana cost discount for Dark spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.mage_hood_dark": "Dark Infused Mage Hood",
  "item.lordcraft.mage_hood_dark.book_text": "This Hood provide a mana cost discount for Dark spells, a full set of these provides an additional discount to all spells.",
  "item.lordcraft.fabric": "Infused Fabric",
  "item.lordcraft.fabric.book_text": "Arcane Fabric is a crafting item used for making Mage Robes.",
  "item.lordcraft.magmite": "Lordic Magmite",
  "item.lordcraft.magmite.book_text": "Lordic Magmite is a crafting item used to make tools and other mechanisms.",
  "item.lordcraft.pickaxe_magmite": "Magmite Pickaxe",
  "item.lordcraft.pickaxe_magmite.book_text": "A powerful Pickaxe made from Magmite, it's capabilities are stronger than even diamond!",
  "item.lordcraft.axe_magmite": "Magmite Axe",
  "item.lordcraft.axe_magmite.book_text": "A powerful Axe made from Magmite, it's capabilities are stronger than even diamond!",
  "item.lordcraft.shovel_magmite": "Magmite Shovel",
  "item.lordcraft.shovel_magmite.book_text": "A powerful Shovel made from Magmite, it's capabilities are stronger than even diamond!",
  "item.lordcraft.sword_magmite": "Magmite Sword",
  "item.lordcraft.sword_magmite.book_text": "A powerful Sword made from Magmite, it's capabilities are stronger than even diamond!",
  "item.lordcraft.hoe_magmite": "Magmite Hoe",
  "item.lordcraft.hoe_magmite.book_text": "A powerful Hoe made from Magmite, it's capabilities are stronger than even diamond!",
  "item.lordcraft.multitool_magmite": "Magmite Multitool",
  "item.lordcraft.multitool_magmite.book_text": "A powerful Multitool made from Magmite, it's capabilities are stronger than even diamond!",
  "item.lordcraft.translocation_marker": "Translocation Marker",
  "item.lordcraft.translocation_marker.book_text": "The Translocation Marker can be used to save the coordinates and dimension of a specific block by right clicking on it. You can then right click on a Block Translocator to save the coordinates in it.",
  "item.lordcraft.arcane_bow": "Arcane Bow",
  "item.lordcraft.arcane_bow.book_text": "A powerful spell casting tool that allows easy casting of spells at long range. Will behave like a normal bow unless a focus is loaded, the spell will cast where the arrow lands and will drain mana when this occurs. A spell focus can be loaded by right clicking with it, the focus can be removed by Shift Scroll Wheeling.",
  "item.lordcraft.artifact_water_light": "Artifact of Restoration",
  "item.lordcraft.artifact_water_light.book_text": "This artifact provides the player with the regeneration effect whenever it is in your inventory and is charged. It can be right clicked to provide temporary saturation. These effects cost a void pip whenever they occur. It can be charged by pressing alternate effect and discharged by holding shift when pressing alternate effect.",
  "item.lordcraft.artifact_earth_dark": "Artifact of Destruction",
  "item.lordcraft.artifact_earth_dark.book_text": "This artifact allows you to mine blocks in a 3x3 in front of the player. It can be charged by pressing alternate effect and discharged by holding shift when pressing alternate effect. This increases the number of blocks mined but makes it cost more void pips.",
  "item.lordcraft.artifact_fire_air": "Artifact of the Defender",
  "item.lordcraft.artifact_fire_air.book_text": "This artifact allows you to perform a shield blast whenever you raise your shield when this is in your inventory. Targets surrounding the player are pushed away and targets in front take fire damage. It can be charged by pressing alternate effect and discharged by holding shift when pressing alternate effect. This increases the power of the effect but makes it cost more void pips.",
  "item.lordcraft.staff_cap_1": "Iron Staff Cap",
  "item.lordcraft.staff_cap_2": "Golden Staff Cap",
  "item.lordcraft.staff_cap_3": "Magmite Staff Cap",
  "item.lordcraft.staff_cap_1.book_text": "A staff cap is a crafting item used in the creation of staves and wands. The material of the cap affects the melee damage of the item produced.",
  "item.lordcraft.staff_cap_2.book_text": "A staff cap is a crafting item used in the creation of staves and wands. The material of the cap affects the melee damage of the item produced.",
  "item.lordcraft.staff_cap_3.book_text": "A staff cap is a crafting item used in the creation of staves and wands. The material of the cap affects the melee damage of the item produced.",
  "item.lordcraft.amplification_rod_1": "Simple Amplification Rod",
  "item.lordcraft.amplification_rod_2": "Complex Amplification Rod",
  "item.lordcraft.amplification_rod_3": "Ultimate Amplification Rod",
  "item.lordcraft.amplification_rod_1.book_text": "Amplification rods are used in the crafting of staves and wands. The material used affects the maximum power of spells that can be cast using the tool.",
  "item.lordcraft.amplification_rod_2.book_text": "Amplification rods are used in the crafting of staves and wands. The material used affects the maximum power of spells that can be cast using the tool.",
  "item.lordcraft.amplification_rod_3.book_text": "Amplification rods are used in the crafting of staves and wands. The material used affects the maximum power of spells that can be cast using the tool.",
  "block.lordcraft.arcane_workbenchb": "Arcane Workbench",
  "block.lordcraft.arcane_workbenchb.book_text": "An advanced crafting table used by the mod to perform recipes that require research. It can be infused with different elements via the ritual system to perform more complex recipes. It can also perform standard recipes and keeps it's inventory.",
  "block.lordcraft.arcane_workbench_advb": "Advanced Arcane Workbench",
  "block.lordcraft.arcane_workbench_advb.book_text": "This workbench works the same as the standard Arcane Workbench except with some additional storage slots.",
  "block.lordcraft.arcane_workbench_voidb": "Void Workbench",
  "block.lordcraft.arcane_workbench_voidb.book_text": "The Void Workbench works like the Advanced Arcane Workbench except that it does not need to be infused to perform the more complex recipes and can perform recipes that specifically require the void workbench.",
  "block.lordcraft.crystal_oreb": "Crystal Deposit",
  "block.lordcraft.crystal_oreb.book_text": "An ore block found underground, when mined will drop some Simple Dusts. Is affected by fortune and silk touch.",
  "block.lordcraft.mirror0b": "Arcane Mirror",
  "block.lordcraft.mirror0b.book_text": "A block used for the research mini-game, currently has no in world use.",
  "block.lordcraft.dual_mirror0b": "Arcane Dual Mirror",
  "block.lordcraft.dual_mirror0b.book_text": "A block used for the research mini-game, currently has no in world use.",
  "block.lordcraft.splitter0b": "Arcane Splitter",
  "block.lordcraft.splitter0b.book_text": "A block used for the research mini-game, currently has no in world use.",
  "block.lordcraft.start0b": "Laser Emission Matrix",
  "block.lordcraft.start0b.book_text": "A block used for the research mini-game, currently has no in world use.",
  "block.lordcraft.endb": "Laser Absorption Matrix",
  "block.lordcraft.endb.book_text": "A block used for the research mini-game, currently has no in world use.",
  "block.lordcraft.arcane_basinb": "Arcane Basin",
  "block.lordcraft.arcane_basinb.book_text": "This block can be used for a variety of recipes throughout Lordcraft usually mixing reagents together in water. All recipes start with a water bucket. The basin can be emptied at any time by shift right clicking with an empty hand. A basin recipe can only be added to if the basin is full.",
  "block.lordcraft.spell_crafterb": "Spell Crafter",
  "block.lordcraft.spell_crafterb.book_text": "This special block is used to create spells and store them in Spell Foci.",
  "block.lordcraft.void_interfaceb": "Void Interface",
  "block.lordcraft.void_interfaceb.book_text": "The Void Interface is a block used to access your global mana storage. You can increase your mana capacity by using Mana Siphons on it. Your mana amount can be increased by using elemental crystals on it. And the numerical value stored can be seen in the hud that displays when hovering over it.",
  "block.lordcraft.ritual_circleb": "Ritual Circle",
  "block.lordcraft.ritual_circleb.book_text": "Ritual Circles are used to perform ritual based recipes, using the appropriate reagent to set the mode of the ritual, and then adding the required items afterwards. Once all the items are on the circle and you have sufficient void pips to perform the ritual right click to begin. These are placed using Arcane Chalk.",
  "block.lordcraft.block_transmuterb": "Block Transmuter",
  "block.lordcraft.block_transmuterb.book_text": "The Block Transmuter can be used to change the appearance of certain blocks such as planks, glowstone and cobblestone. It can do so in two ways, both the colour can be set from among all of minecraft's 16 colours, but also in the case of glowstone and cobblestone you can change the block pattern.",
  "block.lordcraft.runic_lampb": "Glowing Anomaly",
  "block.lordcraft.runic_lampb.book_text": "This strange anomaly is produced by light based tools and emits a very bright light.",
  "block.lordcraft.crystal_basicb": "Block of Simple Crystal",
  "block.lordcraft.crystal_basicb.book_text": "A storage block for Crystals, used for some crafting recipes.",
  "block.lordcraft.crystal_waterb": "Block of Damp Crystal",
  "block.lordcraft.crystal_waterb.book_text": "A storage block for Crystals, used for some crafting recipes.",
  "block.lordcraft.crystal_earthb": "Block of Dense Crystal",
  "block.lordcraft.crystal_earthb.book_text": "A storage block for Crystals, used for some crafting recipes.",
  "block.lordcraft.crystal_fireb": "Block of Searing Crystal",
  "block.lordcraft.crystal_fireb.book_text": "A storage block for Crystals, used for some crafting recipes.",
  "block.lordcraft.crystal_airb": "Block of Floating Crystal",
  "block.lordcraft.crystal_airb.book_text": "A storage block for Crystals, used for some crafting recipes.",
  "block.lordcraft.crystal_lightb": "Block of Bright Crystal",
  "block.lordcraft.crystal_lightb.book_text": "A storage block for Crystals, used for some crafting recipes.",
  "block.lordcraft.crystal_darkb": "Block of Murky Crystal",
  "block.lordcraft.crystal_darkb.book_text": "A storage block for Crystals, used for some crafting recipes.",
  "block.lordcraft.crystal_pureb": "Block of Pure Crystal",
  "block.lordcraft.crystal_pureb.book_text": "A storage block for Crystals, used for some crafting recipes.",
  "block.lordcraft.furnaceb": "Arcane Furnace",
  "block.lordcraft.furnaceb.book_text": "This contraption is capable of performing furnace recipes. It is powered by a Void Crystal that has Void Pips in it, the more pips the faster it runs! It can also be upgraded with a couple of researches to allow additional output when smelting ores or cooking food.",
  "block.lordcraft.forgeb": "Arcane Forge",
  "block.lordcraft.forgeb.book_text": "The Arcane Forge can be used to perform Fusion Ritual Recipes automatically. It can do so shapelessly but has the downside that it only has 5 input slots. This downside means that it can only perform the recipes that contain 5 or less Unique Items. The more power in the Void Crystal the faster it will run.",
  "block.lordcraft.translocatorb": "Block Translocator",
  "block.lordcraft.translocatorb.book_text": "This block can be used to swap the block above it with another block at the location stored within this Tile Entity when this is powered by redstone. The location can be set using a Translocation Marker.",
  "block.lordcraft.lordic_stoneb": "Lordic Stone",
  "block.lordcraft.lordic_stoneb.book_text": "This strange stone can be made using a Changing Plate on Stone. This is used to craft Lordic Runestones.",
  "block.lordcraft.player_interfaceb": "Player Void Interface",
  "block.lordcraft.player_interfaceb.book_text": "The Player Void Interface is a block used to access your global mana storage. You can increase your mana capacity by using Mana Siphons on it. Your mana amount can be increased by using elemental crystals on it. And the numerical value stored can be seen in the hud that displays when hovering over it. This version is specific to the player who places it, if any of the above items are dropped near it, they will be absorbed and will provide the owner with the resultant effect. Only the player who places this can break it unless you are in creative. Interestingly it also has comparator support.",
  "lord.plank": "Planks",
  "lord.cobble": "Cobblestone",
  "lord.stone": "Stone",
  "lord.brick": "Bricks",
  "lord.bbrick": "Big Bricks",
  "lord.bbrick_cracked": "Cracked Big Bricks",
  "lord.bbrick_carved": "Chiseled Big Bricks",
  "lord.pris_dark": "Stone Tiles",
  "lord.pris_brick": "Prism Bricks",
  "lord.stone_panel": "Stone Panel",
  "lord.glowstone": "Glowstone",
  "lord.lantern": "Lantern",
  "lord.lamp": "Lamp",
  "lord.planks": "Planks",
  "lord.plain": "Flat Block",
  "lord.tile": "Big Tile",
  "lord.marbled": "Marbled Stone",
  "lord.mbrick": "Marbled Bricks",
  "lord.mbbrick": "Marbled Big Bricks",
  "lord.nbrick": "Rough Bricks",
  "lord.nmbrick": "Rough Marbled Bricks",
  "lord.squares": "Squares",
  "lord.magma": "Lava Lamp",
  "lord.oct": "Octal-Plate",
  "lord.bstone": "Large Cobbles",
  "lord.stair": "Stairs",
  "lord.slab": "Slab",
  "lord.colour.0": "Colourless",
  "effect.lordcraft.frostbite": "Frostbite",
  "effect.lordcraft.hypotherm": "Hypothermia",
  "effect.lordcraft.stunned": "Stunned",
  "lordcraft.basin_empty": "Shift Click to Empty",
  "lordcraft.global_mana": "Global Mana",
  "lordcraft.crystal.book_text": "An item used for various crafting recipes throughout the mod. The Elemental Versions of these can also be used on the Void Interface to provide mana to the player.",
  "lordcraft.dust.book_text": "An item used for various crafting recipes throughout the mod.",
  "lordcraft.axe.book_text": "A decently effective Axe. The elemental variants have an ability accessed by a right click.",
  "lordcraft.pickaxe.book_text": "A decently effective Pickaxe. The elemental variants have an ability accessed by a right click.",
  "lordcraft.shovel.book_text": "A decently effective Shovel. The elemental variants have an ability accessed by a right click.",
  "lordcraft.sword.book_text": "A decently effective Sword. The elemental variants have an ability accessed by a right click.",
  "lordcraft.hoe.book_text": "A decently effective Hoe. The elemental variants have an ability accessed by a right click.",
  "lordcraft.multitool.book_text": "A powerful tool capable of working well on any block. The elemental variants have an ability accessed by a right click.",
  "lordcraft.artifact.book_text": "These elemental artifacts behave as upgraded versions of their elemental tools, individual use can be read under their specific research.",
  "lordcraft.plate.book_text": "These plates can be infused with elemental dusts. This allows them to be used to produce various magical effects at the cost of Void Pips.",
  "lordcraft.crystal": "Crystal",
  "lordcraft.dust": "Dust",
  "lordcraft.pickaxe": "Pickaxe",
  "lordcraft.hoe": "Hoe",
  "lordcraft.sword": "Sword",
  "lordcraft.axe": "Axe",
  "lordcraft.shovel": "Shovel",
  "lordcraft.multitool": "Multitool",
  "lordcraft.artifact": "Artifact",
  "lordcraft.plate": "Plate",
  "lordcraft.element.0": "Water",
  "lordcraft.element.1": "Earth",
  "lordcraft.element.2": "Fire",
  "lordcraft.element.3": "Air",
  "lordcraft.element.4": "Light",
  "lordcraft.element.5": "Darkness",
  "lordcraft.element.6": "Energy",
  "lord.element.neutral": "Simple",
  "lord.element.water": "Damp",
  "lord.element.earth": "Dense",
  "lord.element.fire": "Searing",
  "lord.element.air": "Floating",
  "lord.element.light": "Bright",
  "lord.element.dark": "Murky",
  "lord.element.pure": "Pure",
  "lord.plate.neutral": "Blank",
  "lord.plate.water": "Healing",
  "lord.plate.earth": "Defence",
  "lord.plate.fire": "Combat",
  "lord.plate.air": "Agility",
  "lord.plate.light": "Purification",
  "lord.plate.dark": "Transposition",
  "lord.plate.pure": "Changing",
  "lord.tooltip.dimension": "Dimension",
  "lord.tooltip.teleport_stone": "Activate block to mark location",
  "lord.tooltip.change_stone": "Resonates near Stone",
  "lordcraft.marker.mark": "Location Marked!",
  "lordcraft.marker.save": "Location Saved to Block!",
  "lord.earth.no.blocks": "§cNo valuable blocks detected!",
  "lord.mana_gain.max": "§cAdvanced Ritual Required for more Void Pips",
  "lordcraft.attuned_element": "Attuned Element",
  "lordcraft.overlord.spirit": "Wandering Spirit",
  "lordcraft.tooltip.colour_button": "Current Colour:",
  "lordcraft.tooltip.index_button_no": "No Template",
  "lordcraft.tooltip.shifting": "Shifting Output: Enabled",
  "lordcraft.tooltip.shifting_no": "Shifting Output: Disabled",
  "lordcraft.tooltip.back": "Back",
  "lordcraft.tooltip_element": "Element",
  "lordcraft.arcane_crafting": "Arcane Workbench",
  "lordcraft.arcane_basin": "Arcane Basin",
  "lordcraft.ritual_fusion": "Fusion Rituals",
  "lordcraft.ritual_defusion": "Defusion Rituals",
  "lordcraft.legacy_selection": "Legacy Selection",
  "lordcraft.legacy_change": "Change Legacy",
  "lordcraft.element_selection0": "Select Primary Element: ",
  "lordcraft.element_selection1": "-25%% Mana Cost for this Element",
  "lordcraft.element_selection2": "Thelos required to access other elements!",
  "lordcraft.legacy.cost": "Cost to change Legacy: ",
  "lordcraft.switch_element": "Right Click to Switch Primary Element",
  "lordcraft.switch_element_cost": "Cost to Switch: ",
  "lordcraft.levels": "XP Levels",
  "lordcraft.legacy_bonus": "Legacy Bonuses:",
  "lordcraft.legacy_bonus0.0": "I: +2 Armour",
  "lordcraft.legacy_bonus0.1": "I: -10%% Mana Cost",
  "lordcraft.legacy_bonus0.2": "I: +1 Attack Damage",
  "lordcraft.legacy_bonus0.3": "I: Attacks on Animals Give Mana",
  "lordcraft.legacy_bonus1.0": "II: +2 Armour",
  "lordcraft.legacy_bonus1.1": "II: -5%% Mana Cost",
  "lordcraft.legacy_bonus1.2": "II: +1 Attack Damage",
  "lordcraft.legacy_bonus1.3": "II: Monsters Also Give Mana",
  "lordcraft.legacy_bonus2.0": "III: +2 Armour Toughness",
  "lordcraft.legacy_bonus2.1": "III: -5%% Mana Cost",
  "lordcraft.legacy_bonus2.2": "III: +1.5 Attack Speed",
  "lordcraft.legacy_bonus2.3": "III: Soul Drain Spell Available",
  "lordcraft.right_click_info": "Right Click for More Info",
  "lordcraft.book_text.next_page": "Next Page",
  "lordcraft.book_text.last_page": "Previous Page",
  "lordcraft.legacy.0": "Idoric Order",
  "lordcraft.legacy.1": "Union of Ava",
  "lordcraft.legacy.2": "Celestial Alliance",
  "lordcraft.legacy.3": "Krondas Pact",
  "lordcraft.book_text.legacy.0.title": "Idoric Order",
  "lordcraft.book_text.legacy.1.title": "Union of Ava",
  "lordcraft.book_text.legacy.2.title": "Celestial Alliance",
  "lordcraft.book_text.legacy.3.title": "Krondas Pact",
  "lordcraft.book_text.legacy.0": "The Idoric Order were a group of knights during the Second Lordic Era, they swore to protect the peoples of the continent Idoria from the perils of the Last Great Elemental war. Their efforts were not in vain as for nearly the full thousand years of war threats were repulsed and as such Idoria remains the least twisted realm within the Outlands of Daiterra. The Order has long since declined but their legacy lives on in the people of the continent and their great city of Idras who's walls still keep safe many from the threats leftover from the conflict. The remnants of the Order now stand guard at the Gates of Dara, the only valley connecting the Outlands to the world beyond.",
  "lordcraft.book_text.legacy.1": "The Union of Ava was founded early in the Second Lordic Era, this union comprised of the nations of the Natural Element attuned Lords fought against the Celestial Alliance for the future of all the realms. They stood apposed to the Monutan Restoration believing that the once ruler of all the Lords was beyond reproach for the damaged caused in earlier wars alongside his secret creation of Daiterra and it's various creatures. The union was disbanded at the Peace of Idras by the Thelos Zaloweist but there are still many Lords who follow it's tenets particularly those who seek to empower their magic.",
  "lordcraft.book_text.legacy.2": "The Celestial Alliance was formed at the end of the First Lordic Era in response to the removal of Monutan as the ruler of the Lords. Their goal was to at any cost restore him to this position despite his apparent apathy to the situation. As such they opposed the Union of Ava in the War of the Elements and thus their actions brought upon the realms nearly a thousand years of chaos. Their ranks comprised of the Celestial Nations of Light and Darkness, but in the Peace of Idras they were disbanded by the Thelos Zaloweist. Despite the peace many of them consider the war unfinished, as such for many years the Thelos spent time routing out those who still followed these ideals.",
  "lordcraft.book_text.legacy.3": "The Krondas Pact was made during the early days in the War of the Elements. A group of lords experimented into the flow of mana in life, seeking a way to attain the ability of eternal youth that the Overlords kept secret. Their studies revealed that blood assists in carrying it through the body, as such they began using their magic to drain mana from the blood of those around them. Over time the efficiency of this process was called into question and a solution had to be sought. The group cursed themselves such that they need not use magic to actively extract the mana, however this curse carried in their own blood proved to be hereditary thus Vampirism was born. This affliction is held only by a few lords these days, but the very idea that one may walk among us fills most with fear.",
  "lordcraft.book_text.researching.0.title": "Researching System",
  "lordcraft.book_text.researching.0": "Researching works by completing a mirror puzzle. Using the combination of Mirrors, Splitters and Dual Mirrors shown at the top of the page, redirect the laser from the start to all of the end points. Use the scroll wheel to rotate the mirrors (This can be used to rotate already placed mirrors also). Left click places a mirror, right click will pick up a selected one. Once the laser is in contact with all end points you may attempt completion to finish the research. Alternatively you may spend the number of Imbued Inscription Tiles shown in the bottom left to force the research to complete, effectively skipping the puzzle.",
  "lordcraft.req_res": "Required Research",
  "lordcraft.req_res_book": "Requires Research:",
  "lordcraft.lock_res_book": "Blocks Research:",
  "lordcraft.res_state.normal": "Obtainable",
  "lordcraft.res_state.requires": "Missing Research",
  "lordcraft.res_state.locked": "Locked",
  "lordcraft.res_state.complete": "Complete",
  "lordcraft.res_entry": "Click to View Entry",
  "lordcraft.res_force": "Force Completion with Inscription Tiles",
  "lordcraft.res_attempt": "Attempt Completion",
  "lordcraft.res_help": "Help",
  "lordcraft.res_tab.basics": "Lordic",
  "lordcraft.res_tab.elemental": "Elemental",
  "lordcraft.res_tab.alchemy": "Alchemy",
  "lordcraft.res_tab.ritual": "Rituals",
  "lordcraft.res_tab.arcana": "Arcana",
  "lordcraft.res_tab.void": "Void",
  "lordcraft.book_mode.research": "Research",
  "lordcraft.book_mode.ability": "Abilities",
  "lordcraft.book_mode.legacy": "Legacies",
  "lordcraft.book_mode.search": "Entry Lookup",
  "lordcraft.book_mode.hud": "Hud Config",
  "lordcraft.hud.0": "Void Pips:",
  "lordcraft.hud.1": "Mana Bar:",
  "lordcraft.hud.2": "Primal Meter:",
  "lordcraft.hud.3": "Mana Numerical Value:",
  "lordcraft.hud.4": "Spell Charge Bar:",
  "lordcraft.hud_color": "Hud Theme",
  "lordcraft.book.enabled": "Enabled",
  "lordcraft.book.disabled": "Disabled",
  "lordcraft.book.unavailable": "Unavailable",
  "lordcraft.tooltip.mana_cost": "Void Pip Cost:",
  "lordcraft.void_crystal.pips": "Void Pips Stored:",
  "lordcraft.void_crystal.owner": "Bound to your soul",
  "lordcraft.void_crystal.not_owner": "Bound to another soul",
  "lordcraft.void_crystal.use1": "§eRight Click to Store Pips",
  "lordcraft.void_crystal.use2": "§eShift-Right Click to Extract Pips",
  "lordcraft.objective.unlock": "§BNew Research Unlocked!",
  "lordcraft.casting.twohands": "§BRequires two Hands!",
  "lordcraft.key_category": "Lordcraft",
  "lordcraft.key.alternate_effect": "Alternate Effect",
  "lordcraft.open_eye": "The Eye is now Open",
  "lordcraft.command.not_allowed": "That research cannot be unlocked using this command",
  "lordcraft.casting.max_cost": "Max Mana Cost",
  "lordcraft.equip_focus": "§eRight Click to equip Focus from inventory",
  "lordcraft.remove_focus": "§eShift Scroll-Wheel to remove focus",
  "lordcraft.switch_focus": "§eShift Scroll-Wheel to switch focus slot",
  "lordcraft.remove_focus_rune": "§eShift Alternate Effect Scroll-Wheel to remove focus",
  "lordcraft.blank_focus": "This focus is empty",
  "lordcraft.casting.spell": "Spell",
  "lordcraft.casting.name": "Name",
  "lordcraft.casting.mana_cost": "Mana Cost",
  "lordcraft.casting.pip_cost": "Void Pip Cost",
  "lordcraft.spell.adv_tooltip": "§eHold Shift for Spell Details",
  "lordcraft.spell.tooltip_focus": "Focus",
  "lordcraft.spell.tooltip_type": "Spell",
  "lordcraft.spell.tooltip_element": "Discount Element",
  "lordcraft.spell.tooltip_charging": "Charging",
  "lordcraft.spell.tooltip_lobbing": "Lobbing",
  "lordcraft.spell.tooltip_3x3": "3x3",
  "lordcraft.spell.tooltip_frugal": "Frugal",
  "lordcraft.spell.tooltip_range": "Range",
  "lordcraft.spell.tooltip_angle": "Angle",
  "lordcraft.spell.tooltip_velocity": "Velocity",
  "lordcraft.spell.tooltip_modifier": "Modifier",
  "lordcraft.spell.tooltip_push": "Push",
  "lordcraft.spell.tooltip_chain": "Chaining",
  "lordcraft.spell.tooltip_craft": "Craft Spell",
  "lordcraft.spell.tooltip_load": "Load Spell from Focus",
  "lordcraft.spell.focus.projectile": "Projectile",
  "lordcraft.spell.focus.touch": "Touch",
  "lordcraft.spell.focus.trinity": "Trinity",
  "lordcraft.spell.focus.arc": "Arc",
  "lordcraft.spell.focus.scatter": "Scatter",
  "lordcraft.spell.focus.cone": "Cone",
  "lordcraft.spell.focus.self": "Self",
  "lordcraft.spell.focus.aoe": "AOE",
  "lordcraft.spell.focus.channeling": "Channeling",
  "lordcraft.spell.focus.cascade": "Cascade",
  "lordcraft.spell.pot_slider": "Potency",
  "lordcraft.spell.type.flame": "Ignite",
  "lordcraft.spell.type.heal": "Soothing Spring",
  "lordcraft.spell.type.regen": "Cleansing Flame",
  "lordcraft.spell.type.shadow": "Shadow Strike",
  "lordcraft.spell.type.dig": "Dig",
  "lordcraft.spell.type.flash": "Flash",
  "lordcraft.spell.type.freeze": "Freeze",
  "lordcraft.spell.type.lift": "Lift",
  "lordcraft.spell.type.impulse": "Impulse",
  "lordcraft.spell.type.gravity_well": "Gravity Well",
  "lordcraft.spell.type.blind": "Blind",
  "lordcraft.spell.type.blink": "Blink",
  "lordcraft.spell.type.sparks": "Spark",
  "lordcraft.spell.type.bolt": "Bolt",
  "lordcraft.spell.type.krondas": "Soul Drain",
  "lordcraft.discount_percent": "§6-5% Mana Cost for Element",
  "lordcraft.discount_full_set": "§bFull Set Bonus: -10% Mana Cost",
  "lordcraft.full_set_regen": "§bFull Set Bonus: +25% Void Pip Regen",
  "lordcraft.artifact.charge": "§eAlternate Effect to Charge",
  "lordcraft.artifact.discharge": "§eSneak + Alternate Effect to Discharge",
  "lordcraft.objective.0": "Perform Crystallization Recipes:",
  "lordcraft.objective.1": "Draw Ritual Circles:",
  "lordcraft.objective.2": "Draw a Ritual Circle:",
  "lordcraft.objective.3": "Obtain Mana using the Void Interface:",
  "lordcraft.objective.4": "Cast Spells using a Staff:",
  "lordcraft.objective.5": "Cast more powerful Spells using a Complex Staff:",
  "lordcraft.objective.6": "Hit mobs using a Staff:",
  "lordcraft.objective.7": "Hit mobs using a Gold Capped Staff:",
  "lordcraft.objective.8": "Read Scrap of Lordic Text:",
  "lordcraft.objective.9": "Read Scrap of Lordic Text:",
  "lordcraft.objective.10": "Place water using Water Tools:",
  "lordcraft.objective.11": "Scan for resources using Earth Tools:",
  "lordcraft.objective.12": "Ignite targets using Fire Tools:",
  "lordcraft.objective.13": "Resist fall damage using Air Tools:",
  "lordcraft.objective.14": "Place lights using Light Tools:",
  "lordcraft.objective.15": "Teleport using Dark Tools:",
  "lordcraft.objective.16": "Perform Void Pip Rituals:",
  "lordcraft.objective.17": "Perform The Ritual:",
  "lordcraft.objective.18": "Perform The Ritual:",
  "lordcraft.objective.19": "Perform The Ritual:",
  "lordcraft.objective.20": "Perform The Ritual:",
  "lordcraft.objective.21": "Perform The Ritual:",
  "lordcraft.objective.22": "Perform The Ritual:",
  "lordcraft.passive.aqua_affinity": "Aqua Affinity",
  "lordcraft.passive.power_fist": "Power Strikes",
  "lordcraft.passive.flame_touch": "Flaming Touch",
  "lordcraft.passive.double_jump": "Double Jump",
  "lordcraft.passive.health_boost_i": "Health Boost I",
  "lordcraft.passive.dash": "Dash",
  "lordcraft.passive.water_strike": "From the Depths",
  "lordcraft.passive.silk_touch": "Silky",
  "lordcraft.passive.auto_smelt": "Heated Mining",
  "lordcraft.passive.fall_resist": "Soft Landing",
  "lordcraft.passive.health_boost_ii": "Health Boost II",
  "lordcraft.passive.double_dash": "Double Dash",
  "lordcraft.passive.breath_regen": "Turtlekin",
  "lordcraft.passive.fortune": "Fortunate I",
  "lordcraft.passive.fire_proof": "Fire Proof",
  "lordcraft.passive.flurry": "Flurry I",
  "lordcraft.passive.mending": "Mending",
  "lordcraft.passive.increased_reach": "Reach",
  "lordcraft.passive.frost_touch": "Frozen Touch",
  "lordcraft.passive.fortune_ii": "Fortunate II",
  "lordcraft.passive.flame_retaliation": "Flaming Retaliation",
  "lordcraft.passive.flurry_ii": "Flurry II",
  "lordcraft.passive.mana_regen": "Void Soul",
  "lordcraft.passive.mining": "Mining",
  "lordcraft.book_text.ability.0": "Increases the mining speed of the player while in water.",
  "lordcraft.book_text.ability.1": "Increases melee damage done by the player.",
  "lordcraft.book_text.ability.2": "Ignites targets hit by the player.",
  "lordcraft.book_text.ability.3": "Allows the player to jump a second time while airborne.",
  "lordcraft.book_text.ability.4": "Grants additional max health to the player.",
  "lordcraft.book_text.ability.5": "Allows the player to dash in a direction by pressing the Sprint Key.",
  "lordcraft.book_text.ability.6": "Increases player damage while in water.",
  "lordcraft.book_text.ability.7": "Enables silk touch effect when mining.",
  "lordcraft.book_text.ability.8": "Automatically smelts blocks mined while active.",
  "lordcraft.book_text.ability.9": "Quarters incoming fall damage.",
  "lordcraft.book_text.ability.10": "Further increases the player's max health.",
  "lordcraft.book_text.ability.11": "Unlocks a second charge for the Dash Ability.",
  "lordcraft.book_text.ability.12": "Occasionally regenerate oxygen while underwater.",
  "lordcraft.book_text.ability.13": "Increases the fortune level while mining by 1.",
  "lordcraft.book_text.ability.14": "Grants immunity to fire based damage.",
  "lordcraft.book_text.ability.15": "Increases the player's attack speed.",
  "lordcraft.book_text.ability.16": "Causes held and equipped items to slowly repair over time.",
  "lordcraft.book_text.ability.17": "Increases the player's reach distance.",
  "lordcraft.book_text.ability.18": "Applies the frostbite effect to targets hit by the player.",
  "lordcraft.book_text.ability.19": "Increases the fortune level while mining by 1.",
  "lordcraft.book_text.ability.20": "Ignites targets who attack the player.",
  "lordcraft.book_text.ability.21": "Increases the player's attack speed.",
  "lordcraft.book_text.ability.22": "Causes mana to regen by 10 points every second.",
  "lordcraft.book_text.ability.23": "Doubles the player's mining speed.",
  "lordcraft.research.missing": "§cMissing Required Research",
  "lordcraft.insufficient.mana": "§cInsufficient Mana",
  "lordcraft.insufficient.pips": "§cInsufficient Pips",
  "lordcraft.insufficient.levels": "§cInsufficient Levels",
  "lordcraft.void_recipe": "Requires Void Workbench",
  "lordcraft.interface.owner": "Owner",
  "lordcraft.res.basics": "Basics",
  "lordcraft.res.water": "Water",
  "lordcraft.res.earth": "Earth",
  "lordcraft.res.fire": "Fire",
  "lordcraft.res.air": "Air",
  "lordcraft.res.light": "Light",
  "lordcraft.res.dark": "Darkness",
  "lordcraft.res.advanced_research": "Advanced Research",
  "lordcraft.res.arcane_chalk": "Arcane Chalk",
  "lordcraft.res.arcane_basin": "Arcane Basin",
  "lordcraft.res.crystallization": "Crystallization",
  "lordcraft.res.basin_crafting1": "Basin Crafting I",
  "lordcraft.res.void_energy": "Void Energy",
  "lordcraft.res.advanced_arcane_chalk": "Improved Chalk",
  "lordcraft.res.rituals": "Basic Rituals",
  "lordcraft.res.mana_interface": "Void Interface",
  "lordcraft.res.void_eye": "Opening the Eye",
  "lordcraft.res.spell_crafting": "Spell Crafting",
  "lordcraft.res.wands": "Wands",
  "lordcraft.res.gold_caps": "Golden Caps",
  "lordcraft.res.magmite_caps": "Magmite Caps",
  "lordcraft.res.complex_staff": "Complex Staff Core",
  "lordcraft.res.ultimate_staff": "Ultimate Staff Core",
  "lordcraft.res.runes": "Runestones",
  "lordcraft.res.advanced_runes": "Lordic Runestones",
  "lordcraft.res.legacy_i": "Legacies I",
  "lordcraft.res.legacy_ii": "Legacies II",
  "lordcraft.res.water_spell_util": "Spell Type: Soothing Spring",
  "lordcraft.res.water_spell_combat": "Spell Type: Freeze",
  "lordcraft.res.earth_spell_util": "Spell Type: Dig",
  "lordcraft.res.earth_spell_combat": "Spell Type: Gravity Well",
  "lordcraft.res.fire_spell_util": "Spell Type: Cleansing Flame",
  "lordcraft.res.fire_spell_combat": "Spell Type: Ignite",
  "lordcraft.res.air_spell_util": "Spell Type: Impulse",
  "lordcraft.res.air_spell_combat": "Spell Type: Lift",
  "lordcraft.res.light_spell_util": "Spell Type: Blind",
  "lordcraft.res.light_spell_combat": "Spell Type: Flash",
  "lordcraft.res.dark_spell_util": "Spell Type: Blink",
  "lordcraft.res.dark_spell_combat": "Spell Type: Shadow Strike",
  "lordcraft.res.focus_aoe": "Spell Focus: AOE",
  "lordcraft.res.focus_projectile": "Spell Focus: Projectile",
  "lordcraft.res.focus_trinity": "Spell Focus: Trinity",
  "lordcraft.res.focus_cone": "Spell Focus: Cone",
  "lordcraft.res.focus_arc": "Spell Focus: Arc",
  "lordcraft.res.focus_channeling": "Spell Focus: Channeling",
  "lordcraft.res.focus_scatter": "Spell Focus: Scatter",
  "lordcraft.res.focus_cascade": "Spell Focus: Cascade",
  "lordcraft.res.water_infusion": "Workbench Infusion: Water",
  "lordcraft.res.earth_infusion": "Workbench Infusion: Earth",
  "lordcraft.res.fire_infusion": "Workbench Infusion: Fire",
  "lordcraft.res.air_infusion": "Workbench Infusion: Air",
  "lordcraft.res.light_infusion": "Workbench Infusion: Light",
  "lordcraft.res.dark_infusion": "Workbench Infusion: Dark",
  "lordcraft.res.arcane_fabric": "Arcane Fabric",
  "lordcraft.res.arcane_metal": "Magmite",
  "lordcraft.res.crystal_tools": "Crystalline Tools",
  "lordcraft.res.block_transmutation": "Block Transmutation",
  "lordcraft.res.water_artifact": "Artifact of Water",
  "lordcraft.res.earth_artifact": "Artifact of Earth",
  "lordcraft.res.fire_artifact": "Artifact of Fire",
  "lordcraft.res.air_artifact": "Artifact of Air",
  "lordcraft.res.light_artifact": "Artifact of Light",
  "lordcraft.res.dark_artifact": "Artifact of Darkness",
  "lordcraft.res.mana_ritual_i": "Void Pip Ritual",
  "lordcraft.res.mana_ritual_ii": "Additional Void Pips",
  "lordcraft.res.water_passive_i": "Water Passive I",
  "lordcraft.res.water_passive_ii": "Water Passive II",
  "lordcraft.res.water_passive_iii": "Water Passive III",
  "lordcraft.res.earth_passive_i": "Earth Passive I",
  "lordcraft.res.earth_passive_ii": "Earth Passive II",
  "lordcraft.res.earth_passive_iii": "Earth Passive III",
  "lordcraft.res.fire_passive_i": "Fire Passive I",
  "lordcraft.res.fire_passive_ii": "Fire Passive II",
  "lordcraft.res.fire_passive_iii": "Fire Passive III",
  "lordcraft.res.air_passive_i": "Air Passive I",
  "lordcraft.res.air_passive_ii": "Air Passive II",
  "lordcraft.res.air_passive_iii": "Air Passive III",
  "lordcraft.res.light_passive_i": "Light Passive I",
  "lordcraft.res.light_passive_ii": "Light Passive II",
  "lordcraft.res.light_passive_iii": "Light Passive III",
  "lordcraft.res.dark_passive_i": "Dark Passive I",
  "lordcraft.res.dark_passive_ii": "Dark Passive II",
  "lordcraft.res.dark_passive_iii": "Dark Passive III",
  "lordcraft.res.arcane_furnace": "Arcane Furnace",
  "lordcraft.res.ore_processing": "Ore Processing",
  "lordcraft.res.food_cooker": "Advanced Cooking",
  "lordcraft.res.arcane_forge": "Arcane Forge",
  "lordcraft.res.water_mastery": "Mastery of Water",
  "lordcraft.res.earth_mastery": "Mastery of Earth",
  "lordcraft.res.fire_mastery": "Mastery of Fire",
  "lordcraft.res.air_mastery": "Mastery of Air",
  "lordcraft.res.light_mastery": "Mastery of Light",
  "lordcraft.res.dark_mastery": "Mastery of Dark",
  "lordcraft.res.thelos": "Thelos",
  "lordcraft.res.fast_void_crystals": "Improved Void Efficiency",
  "lordcraft.res.bolt_spell": "Spell Type: Bolt",
  "lordcraft.res.void_workbench": "Void Crafting",
  "lordcraft.res.plate_change": "Changing Matter",
  "lordcraft.res.translocation_matrix": "Translocation",
  "lordcraft.res.arcane_plates": "Arcane Plates",
  "lordcraft.res.forge_basin_i": "Basin Fusion I",
  "lordcraft.res.arcane_bow": "Arcane Archery",
  "lordcraft.res.player_interface": "Personal Mana Access",
  "lordcraft.res.multitools": "Lordic Multitools",
  "lordcraft.res.better_robes": "Robe Attunement",
  "lordcraft.book_text.research.0": "It would appear that this world does indeed contain magic. While my knowledge on the subject is limited as of this moment, I sense that through continued research of the subject I may be able to gain some powers beyond my current state. It is clear however even from crafting just this book that my workbench will need some minor adjustments. §nPerhaps I should combine my workbench with those strange dusts.",
  "lordcraft.book_text.research.1": "The magic of this world comes in many forms, I found myself drawn towards the energy flowing from the water around me but curiously once I embraced it the other elements grew quieter, perhaps if I continue my studies I shall be able to make something of this.",
  "lordcraft.book_text.research.2": "The magic of this world comes in many forms, I found myself drawn towards the energy flowing from the earth around me but curiously once I embraced it the other elements grew quieter, perhaps if I continue my studies I shall be able to make something of this.",
  "lordcraft.book_text.research.3": "The magic of this world comes in many forms, I found myself drawn towards the energy flowing from the fire around me but curiously once I embraced it the other elements grew quieter, perhaps if I continue my studies I shall be able to make something of this.",
  "lordcraft.book_text.research.4": "The magic of this world comes in many forms, I found myself drawn towards the energy flowing from the air around me but curiously once I embraced it the other elements grew quieter, perhaps if I continue my studies I shall be able to make something of this.",
  "lordcraft.book_text.research.5": "The magic of this world comes in many forms, I found myself drawn towards the energy flowing from the light around me but curiously once I embraced it the other elements grew quieter, perhaps if I continue my studies I shall be able to make something of this.",
  "lordcraft.book_text.research.6": "The magic of this world comes in many forms, I found myself drawn towards the energy flowing from the darkness around me but curiously once I embraced it the other elements grew quieter, perhaps if I continue my studies I shall be able to make something of this.",
  "lordcraft.book_text.research.7": "The process of researching has so far proven to be a rather time consuming task. However I believe that with the correct application of reagents I may be able to imbue stone tiles in such a way that will aid my studies. Hopefully these §nImbued Inscription Tiles§r will prove to be useful as my research progresses.",
  "lordcraft.book_text.research.8": "Some of the materials around me have given me an idea, if I were to combine them into some sort of §nArcane Chalk.§r With this I may be able to draw out arcane symbols that can be used for rituals.",
  "lordcraft.book_text.research.9": "It has become clear to me that my workbench while good at combining reagents in some ways it does suffer from a fatal flaw. This §nArcane Basin§r should resolve that, by allowing me to mix ingredients together in a solution of water I should be more capable of infusions.",
  "lordcraft.book_text.research.10": "Through increased experimentation with my newly devised Arcane Basin I have come up with a theory of how to turn these dusts into crystals! By dissolving the respective dust in water I can seed crystals using grains of sand allowing me to make use of the crystals in their most stable form. I wonder what else I may be able to achieve now that I have these.",
  "lordcraft.book_text.research.11": "After using my basin for extended periods of time I think I have figured out a way to perform some of these more simple recipes in my Arcane Workbench instead. Should be as simple as combining the reagents with a water bucket.",
  "lordcraft.book_text.research.objective.11": "This basin can be a bit slow, perhaps I will discover a way to speed up my crafting with it by repeating some of the recipes.",
  "lordcraft.book_text.research.12": "The energy of the world exists not only around but inside me too. I believe that with the correct focus I should be able to redirect the flow of it from that of potential energy, to that which supplements my own through means of unnatural abilities. I also believe that it might be possible to redirect and store it within so called §nVoid Crystals§r I do not yet have a use for it in this form but perhaps with further study I may be able to design a contraption that can harness the energy stored within.",
  "lordcraft.book_text.research.13": "Having used up two pieces of Arcane Chalk already, i've had an idea to use these very rituals to improve upon the chalk, infusing it with arcane energy to make it more durable.",
  "lordcraft.book_text.research.objective.13": "Arcane chalk is a little breakable, perhaps if I keep using it i'll think of a way to improve upon my formula.",
  "lordcraft.book_text.research.14": "As my hands drew with the chalk I could hear the universe speaking to me, I don't quite understand what it said but as I looked down at what I drew a perfectly formed Ritual Circle lay before me. In an instant my mind began to race with ideas, two types of rituals, one of §nfusion powered by redstone§r, and another of §ndefusion powered by gunpowder§r.",
  "lordcraft.book_text.research.objective.14": "With the chalk in hand I feel compelled to draw on the ground with it.",
  "lordcraft.book_text.research.15": "Now I have an understanding of how I can store my own energy within Void Crystals I have begun looking into ways to obtain more energy. In doing so i've realised that within the Void there is some form of store for each and every individual blessed with an understanding of magic. I have thus conceived of a device capable of interfacing with my such a store. Alongside this I have also though of a siphon like device that can be placed within the store to increase it's potential size. Now I have only to figure out how to provide it with energy, Void Pips seem incompatible, perhaps the elemental crystals?",
  "lordcraft.book_text.research.16": "It has become apparent that it is tricky at times to determine the exact amount of mana I have accumulated. I had a vision of a strange eye, it was closed and yet I felt as if it was watching me. A voice called out from the murky darkness that surrounded me, it was compelling me to open the eye. As I awoke from my stupor I realised that I might be able to summon such an eye into this world using a ritual.",
  "lordcraft.book_text.research.17": "Finally I have found a real use for my powers, combined with my intellect I can construct a §nSpell Workbench§r in which I can manipulate a §nSpell Focus§r crystal to hold a spell of my own design. On top of this I have also developed a casting tool to hold it, a staff.",
  "lordcraft.book_text.research.objective.17": "I must be able to source mana from something, perhaps I should try the elemental crystals on my Void Interface. Once I have some, it should be easy to find a use for it.",
  "lordcraft.book_text.research.18": "It can be difficult at times to manage a staff with it's unwieldy need for two hands, as such I have designed a smaller variant that can be used in just one hand. These wands are a little weaker than staves but are still adequate for most purposes.",
  "lordcraft.book_text.research.19": "Staves have proven to be reasonably effective weapons despite their weight. I believe that if I were to use gold instead of iron in crafting my staves I can produce one with an increased damage output.",
  "lordcraft.book_text.research.objective.19": "Staves are capable weapons, if I make use of them in this way I may learn of ways to improve their combat effectiveness.",
  "lordcraft.book_text.research.20": "With my recent discovery of the material known as Magmite and my ability to fabricate it using rituals, I have designed a new staff that utilises the material to further increase it's damage capability.",
  "lordcraft.book_text.research.objective.20": "Much as with upgrading to gold I wish to upgrade the staff to use Magmite in future, the only issue is that it is not as simple as it would first appear, perhaps with more testing of the golden staves I will figure out a way to properly affix Magmite to staves.",
  "lordcraft.book_text.research.21": "As my mana pool grows I wish to test out more powerful spells, my staves however were not capable of this until now. I believe that if I were to infuse the wood of my amplification rods with gold they should be capable of channeling more powerful spells.",
  "lordcraft.book_text.research.objective.21": "I am finding myself limited by how powerful my staves are, perhaps by using them to cast spells I can conceive of a way to improve their ability to channel magic.",
  "lordcraft.book_text.research.22": "Again I find myself limited, even by my improved design, this time however I have a more long term solution, by processing the wood fusing it with magmite, I will be capable of channeling spells of any complexity when used to make a staff.",
  "lordcraft.book_text.research.objective.22": "Now I have a better staff design I should test out some more powerful spells to see if I can make it any more powerful in future.",
  "lordcraft.book_text.research.23": "Ever since I opened the eye I can hear the voice of that figure in my head. I know not who they are or what they seek but they have told me many things. The knowledge they have imparted on me has lead to this latest idea, an alternative to staves with the ability to store multiple spell foci at once. I must set to work on making one at once.",
  "lordcraft.book_text.research.24": "Another thought came to me by that voice, an idea to craft a more powerful stone by utilizing the strange stone my transmutation runes create. I speculate that this version will be able to hold even more spells at once. I wish I knew if the figure could hear me, then I could properly thank him for his guidance.",
  "lordcraft.book_text.research.25": "Reading these old scraps has revealed more about the Legacies which I most closely feel for. This increased knowledge should help improve the abilities granted by following their practices. The scraps I read however were damaged, perhaps if I read more I may be able to fill any gaps still left in my knowledge.",
  "lordcraft.book_text.research.objective.25": "With my studies of Advanced Research complete I should start reading into the history of the world, I should search through mineshafts and dungeons for scraps of text and try to read them.",
  "lordcraft.book_text.research.26": "I was correct and was able to find additional scraps containing more information, I still believe there to be more but I have enough that I could piece together what I need. My abilities should improve from this, and now any further scraps I read will only provide an increase of my general knowledge.",
  "lordcraft.book_text.research.objective.26": "The previous scrap of text did not contain all the knowledge I required, I must find more to fill the gaps in my knowledge.",
  "lordcraft.book_text.research.27": "My research has revealed a spell which applies a healing effect to the target.",
  "lordcraft.book_text.research.28": "My research has revealed a spell which applies the frostbite effect to the target, causing slowness and damage over time.",
  "lordcraft.book_text.research.29": "My research has revealed a spell which allows me to dig blocks that I target.",
  "lordcraft.book_text.research.30": "My research has revealed a spell which summons a gravity well that sucks entities into it dealing damage.",
  "lordcraft.book_text.research.31": "My research has revealed a spell which applies a regeneration effect to the target.",
  "lordcraft.book_text.research.32": "My research has revealed a spell which burns and ignites the target.",
  "lordcraft.book_text.research.33": "My research has revealed a spell which pushes or pulls entities from myself.",
  "lordcraft.book_text.research.34": "My research has revealed a spell which lifts target entities into the sky.",
  "lordcraft.book_text.research.35": "My research has revealed a spell which blinds target entities.",
  "lordcraft.book_text.research.36": "My research has revealed a spell which damages targets entities and causes them to glow making them easier to spot.",
  "lordcraft.book_text.research.37": "My research has revealed a spell which allows me to teleport to the target destination.",
  "lordcraft.book_text.research.38": "My research has revealed a spell which damages target entities.",
  "lordcraft.book_text.research.39": "My research has revealed a focus which targets entities in an area around me.",
  "lordcraft.book_text.research.40": "My research has revealed a focus which launches a large number of projectiles in an Arc, using alternate effect I can change the direction.",
  "lordcraft.book_text.research.41": "My research has revealed a focus which launches a projectile that continues to cast the spell on entities that get too close to it as it flies through the air.",
  "lordcraft.book_text.research.42": "My research has revealed a focus which allows me to project a laser of energy towards my target.",
  "lordcraft.book_text.research.43": "My research has revealed a focus which targets entities with a large cone area in front of me.",
  "lordcraft.book_text.research.44": "My research has revealed a focus which launches a single projectile that casts the spell on whatever it hits.",
  "lordcraft.book_text.research.45": "My research has revealed a focus which launches a huge number of projectiles towards the direction I am looking.",
  "lordcraft.book_text.research.46": "My research has revealed a focus which launches three projectiles in front of me, the direction can be changed by holding alternate effect.",
  "lordcraft.book_text.research.47": "My workbench will require some modifications to perform some more advanced recipes. By infusing it with 4 of the Damp crystals using a ritual I can attune it to Water allowing for element specific recipes to be performed.",
  "lordcraft.book_text.research.48": "My workbench will require some modifications to perform some more advanced recipes. By infusing it with 4 of the Dense crystals using a ritual I can attune it to Earth allowing for element specific recipes to be performed.",
  "lordcraft.book_text.research.49": "My workbench will require some modifications to perform some more advanced recipes. By infusing it with 4 of the Searing crystals using a ritual I can attune it to Fire allowing for element specific recipes to be performed.",
  "lordcraft.book_text.research.50": "My workbench will require some modifications to perform some more advanced recipes. By infusing it with 4 of the Floating crystals using a ritual I can attune it to Air allowing for element specific recipes to be performed.",
  "lordcraft.book_text.research.51": "My workbench will require some modifications to perform some more advanced recipes. By infusing it with 4 of the Bright crystals using a ritual I can attune it to Light allowing for element specific recipes to be performed.",
  "lordcraft.book_text.research.52": "My workbench will require some modifications to perform some more advanced recipes. By infusing it with 4 of the Murky crystals using a ritual I can attune it to Darkness allowing for element specific recipes to be performed.",
  "lordcraft.book_text.research.53": "With my discovery of infusion rituals complete, I have been looking for ways to make use of this new process. Testing with various natural materials I have discovered that it is possible to use infusion to cause them to hold magical properties, I deem that it may be possible to make robes from fabric made in such a way. It may require me to improve my workbench in some way to do this however.",
  "lordcraft.book_text.research.54": "I've heard much about the properties of Magmite but I thought that it was a natural material found in the earth. It turns out however it is created through magic, what questions that poses for the origin of the world are rather confusing but nevertheless I shall look into further uses for this material, for now however it would make for some good tools.",
  "lordcraft.book_text.research.55": "Now that I am able to seed crystals form the magical dust I have been collecting it has given me the idea to attempt to craft tools out of them, I believe they should be fairly capable, and if I were to infuse my workbench with an element I may even be able to craft tools out of the elemental crystals too, by my reckoning they should be even more powerful and perhaps even be able to channel energy through them in some way.",
  "lordcraft.book_text.research.56": "The energy inside these crystals shifts, it's form ever changing. I believe that by harnessing this within a contraption of sorts I may be able to shift the physical appearance of a number of common building materials.",
  "lordcraft.book_text.research.57": "After extensive use with my water tools i've designed a more powerful version. In addition to the ability to place water, this artifact should be able to help me breath underwater.",
  "lordcraft.book_text.research.objective.57": "In order to develop a more advanced version of my tools, I must examine the inner workings of my current set through extensive field testing.",
  "lordcraft.book_text.research.58": "After extensive use with my earth tools i've designed a more powerful version. This artifact can scan for valuable items up to 48 blocks away making it far more useful.",
  "lordcraft.book_text.research.objective.58": "In order to develop a more advanced version of my tools, I must examine the inner workings of my current set through extensive field testing.",
  "lordcraft.book_text.research.59": "After extensive use with my fire tools i've designed a more powerful version. This in addition to letting me ignite things also provides immunity to fire damage while held.",
  "lordcraft.book_text.research.objective.59": "In order to develop a more advanced version of my tools, I must examine the inner workings of my current set through extensive field testing.",
  "lordcraft.book_text.research.60": "After extensive use with my air tools i've designed a more powerful version. In addition to protecting me from falls it also allows me to project myself forward in the direction I am facing.",
  "lordcraft.book_text.research.objective.60": "In order to develop a more advanced version of my tools, I must examine the inner workings of my current set through extensive field testing.",
  "lordcraft.book_text.research.61": "After extensive use with my light tools i've designed a more powerful version. In addition to letting me place glowing anomalies it can on an alternate effect reveal the locations of nearby entities.",
  "lordcraft.book_text.research.objective.61": "In order to develop a more advanced version of my tools, I must examine the inner workings of my current set through extensive field testing.",
  "lordcraft.book_text.research.62": "After extensive use with my earth tools i've designed a more powerful version. In addition to improving the teleportation capabilities it also provides night vision while held.",
  "lordcraft.book_text.research.objective.62": "In order to develop a more advanced version of my tools, I must examine the inner workings of my current set through extensive field testing.",
  "lordcraft.book_text.research.63": "There are many uses for Void Pips but I just simply don't have enough. I believe however it is possible to perform a ritual by using a Block of Simple Crystal as a catalyst and 5 XP Levels to gain additional Void Pips!",
  "lordcraft.book_text.research.64": "It seems I was correct my original ritual is no longer sufficient to provide me with Void Pips, however I believe that by using Pure Crystal Blocks and additional XP it should be possible to push for even more Void Pips.",
  "lordcraft.book_text.research.objective.64": "The more I perform this ritual the more it seems to be getting difficult. I am not sure if I will be able to gain Void Pips forever, but I may as well do as much as I can while I am still able.",
  "lordcraft.book_text.research.65": "My discovery of void energy has granted me access to many powerful abilities, i've noticed that they seem to align somewhat to the elements. With my research into Water I have managed to discover another ability that also leans in this direction. I wonder if there will be more.",
  "lordcraft.book_text.research.66": "My discovery of void energy has granted me access to many powerful abilities, i've noticed that they seem to align somewhat to the elements. With my research into Earth I have managed to discover another ability that also leans in this direction. I wonder if there will be more.",
  "lordcraft.book_text.research.67": "My discovery of void energy has granted me access to many powerful abilities, i've noticed that they seem to align somewhat to the elements. With my research into Fire I have managed to discover another ability that also leans in this direction. I wonder if there will be more.",
  "lordcraft.book_text.research.68": "My discovery of void energy has granted me access to many powerful abilities, i've noticed that they seem to align somewhat to the elements. With my research into Air I have managed to discover another ability that also leans in this direction. I wonder if there will be more.",
  "lordcraft.book_text.research.69": "My discovery of void energy has granted me access to many powerful abilities, i've noticed that they seem to align somewhat to the elements. With my research into Light I have managed to discover another ability that also leans in this direction. I wonder if there will be more.",
  "lordcraft.book_text.research.70": "My discovery of void energy has granted me access to many powerful abilities, i've noticed that they seem to align somewhat to the elements. With my research into Dark I have managed to discover another ability that also leans in this direction. I wonder if there will be more.",
  "lordcraft.book_text.research.71": "By empowering myself with that elemental ritual I have been able to unlock another powerful ability!",
  "lordcraft.book_text.research.objective.71": "I believe that I should be able to gain access to another passive ability by performing a ritual using only a Damp Crystal Block as a catalyst.",
  "lordcraft.book_text.research.72": "By empowering myself with that elemental ritual I have been able to unlock another powerful ability!",
  "lordcraft.book_text.research.objective.72": "I believe that I should be able to gain access to another passive ability by performing a ritual using only a Dense Crystal Block as a catalyst.",
  "lordcraft.book_text.research.73": "By empowering myself with that elemental ritual I have been able to unlock another powerful ability!",
  "lordcraft.book_text.research.objective.73": "I believe that I should be able to gain access to another passive ability by performing a ritual using only a Searing Crystal Block as a catalyst.",
  "lordcraft.book_text.research.74": "By empowering myself with that elemental ritual I have been able to unlock another powerful ability!",
  "lordcraft.book_text.research.objective.74": "I believe that I should be able to gain access to another passive ability by performing a ritual using only a Floating Crystal Block as a catalyst.",
  "lordcraft.book_text.research.75": "By empowering myself with that elemental ritual I have been able to unlock another powerful ability!",
  "lordcraft.book_text.research.objective.75": "I believe that I should be able to gain access to another passive ability by performing a ritual using only a Bright Crystal Block as a catalyst.",
  "lordcraft.book_text.research.76": "By empowering myself with that elemental ritual I have been able to unlock another powerful ability!",
  "lordcraft.book_text.research.objective.76": "I believe that I should be able to gain access to another passive ability by performing a ritual using only a Murky Crystal Block as a catalyst.",
  "lordcraft.book_text.research.77": "The Arcane Furnace is a powerful contraption and the first of many uses I expect for these new Void Crystals. It would seem that it is capable not only of smelting faster than a regular furnace but that the more energy that I give the crystal the faster it goes.",
  "lordcraft.book_text.research.78": "It has come to my attention that it is in fact possible given this improved furnace to process ores much more efficiently than I previously imagined. Now when smelting ores within the Arcane Furnace I should receive an additional ingot!",
  "lordcraft.book_text.research.79": "It has come to my attention that it is in fact possible given this improved furnace to process food much more efficiently than I previously imagined. Now when cooking food within the Arcane Furnace I should receive additional output!",
  "lordcraft.book_text.research.80": "Performing fusion recipes is a common task for me these days but it can be very tiresome, luckily i've had an idea, now that I have begun to harness the power of Void Energy using Void Crystals I have designed a Forge that should be capable of automatically performing most Fusion Ritual Recipes.",
  "lordcraft.book_text.research.81": "I have finally done it! I have learned all there is about the Element of Water, I know not where my journey will take me next but I hope that I will be able to increase my power even further. My latest discovery provides me with an additional 10% increase of efficiency when it comes to spellcasting.",
  "lordcraft.book_text.research.82": "I have finally done it! I have learned all there is about the Element of Earth, I know not where my journey will take me next but I hope that I will be able to increase my power even further. My latest discovery provides me with an additional 10% increase of efficiency when it comes to spellcasting.",
  "lordcraft.book_text.research.83": "I have finally done it! I have learned all there is about the Element of Fire, I know not where my journey will take me next but I hope that I will be able to increase my power even further. My latest discovery provides me with an additional 10% increase of efficiency when it comes to spellcasting.",
  "lordcraft.book_text.research.84": "I have finally done it! I have learned all there is about the Element of Air, I know not where my journey will take me next but I hope that I will be able to increase my power even further. My latest discovery provides me with an additional 10% increase of efficiency when it comes to spellcasting.",
  "lordcraft.book_text.research.85": "I have finally done it! I have learned all there is about the Element of Light, I know not where my journey will take me next but I hope that I will be able to increase my power even further. My latest discovery provides me with an additional 10% increase of efficiency when it comes to spellcasting.",
  "lordcraft.book_text.research.86": "I have finally done it! I have learned all there is about the Element of Darkness, I know not where my journey will take me next but I hope that I will be able to increase my power even further. My latest discovery provides me with an additional 10% increase of efficiency when it comes to spellcasting.",
  "lordcraft.book_text.research.87": "The voice in my head has spoken once again, a word drifting from so very far away passes from it's lips. This word I have been told holds within it the power to dismantle the very fabric of reality itself. I know not it's meaning or what it could possibly describe but somehow I know it is connected to myself. The word sounds almost as a name but I know not any by it. Monutan, I shall discover your meaning and this wandering spirit inside my mind shall help me.",
  "lordcraft.book_text.research.88": "Having realised my true potential I have begun to experiment how this can benefit some of my other works. In this line of thought I have stumbled upon the idea of improving my connection to the Void, doing so doubles the efficiency of machines powered by Void Crystals making them even faster!",
  "lordcraft.book_text.research.89": "My mastery over the the elements have finally payed off, i've now devised a spell that allows me to harness the innate pure energy that is comprised of them all. This spell is a more powerful version of that most basic spell I know, Sparks.",
  "lordcraft.book_text.research.90": "An annoyance I have been running into now that I have gained access to all the elements is the need to re-infuse my workbenches for these elemental recipes, however I believe that I can improve upon my workbench design and thus make that no longer necessary. It may even be able to perform some unique additional recipes if my calculations are correct.",
  "lordcraft.book_text.research.91": "The materials of this world have shown themselves able to be infused with magic to enhance their properties, some however are a little more resilient to change than others. I've seen a vision of a land far away from here, islands floating throughout the sky made of a strange stone with a blue hue, the voice tells me that is home but I do not know how to get there. Perhaps I can shift the stone of this world to be like that found in that skyland.",
  "lordcraft.book_text.research.92": "I've discovered many ways to teleport myself throughout the world, I have not however discovered how to do this to the world around me... until now. I have designed a contraption I call the Translocation Matrix, using it in conjunction with a Marker of sorts I should be able to move blocks around the world with ease.",
  "lordcraft.book_text.research.93": "I've discovered a use for this Void Energy. By dipping these stone plates into an arcane basin filled with a solution of elemental dust I can make them capable of producing magical effects when I use them.",
  "lordcraft.book_text.research.94": "After my realisation that my new found powers were capable of enhancing my connection to the void strengthening my void crystals. I was curious as to whether a similar such effect may be present when it came to my innate abilities. It would seem that indeed this is the case and as such I have discovered an entirely new passive ability!",
  "lordcraft.book_text.research.95": "After my realisation that my new found powers were capable of enhancing my connection to the void strengthening my void crystals. I was curious as to whether a similar such effect may be present when it came to my innate abilities. It would seem that indeed this is the case and as such I have discovered an entirely new passive ability!",
  "lordcraft.book_text.research.96": "After my realisation that my new found powers were capable of enhancing my connection to the void strengthening my void crystals. I was curious as to whether a similar such effect may be present when it came to my innate abilities. It would seem that indeed this is the case and as such I have discovered an entirely new passive ability!",
  "lordcraft.book_text.research.97": "After my realisation that my new found powers were capable of enhancing my connection to the void strengthening my void crystals. I was curious as to whether a similar such effect may be present when it came to my innate abilities. It would seem that indeed this is the case and as such I have discovered an entirely new passive ability!",
  "lordcraft.book_text.research.98": "After my realisation that my new found powers were capable of enhancing my connection to the void strengthening my void crystals. I was curious as to whether a similar such effect may be present when it came to my innate abilities. It would seem that indeed this is the case and as such I have discovered an entirely new passive ability!",
  "lordcraft.book_text.research.99": "After my realisation that my new found powers were capable of enhancing my connection to the void strengthening my void crystals. I was curious as to whether a similar such effect may be present when it came to my innate abilities. It would seem that indeed this is the case and as such I have discovered an entirely new passive ability!",
  "lordcraft.book_text.research.100": "Thanks to my work with the Arcane Forge it would seem that by using the fusion ritual I can emulate the conditions of the Arcane Basin. From now on some of the recipes I've been doing in the basin will now be doable using fusion rituals and by extension my forge.",
  "lordcraft.book_text.research.101": "Combining various materials alongside my knowledge of spellcasting I believe it may be possible to construct a bow that can be used to cast spells at a distance.",
  "lordcraft.book_text.research.102": "I am finding that my increased potential is coming at a cost. As I continue to learn new spells I find myself increasingly unable to provide the mana required to cast them. I believe however that I may be able to resolve this somewhat, by modifying my void interface I can make it able to absorb items dropped near it instead of me placing them into it. This means I can automate the generation of mana to some degree. I also believe that these modifications make the new interface bind itself to my mana pool when placed.",
  "lordcraft.book_text.research.103": "Forging magmite has given me an idea, with how easily I can manipulate it's shape might it not be possible to design a tool capable of being effective on any block? With this thought I set to work and now I have it! I have designed a multitool!",
  "lordcraft.book_text.research.104": "These robes are very good but so far their effectiveness is exclusive to spellcasting. I believe however that my connection to the void may indeed be stronger while wearing them, it's only a matter of feeling it for it to be so."
}