{
    "name": "Bee Attributes",
    "icon": "productivebees:gene",
    "category": "productivebees:genetics",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "Bee attributes can be transferred from one bee to another by putting the isolated gene on a honey treat and feeding it to the bee. $(br)See the page on $(l:genetics/collecting#crystalline)collecting genes$(/l)."
        },
        {
            "type": "patchouli:text",
            "title": "Productivity",
            "text": "Bees with higher level of productivity will produce more combs per trip.$(br2)Levels are:$(br)Normal$(br)Medium$(br)High$(br)Very High"
        },
        {
            "type": "patchouli:text",
            "title": "Weather Tolerance",
            "text": "Normally bees will retreat to the safety of their hive during rain and thunderstorms. Bees can become tolerant to harsh weather conditions by leaving them leashed outside during bad weather. Beware though that they have a risk of taking damage and dying until they become accustomed so keep an eye on them and honey treats on hand."
        },
        {
            "type": "patchouli:text",
            "text": "Levels are:$(br)None - can only work in clear weather$(br)Rain - can work during rain$(br)Any - can work in any weather"
        },
        {
            "type": "patchouli:text",
            "title": "Beehavior",
            "text": "Most bees only work during the day, but this can be changed. Leash a Diurnal bee to something during night and it has a chance to turn Nocturnal$(br)Leash a Nocturnal bee during day and it has a chance to turn Metaturnal$(br)Be careful though as they can take damage with leashed in an environment they are not accustomed to"
        },
        {
            "type": "patchouli:text",
            "text": "Levels are:$(br)Diurnal - works only during daytime$(br)Nocturnal - works only during nighttime$(br)Metaturnal - works all day and night"
        },
        {
            "type": "patchouli:text",
            "title": "Endurance",
            "text": "Affects the bee's max health.$(br)With a high endurance the bee has a chance to not lose its stinger when attacking.$(br)Levels are:$(br)Weak$(br)Normal$(br)Medium$(br)Strong"
        },
        {
            "type": "patchouli:text",
            "title": "Temper",
            "text": "Bees have different temper, some will attack on sight and others will avoid harmful interaction altogether. A bee that has been fed a lot of honey treats will improve it's temper.$(br)Levels are:$(br)Passive$(br)Normal$(br)Aggressive$(br)Hostile"
        },
        {
            "type": "patchouli:text",
            "title": "Effects",
            "text": "Some bees can apply effects to nearby players, both positive and negative."
        }
    ]
}