{
    "type": "manual_content",
    "lang": "zh_CN",
    "category": "factions",
    "content": [
        {
            "content_type": "heading",
            "text": "部落和民族",
            "level": 1
        },
        {
            "content_type": "heading",
            "text": "玩家团队与派系的关系",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "玩家放置的每台机器、仓库和NPC都属于该玩家，默认情况下，其他玩家无法访问。为了允许您的朋友访问您拥有的方块和NPC，您必须将他们添加到您的团队中。这可以通过使用普通的记分板命令将您自己和他们添加到同一个团队来完成。基本上，您需要的命令是 “/scoreboard teams add 【您的团队名称】”   和 “/scoreboard teams join 【您的团队名称】” 添加团队的命令只需要执行一次，然后您和任何其他人都可以使用第二个join命令来加入团队。通过在Minecraft wiki上查找记分板命令的用法，可以找到更高级的团队选项。您也可以使用FTBUtils mod中的团队功能加入团队。\n如果你想改变与某个派系的关系，你可以与该派系特定的交易者进行交易。这最终会使他们不敌视你，但他们只会对你友好。无法加入一个部落或民族，这是刻意设计的特性。世界上的派系注定是一支明确的独立力量，而不是你可以加入或接管的东西。"
        },
        {
            "content_type": "heading",
            "text": "民族",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "“文明的”派系被归类为民族，因为除了正常世界中出现的结构，他们还将生成自己的未筑墙的小城镇和有围墙的城市——此外，他们还经常使用城防工程来保卫城镇。\n诺格——颜色（玛瑙绿）\n帝国——颜色（紫色）\n猎巫军——颜色（白色）\n索尔特克——颜色（橙色）\n诺斯卡——颜色（淡蓝色）\n萨科尼德——颜色（红色）"
        },
        {
            "content_type": "heading",
            "text": "部落",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "“蛮族的”派系被归类为部落，因为它们不生成小城镇或有围墙的城市，往往只有较小的部族村落——且通常没有城防工程。\n津巴——颜色（黄色）\n金刚族——颜色（深绿色）\n巴夫罗卡——颜色（绿色）\n海盗——颜色（红褐色）\n强盗——颜色（棕色）\n兽人——颜色（深灰色）\n恶魔——颜色（猩红色）\n亡灵——颜色（淡灰色）\n怨毒（邪恶）——颜色（黑色）\n守护者（善良）——颜色（淡绿色）"
        },
        {
            "content_type": "text",
            "text": "\n\n\n "
        },
        {
            "content_type": "heading",
            "text": "诺斯卡",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（淡蓝色）\nN诺斯卡战士们意志像钉子一样坚韧不拔，居住在北方严酷的雪地里，常部署有守兵和烽火台，他们的城镇用粗壮的木头当做围墙。\n诺斯卡贵族阶级——称为领主——在领主大厅里装满了他们纵横大陆的战斗中积累的宝藏。为他们服务的狂战士在战斗中很凶猛，能够承受住足以杀死普通人五次以上的伤害。诺斯卡人活着是为了战斗，对于他们战斗是生命的目的，为在瓦哈拉奥丁身边赢得一席之地而英勇牺牲。\n在诺斯卡人的土地上, 挪威古老的神对闯入奥丁神庙、托尔神庙和弗雷亚神庙的旅行者来说是神秘而又险恶的，尽管伟大的奖赏等待着能够在奥丁神庙完成勇士考验的战士。\n诺斯卡人的符文术士拥有可怕力量的祭司——能够召唤女武神来对付入侵者。\n在诺斯卡那令人畏惧的龙头长船上可能会遇到诺斯卡劫掠者。诺斯卡的海盗舰队遍布各个海域，尤其是在河流或海岸附近——也许就在你读这本书时，他们已经在前去抢劫你简陋住所的路上了吧？\n诺斯卡人对于所有人几乎都是有敌意的，对兽人也无爱，尤其是帝国和猎巫军。\n诺斯卡商人专卖北方森林的木头、毛皮和皮革、琥珀和武器。"
        },
        {
            "content_type": "heading",
            "text": "巴夫罗卡",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（绿色）\n在世界上的平原和草原、红树林和枫树林, 可能会发现高贵的游牧民族巴夫罗卡。骄傲顽强的马背上的战士, 巴夫罗卡猎杀野牛和海狸，种植玉米和大米。巴夫罗卡的露营地由棚屋和小屋组成，严密的防御不是通过防御工事构建，而是依靠大量的战士和每个营地间的相互支援。\n巴夫罗卡酋长是勇猛而难以击杀的战士，巴夫罗卡萨满有治疗能力，可以召唤图腾灵来保卫村落。\n巴夫罗卡商人专卖皮草和皮革、牛排，并接受工具和武器作为交换。"
        },
        {
            "content_type": "heading",
            "text": "索尔特克",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（橙色）\n在干旱的平顶山可以找到索尔特克，在那里他们建起宏伟厚重的金字塔来彰显他们黑暗之神的荣耀——那是他们以血祭拜的下界恶魔。\n索尔特克人所在的高原经常会发现一些定居点，在那里复杂的灌溉系统可以让他们种植作物。他们也是熟练的矿工，索尔特克定居点经常布满开采丰富矿脉和金属的矿井和隧道。\n索尔特克是一个军事社会，有许多属于不同等级的战士——其中虎骑和鹰骑是最为娴熟勇猛的战士。索尔特克的武器是由黑曜石制成的，可以造成巨大的伤害。\n索尔特克是避世而居，很少在高贫瘠的平顶山之外遇到。\n-索尔特克死亡祭司是他们社会的真正统治者，为人们所畏惧。这些拥有最高权力的人经常能召唤来自下界的恶魔来攻击入侵者，他们的神庙里常常装满了献给他们的恶魔神的珍宝。然而，旅行者和冒险家应该小心，因为这些珍宝也受到许多守护者、诡计和陷阱的保护。\n其他部落和王国都害怕索尔特克，因为他们习惯于把旅行者献祭给他们的恶魔之神，也因此与所有势力都处于战争之中。索尔特克的商人专门出售宝石、黑曜石、彩色染料及其密集耕作生产的农产品。"
        },
        {
            "content_type": "heading",
            "text": "金刚族",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（深绿色）\n在雾气弥漫的丛林深处，疯狂的击鼓声警告着旅行者，警示他正在进入恐怖的金刚族部落。金刚族把牙齿磨尖，以便更好地吃掉被俘者，因为他们把旅行者和冒险家当作下一顿午餐，可能是加番石榴豆和一个不错的基安蒂酒。 \n金刚族人住在高大的丛林树丛中的树屋里，粗心大意的旅行者可能会被困在其下方被用作陷阱的一个被遮盖的坑里。\n虽然人们对金刚星知之甚少，但据说它们崇拜某种巨型猿类，并在满月时向它献祭少女。\n金刚是原始的战士，依靠弓箭和长矛远距离作战。 但要小心——有时他们的箭带毒。\n据说金刚族萨满能够召唤巨型猿来保护它们的祭祀场所，也许他们中最强大的力量甚至可以召唤他们可怕的神灵——金刚之王! \n金刚族商人专卖丛林木、可可和皮革的交易，并喜欢任何形式的腐肉作为回报。"
        },
        {
            "content_type": "heading",
            "text": "津巴",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（黄色）\n在广阔的热带大草原上，在大象、水牛和斑马的游牧群中，可以找到强大的津巴部落村庄。尽管津巴人以热爱和平的农业人民而闻名，但他们还是有许多技术娴熟、勇敢的战士——他们的豹战士被给遇见过他们的人以深深地恐惧。\n津巴人平民可能会在他们的村庄里见到，他们的战士巡逻对可能会在稀树草原和稀树草原高原上遇到。津巴兵动作敏捷，弓箭射击距离远，射击准确——他们提防闯入他们土地的人，可能攻击他们，也可能不攻击他们。\n津巴巫医有治疗能力，可以召唤狮子帮助他们的战士对付入侵者。\n津巴的商人专卖小麦、动物肉。往往以皮革、皮革和类似金属作为回报。"
        },
        {
            "content_type": "heading",
            "text": "帝国",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（紫色）\n帝国是永恒的，或者说帝国的领主宣称如此，而且世界各地的许多人都坚信不疑。帝国是世界上的主导势力，它的定居点、城镇、城市和城堡都牢牢地根植于于草地、平原、桦树林和果园中，为皇帝和他的宫廷的占有土地。帝国土地人口稠密，且农场、磨坊、铁匠、商人之家和教堂数目颇丰。\n帝国军 由帝国卫兵组成——帝王军团和帝国骑士中的精锐战士，他们的长矛和武装的盔甲威力被许多人认为是不可战胜的。他们由忠诚的戟兵和长弓兵以及骑马的弓箭手支援。\n帝国的城堡、前哨站和塔楼保护着他们的土地，似乎有着取之不尽的士兵。\n帝国与猎巫军派系结盟，对守护者和诺格派系保持中立。其他人，他们都在与之交战，并将之视为要征服和踩在脚下的目标。\n帝国商人有各种各样的货物和材料；然而，他们只接受其他材料或帝国硬币作为报酬。"
        },
        {
            "content_type": "heading",
            "text": "诺格",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（玛瑙绿）\n诺格定居点分布广泛，而且诺格人可能是旅行者见过的最友好的人。诺格是一个农业和采矿的民族, 有着他们引以为豪的伐木工传统。他们的定居点通常都是设防良好的小村庄或小市场。\n诺格多募集一般的战士，依靠大量的民兵、剑客和弓箭手。诺格贵族被称为诺金，是技艺高超的骑士，他们的侍从是弓箭骑手。\n诺格祭司以其开朗快乐的性情而闻名，而且他们的医疗能力相当不错。\n诺格商人通常会有各种各样的材料和货物来交换，并且经常会接受许多奇怪的东西作为回报。"
        },
        {
            "content_type": "heading",
            "text": "猎巫军",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（白色）\n帝国的宗教是神圣教会，它形成了与帝国结盟的独立派别。他们总是想消灭邪恶族、不死族和任何非人类的族群，并还试图摧毁寺庙和祭拜其他神灵的地方。从某种意义上说，猎巫军是帝国扩张活动的侵略性十字军。猎巫军的防御工事通常是城堡，由非常非常多的守军把守。\n猎巫军是帝国教会的军事力量，旨在征服和改造异端部落和民族。他们是全副武装的精锐战士，难以战胜。\n猎巫军牧师有很强的治疗能力，可以在战斗中复活倒下的同伴。那些拥有最高权力的人也可以召唤天使战士来帮助他们。\n猎巫军商人专卖书籍、羽毛和墨水袋。他们接受帝国货币和一些材料作为回报。"
        },
        {
            "content_type": "heading",
            "text": "萨科尼特",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（红色）\n在酷热的沙漠中，可能会遇到萨科尼特人的沙漠据点。这些凶猛的沙漠战士坚定地保卫着太阳灼烤着的土地。萨科尼特人可以在孤立的村庄前哨塔，城堡和有围墙的城市中找到。\n萨科尼特是一个友好的民族，试图和平地生活，但如果受到攻击，他们将有力地保卫自己。\n萨科尼德的游骑兵是技艺高超、狡猾的战士，因为他们的速度很难击败他们。\n萨科尼特祭司可以在战斗中复活阵亡的萨科尼特人，并可以召唤迪金斯来帮助他们。\n萨科尼特贸易商有非常广泛的材料和物品可供贸易，萨科尼特集市是参观和贸易的传奇之地。"
        },
        {
            "content_type": "heading",
            "text": "海盗",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（红褐色）\n当帝国开始扩张并在世界各地建立军事殖民地时，为运送殖民者而建造的舰队数量众多且强大。然而，有时船员们会反抗帝国船长严厉和压迫性的统治，海盗兄弟会由此诞生。\n海盗可能会在海上的船只上，或在海岸或岛屿海盗据点上遇到。海盗不带俘虏，只想抢劫和破坏，也许还想喝朗姆酒，在你冰冷的尸体上唱歌跳舞。\n海盗首领是臭名昭著的难以打败的战士，通常拥有从以前的受害者那里掠夺来的魔法武器和盔甲。\n最糟糕的是，海盗很久以前就发现了火药的秘密，所以他们的船只和据点都装备了大炮。\n海盗巫毒女祭司有强大的治疗能力来恢复他们的战士，有时可以召唤亡灵的海盗伙伴来帮助他们。\n海盗商人专门从他们的不义之财中变卖贵重物品，因此他们将用宝石、黄金、武器和手工艺品来交换通常很普通的物品，如木头，用来修理船只。海盗商人总是用火药交易。"
        },
        {
            "content_type": "heading",
            "text": "强盗",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（棕色）\n在所有的陆地上，都有人企图掠夺他们的同伴或冒失的旅行者，抢劫、偷窃和谋杀。这就是所谓的强盗。土匪强盗随处可见, 他们倾向于选择孤独和孤立的地方作为他们的基地，因为他们被所有其他部落和王国通缉。\n土匪可以在帐篷营地、废墟塔、洞穴、废弃村庄和古墓中找到。\n强盗不是强悍的战士，但经常大量出现。\n强盗牧师是异端者，他们不但能治愈自己的追随者，也能向敌人投掷毒瓶。\n强盗商人卖掉他们从旅行者那里抢来的东西，换取黄金，因为强盗极度贪婪，他们只想要黄金。"
        },
        {
            "content_type": "heading",
            "text": "兽人",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（深灰色）\n无论是阴郁多雾的土地，还是贫瘠荒芜的土地，还是在废弃的废墟和地下深处，都可能发现可怕的亚人类兽人种族，他们用自己所创造的病态的巢穴感染和污染土地。\n兽人被所有其他种族所鄙视，经常被邪恶或恶魔派系奴役和用作战士，他们崇拜他们的救世主巴哈罗格，据说他有朝一日会赋予他们统治全世界的权力——所有其他部落和王国都将成为他们的奴隶的时代，这是兽人的梦想。\n兽人军阀长是势不可挡的战士，用野蛮的力量、强大的打击和吸收伤害的能力来摧毁敌人，这些伤害会杀死一个人七次以上。阿鲁克凶猛而致命——通常在攻击中使用两种武器，而兽人弓箭手是狡猾的，在攻击时经常使用火箭。\n兽人憎恶所有非同族人，但对马夫和马匹有一种特别的厌恶，他们会一看到就攻击他们。\n兽人商人将用金属和石头换取动物肉或腐烂的肉。"
        },
        {
            "content_type": "heading",
            "text": "恶魔",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（猩红色）\n在现实世界之外的黑暗地带，也即广为人知的下界，黑暗势力潜伏着，等待着他们再次闯入人类世界的机会。这些物种被称为恶魔——邪恶和混乱的生物，火、烟、硫磺的造物。\n冒险家应该小心找到通往他们的下界城市的恶魔之门，或是巫师和黑暗领主，他们可以在有限的时间内召唤他们，在人类的世界里执行他们的吩咐。\n恶魔是强大的、几乎不灭的、拥有伟力的生物，不可轻视。"
        },
        {
            "content_type": "heading",
            "text": "亡灵",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（淡灰色）\n在腐朽荒芜的坟墓里。在古地窖和陵墓里。在青铜色的破碎的门密封的地下室里，以及在早已被遗忘的墓地之中，不安的死者们徘徊着留存于世间。在被遗弃的远古之地，隐藏在黑暗之中的巫妖领主和鬼王，幽灵领主和那些曾经统治着消失已久的帝国的活生生的木乃伊意识到了他们对活物的憎恨，并以他们的亡灵军队发动战争。\n亡灵族战士难以战胜，但是他们面对阳光和金银武器展现的脆弱可能会成为他们的败因。\n亡灵族没有商人，因为没有人会买他们所提供的唯一商品——死亡。"
        },
        {
            "content_type": "heading",
            "text": "怨毒",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（黑色）\n在黑暗的森林、溃烂的沼泽、阴森的废墟和深暗不见天日的地下洞穴之中，怨毒潜伏着，并策划着毁灭世界的阴谋。怨毒的生灵随处可见——邪恶法师、黑骑士、杀手小丑、邪恶从者、邪恶奴隶、邪教徒、吸血鬼领主、邪恶巫师、怨灵和怪物都在等待着不幸的冒险者。\n怨毒的生灵可在据点或废弃的城堡中、在山巅吸血鬼领主的要塞里和黑暗领主的荒原塔内找到。\n邪恶法师和邪恶领主经常召唤来自下界的恶魔。怨毒寺庙和坟冢可能宝藏丰富，淡总是出没于恐怖的地方，被守卫、怪物、陷阱和诡计团团包围。\n怨毒与所有人都处于战争状态，但经常和恶魔、兽人和亡灵派系结盟。\n怨毒商人专卖各种伤害药水、毒物和邪恶的魔法武器。但他们的商品价格高昂，且往往需要血的代价。"
        },
        {
            "content_type": "heading",
            "text": "守护者",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "旗帜颜色（淡绿色）\n为了对抗怨毒，许多善良的势力联合起来以制止他们支配世界的邪恶计划。绿林的精灵、北地的森林骑手、冒险骑士、德鲁伊和巫师将会向被怨毒威胁的疲惫不堪的旅行者伸出援手。\n从繁荣的精灵营地 ，到孤耸的荒野塔楼，再到悬崖上的巫师塔和德鲁伊的圣树环，守护者的定居点可在多处找到。\n守护者商人为冒险者储备了有用的物资和药水，并要求以食物、武器和硬币来交换。"
        }
    ]
}
