{
  "name": "Introduction to Rituals",
  "icon": "minecraft:writable_book",
  "category": "rituals",
  "sortnum": 1,
  "priority": true,
  "pages": [
    {
      "type": "text",
      "text": "Rituals are a way of unlocking the wild energy of nature and harnessing it for a specific purpose.$(br2)The primary device used in rituals is a $(l:crafting/pyres)Pyre$(), and it is upon this pyre that the five  ingredients necessary to perform the ritual are placed by right-clicking or throwing. (right click again to remove items)."
    },
    {
      "type": "text",
      "text": "Once the correct ingredients are placed on the pyre, the HUD will show information about the ritual. Lighting the pyre is the final step, and will begin the ritual.$(br2)$(info) The pyre can be started with a $(l:rituals/fire_starter)flint-and-steel or other fire starters$().$(br2)$(info) An ongoing ritual can be ended early by extinguishing. You can do this by right-clicking with a bucket of water or suitable fluid."
    },
    {
      "type": "text",
      "text": "$(info) Some rituals require $(l:rituals/standing_stones)standing stones, runed pillars$(), or $(l:rituals/catalyst_plates)catalyst plates$() to direct energy.$(br2)There are a small number of rituals that require components in addition to those mentioned, but those will be specified in the entry for the ritual itself."
    },
    {
      "type": "text",
      "title": "Ritual Tiers",
      "text": "($(o)See $(l:rituals/tiers)Ritual Tiers$())$(br2)Rituals can be classified into tiers depending on how many components they require beyond the basic pyre.$(br2)Each of these rituals will display the requirements as a multiblock image.$(br2)Thus, rituals can be classified into tiers, with tier being equivalent to the number of components required."
    },
    {
      "type": "text",
      "title": "Ritual Specifics",
      "text": "All ritual entries will list specific details. The type of details provided will vary depending on the type of ritual, but it will generally list the size and duration of the ritual, etc.$(br2)More complex rituals will also list details about how their individual functions operate and how frequently."
    },
    {
      "type": "text",
      "title": "Visualisation",
      "text": "($(o)See $(l:rituals/visualisation)Ritual Visualisation$())$(br2)If a ritual has a specific radius or cube size, it's possible to have the exact range of the ritual displayed in-world.$(br2)To do so, sneak-right-click a $(l:crafting/pyres)pyre$() that has ritual ingredients in it (or display a previously activated ritual) with a $(l:crafting/knives)knife$()."
    },
    {
      "type": "text",
      "title": "Automation",
      "text": "($(o)See $(l:rituals/automation)Ritual Automation$())$(br2)Ingredients for rituals can be stored in a chest beneath the pyre, and they will be consumed from there automatically whenever the pyre is empty.$(br2)An already-started ritual will automatically continue if new ingredients are provided. Nearby sources of flame will also be consumed to start a ritual."
    },
    {
      "type": "relations",
      "anchor": "related",
      "entries": [
        "rituals/automation",
        "rituals/tiers",
        "rituals/standing_stones",
        "rituals/visualisation",
        "crafting/pyres"
      ]
    }
  ]
}