{
  "hexcasting.action.movesthemind:create":"Summon Creature",
  "hexcasting.action.movesthemind:destroy":"Banish Creature",

  "hexcasting.action.movesthemind:move/stopall":"Halt Creature",
  "hexcasting.action.movesthemind:move/walk":"Bid: Walking",
  "hexcasting.action.movesthemind:move/strafe":"Bid: Strafing",
  "hexcasting.action.movesthemind:move/look":"Bid: Looking",
  "hexcasting.action.movesthemind:move/jump":"Bid: Jumping",
  "hexcasting.action.movesthemind:move/sneak":"Bid: Sneaking",
  "hexcasting.action.movesthemind:move/sprint":"Bid: Sprinting",

  "hexcasting.action.movesthemind:move/use":"Bid: Use Item",
  "hexcasting.action.movesthemind:move/attack":"Bid: Attack",
  "hexcasting.action.movesthemind:move/swap_hands":"Bid: Swap Hands",
  "hexcasting.action.movesthemind:move/hotbar":"Bid: Select Toolbar",
  "hexcasting.action.movesthemind:move/drop":"Bid: Drop Item",


  "movesthemind.entry.spells" : "Carpet Player Manipulation",

  "movesthemind.page.spells.0" : "They appear like me, but their demeanor does not match. Familiarly, this--dare I say--creature, is distinctly unhuman. And yet, I can communicate with it; It's as if someone's cauterized all its inputs, save the signal to start its work. $(br2)And so that signal is what I shall give it. The following pages will refer to them as Bids. Most cost a tenth of a dust.",
  "movesthemind.page.spells.move/stopall" : "An important signal! Stops actions being performed by the creature, continuous and otherwise. Conveniently, an exception to the cost rule facing this page; It's free to cast.",
  "movesthemind.page.spells.create": "Bids the creature to the given location. Costs a charged amethyst.",
  "movesthemind.page.spells.destroy" :  "Banishes the creature, making it disappear until I call it back. One Shard.",

  "movesthemind.page.spells.move/walk" : "Instructs the creature to walk along its facing. A 1 beckons it forth, and a -1 backward. Interestingly, a 0 causes it to stop, as if I had halted it.",
  "movesthemind.page.spells.move/strafe" :  "As previous, but along strafing. A 1, then, beckons it to the left, and a -1 to the right.",
  "movesthemind.page.spells.move/look" : "Instructs the creature to look in a direction. The vector can be of any length. Seems to work on myself in the eyes of Nature, even though I don't feel or see the change.",
  "movesthemind.page.spells.move/jump" :  "Simply instructs the creature to hop. Also works on myself.",
  "movesthemind.page.spells.move/sneak" : "Takes a boolean and tells the creature to start or stop sneaking. Also seems to work on myself, until my synapses kick in a moment after. Maybe it could be of use with other bids?",
  "movesthemind.page.spells.move/sprint" :  "As previous, but with sprinting. Even when stationary, the creature produces sprinting particles to denote its intention.",

  "movesthemind.page.spells.move/use" : "Now, an interesting pair of instructions. Begin to use or attack with the held item at an interval, in twentieths of a second. $(br)Both work on myself, though the former strangely.",
  "movesthemind.page.spells.move/attack" :  "Given 0, uses it continuously, such as eating or channeling, or in the case of Attack, mining. Given -1, uses or attacks once and stops.",
  "movesthemind.page.spells.move/hotbar" : "Takes a number from 1 to 9 inclusive, and instructs to select that slot in its toolbar. Works on myself, but may interrupt things like drawing patterns.",
  "movesthemind.page.spells.move/swap_hands" :  "Instructs the creature to hand its mainhand item into its offhand, and vice versa. As previous, in its function to myself.",
  "movesthemind.page.spells.move/drop" : "Instructs the creature to drop the item or stack of items it holds in its main hand. Can even yank an item from my own hand, as I'm so familiar with.",


  "advancement.movesthemind:try_banish_self" : "I Don't Want to Live on this Planet Anymore",
  "advancement.movesthemind:try_banish_self.desc" : "As a real player, try to cast Banish Creature on yourself."
}