{
  "category": "bewitchment:brewing",
  "name": "Brewing Basics",
  "icon": "bewitchment:witch_cauldron",
  "advancement": "bewitchment:hidden_unlocks/altars",
  "priority": true,
  "pages": [
	{
	  "type": "text",
	  "text": "The fine art of brewing is a core discipline of witchcraft. As its name implies, it's all about brewing potions.$(br2)To get started with brewing, you'll need a boiling $(l:bewitchment:tools/witch_cauldron)Witch Cauldron$(), some $(l:bewitchment:introduction/altars)Altar Power$(), as well as other miscellaneous ingredients.$(br2)To start a brew, first add a $(l:bewitchment:introduction/crops)Mandrake Root$() to the $(l:bewitchment:tools/witch_cauldron)Witch Cauldron$()."
	},
	{
	  "type": "text",
	  "text": "After adding the $(l:bewitchment:introduction/crops)Mandrake Root$(), you can add other ingredients. Each ingredient will increase the $(l:bewitchment:introduction/altars)Altar Power$() needed to bottle the brew by 150, and having insufficient $(l:bewitchment:introduction/altars)Altar Power$() while brewing will cause the brew to fail immediately, so keep that in mind.$(br2)Ingredients can be divided into potion ingredients and modifiers. No matter your $(l:bewitchment:introduction/altars)Altar Power$(), you can only add up to four ingredients."
	},
	{
	  "type": "text",
	  "text": "Potion ingredients add effects to your brew. You'll always want to have at least one of those. The exact effects provided by certain potion ingredients are outlined in other entries. More ingredients can be added, though that comes at the cost of space for modifiers.$(br2)Modifiers will enhance your brew: Redstone Dust increases the duration, while Glowstone Dust makes it more potent."
	},
	{
	  "type": "text",
	  "text": "You may add only one potency-enhancing modifier; however, other modifiers are technically only limited by the amount of space left, and your $(l:bewitchment:introduction/altars)Altar Power$().$(br2)Lastly, you can post-process your potions using a regular Brewing Stand. Also note that when the water is brown, it usually means you failed your brew. $(br2)$(o)Maybe you should experiment yourself to find out what works and what doesn't?$()"
	}
  ]
}
