{
  "effect.mediaworks.astral_projection": "Astral Projection",

  "item.mediaworks.magic_cloak": "Featherweave Cloak",

  "enchantment.mediaworks.reciprocation": "Reciprocation",
  "enchantment.mediaworks.reciprocation.desc": "Casts the held iota (if any) whenever the wearer is damaged.",
  "enchantment.mediaworks.media_shield": "Media Shield",
  "enchantment.mediaworks.media_shield.desc": "Absorbs raw incoming damage (before armor calculations) by up to a certain percentage, consuming an amount of media equivalent to the absorbed damage.",
  "enchantment.mediaworks.locale_magnification": "Locale Magnification",
  "enchantment.mediaworks.locale_magnification.desc": "Increases personal casting range of influence and raycast distance.",

  "advancements.mediaworks.find_cloak": "Dust and Feathers",
  "advancements.mediaworks.find_cloak.description": "Find a Featherweave Cloak among the dark remnants of an ancient age.",

  "mediaworks.subtitle.astral.ambience": "Nature whispers",
  "mediaworks.subtitle.astral.return": "Astral Projection ends",
  "mediaworks.message.projection": "Press %1$s to Return",

  "mediaworks.visage.text.unbounded": "Text Visage (Unbounded)",
  "mediaworks.visage.text.bounded": "Text Visage (%1$d, %2$d)",

  "hexcasting.spell.mediaworks:astral_projection": "Astral Projection",
  "hexcasting.spell.mediaworks:astral_pos": "Astral Locale Reflection",
  "hexcasting.spell.mediaworks:astral_look": "Astral Gaze Reflection",

  "hexcasting.spell.mediaworks:macula/add": "Etch Visage",
  "hexcasting.spell.mediaworks:macula/clear": "Macula Erasure",
  "hexcasting.spell.mediaworks:macula/dimensions": "Macula Gambit",
  "hexcasting.spell.mediaworks:visage/text/unbounded": "Calligrapher's Purification",
  "hexcasting.spell.mediaworks:visage/text/bounded": "Calligrapher's Exaltation",

  "hexcasting.spell.mediaworks:cloak/read": "Medivh's Reflection",
  "hexcasting.spell.mediaworks:get_media": "Media Reflection",
  "hexcasting.spell.mediaworks:get_entity_media": "Media Purification I",
  "hexcasting.spell.mediaworks:get_pos_media": "Media Purification II",

  "hexcasting.mishap.black_eye.visage_cap": "Your Macula could not withstand too many Visages at once",
  "hexcasting.mishap.black_eye.duration_cap": "Your Macula could not accept a Fleeting Visage for longer than a day, consider etching a Lasting Visage instead",
  "hexcasting.mishap.invalid_value.class.visage": "Visage",

  "mediaworks.entry.astral_projection": "Astral Projection",
  "mediaworks.page.astral_projection.1": "Finally, no longer am I confined to my mortal shell! The spell $(l:mediaworks:greatwork/astral_self)$(thing)projects/$ my mind outside of my body, granting multiple useful abilities for the specified number of seconds.",
  "mediaworks.page.astral_projection.2": "Seeing how inert and defenseless the body becomes without a mind actively governing it, I suppose it is a boon that this spell only targets the caster.$(p)Casting the spell costs about 2 units of $(l:items/amethyst)$(item)Amethyst Dust/$ per second of duration.$(br)If my $(l:patterns/readwrite#hexcasting:local)$(thing)ravenmind/$ holds any iota when I cast this spell, the iota is captured as an $(thing)Astral Iota/$ for the entire duration of the projection.",
  "mediaworks.page.astral_projection.3": "During such a massive paradigm shift, concentration is hard to maintain, so all the patterns I've drawn and iotas I've saved to my previous stack are lost.$(p)Lastly, it seems that I cannot extend my remaining time while already dissociated. Trying to do so leads to an $(l:casting/mishaps)$(thing)Entity is Immune/$ mishap.",

  "mediaworks.entry.astral_self": "Astral Self",
  "mediaworks.page.astral_self.1": "The state of $(l:mediaworks:patterns/great_spells/astral_projection)$(thing)Astral Projection/$ is... $(thing)TRUE BLISS/$! In it, I can $(italic)hear/$ the veil thinning, I can $(italic)see/$ the whispers of Nature, I can $(italic)smell/$ colors of _media calling out to me senses jumbled must reach must attain mu$(obf)st remark that you're quite attentive lol/$",
  "mediaworks.page.astral_self.2": "While projecting, I can fly as I please within my range of influence and phase through any blocks. However, my astral self sees the world in black and white, its sight fading as it moves further from my body, and a thick fog occludes its sight not that far away. It cannot interact with anything and cannot be interacted with.",
  "mediaworks.page.astral_self.3": "While I visualise my astral self as a translucent copy of me, other casters can only see a flying particle cloud colored with my $(l:items/pigments)$(thing)pigment/$, and other creatures ignore my astral self completely.$(p)There is still one more boon: if my $(l:mediaworks:patterns/great_spells/astral_projection)$(thing)Astral Projection/$ spell captured an $(thing)Astral Iota/$, then whenever I press $(thing)$(k:use)/$ during that projection, Nature evaluates the iota, much like when casting from a $(l:items/hexcasting)$(thing)Casting Item/$.",
  "mediaworks.page.astral_self.4": "If Astral Projection ends peacefully, Nature gently pushes my mind back into my body. This happens if:$(li)The time allotted by the corresponding $(l:mediaworks:patterns/great_spells/astral_projection)$(thing)spell/$ runs out;$(li)I press $(thing)$(k:inventory)/$.",
  "mediaworks.page.astral_self.5": "However, sometimes Astral Projection ends... not so peacefully. Nature does not take kindly to betrayal of its expectations, and throws my mind back into my body, in disarray. This happens if:$(li)My attempt to cast an Astral Iota results in a failure;$(li)My dull body is moved further than 3 blocks from the casting position;$(li)My astral self leaves my range of influence./$",
  "mediaworks.page.astral_self.6": "...I've done some more research, though. It appears that, if I act carefully, - I need to be careful I MUST, I can NOT lose myself to arrogance now, - there might be a way to $(l:patterns/great_spells/greater_sentinel)$(thing)circumvent/$ the range limitation altogether.",

  "mediaworks.entry.astral_utils": "Astral Utilities",
  "hexcasting.spell.book.mediaworks:astral_pos": "Astral Locale Rfln.",
  "mediaworks.page.astral_utils.astral_pos": "Returns the \"eye\" position vector of my astral self, similarly to how $(l:patterns/basics#hexcasting:entity_pos/eye)$(thing)Compass' Purification/$ works for my physical body. Returns $(l:casting/influences)$(thing)Null/$ if I am not projecting.",
  "hexcasting.spell.book.mediaworks:astral_look": "Astral Gaze Rfln.",
  "mediaworks.page.astral_utils.astral_look": "Returns the direction my astral self is looking in, similarly to how $(l:patterns/basics#hexcasting:get_entity_look)$(thing)Alidade's Purification/$ works for my physical body. Returns $(l:casting/influences)$(thing)Null/$ if I am not projecting.",

  "mediaworks.entry.macula": "Macula Etching",
  "mediaworks.entry.macula.desc": "$(l:patterns/basics#hexcasting:print)$(thing)Reveal/$ is a good pattern, but sometimes I find myself wishing for more flexibility. Thankfully, with just a few simple $(l:mediaworks:patterns/macula/macula_patterns)$(thing)patterns/$ I can affect my sight by directly etching $(l:mediaworks:patterns/macula/macula_concepts#mediaworks:visages)$(thing)Visages/$ onto my eye's very $(l:mediaworks:patterns/macula/macula_concepts)$(thing)Macula/$. These visages work similarly to the essential information that seems to have been etched onto my eyes by Nature itself, like health or hotbar.",

  "mediaworks.entry.macula_concepts": "Macula Concepts",
  "mediaworks.page.macula_concepts.1": "Macula is the part of my eye where visages are etched. Due to its physical nature, it is not carried between different bodies (like when respawning). It can hold $(thing)Lasting Visages/$ - shown indefinitely - and $(thing)Fleeting Visages/$. Fleeting visages fade gradually in the last second of their lifetime, unless the lifetime is 1 second or less in the first place. However, it appears that my Macula is somewhat fragile, so it cannot hold more than 32 visages at a time, and neither can it accept $(thing)Fleeting Visages/$ that stay for longer than 1 full day.",
  "mediaworks.page.macula_concepts.2": "Visage is a generic word referring to any element visible on my macula. In order to etch one, I need to prepare one first, e.g. with $(l:mediaworks:patterns/macula/text_visages#mediaworks:visage/text/unbounded)$(thing)Calligrapher's Purification/$. Such operations result in $(thing)Visage Iotas/$: they hold information needed to reproduce their specific visages anywhere on the Macula. I can then store these iotas, or $(l:mediaworks:patterns/macula/macula_patterns#mediaworks:macula/add)$(thing)etch/$ them.",
  "mediaworks.page.macula_concepts.2.title": "Visages",
  "mediaworks.page.macula_concepts.3": "Visages are positioned in a somewhat special 3-dimensional space, which I have very creatively dubbed the $(thing)Macula Space/$. It is akin to a box with its front (the Z-axis) facing towards me, though with a few caveats:$(li)The top left corner of my sight corresponds to coordinates X = 0, Y = 0, the $(thing)Macula Origin/$ of sorts.$(li)Macula width and height change along with my $(t:Game window's scaled dimensions, e.g. 480x270 in the 1920x1080 resolution)$(thing)outlook/$.$(li)There is no perspective, so the Z coordinate, $(thing)depth/$, only determines which visage comes out on top in case of overlap.",
  "mediaworks.page.macula_concepts.3.title": "Macula Space",
  "mediaworks.page.macula_concepts.4": "Though etching things onto my own eyes phases me curiously little, I should probably still be careful that nothing goes wrong, lest I incur the $(l:mediaworks:patterns/macula/black_eye)$(thing)Black Eye/$ mishap.",
  "mediaworks.page.macula_concepts.4.title": "Word of Caution",

  "mediaworks.entry.macula_patterns": "Macula Patterns",
  "mediaworks.page.macula_patterns.macula_add": "Puts the visage at the specified point in the $(l:mediaworks:patterns/macula/macula_concepts#mediaworks:macula_space)$(thing)Macula Space/$. If the display duration (the third argument) is supplied, the visage is $(l:mediaworks:patterns/macula/macula_concepts)$(thing)Fleeting/$, otherwise - $(l:mediaworks:patterns/macula/macula_concepts)$(thing)Lasting/$. Costs a negligible amount of _media.",
  "mediaworks.page.macula_patterns.macula_clear": "Clears my Macula quickly and painlessly. Definitely beats suffering a $(l:mediaworks:patterns/macula/black_eye)$(thing)Black Eye/$ or dying. Costs a negligible amount of _media.",
  "mediaworks.page.macula_patterns.macula_dimensions": "Returns my current $(l:mediaworks:patterns/macula/macula_concepts#mediaworks:macula_space)$(thing)Macula width and height/$. An absolute must for any sufficiently complex Macula calculations.",

  "mediaworks.entry.black_eye": "Black Eye Mishap",
  "mediaworks.page.black_eye.1": "Occurs when I have tried to put more than 32 visages onto my Macula, or to create a $(l:mediaworks:patterns/macula/macula_concepts)$(thing)Fleeting Visage/$ for longer than 1 day.$(p)Causes black sparks and damages my Macula, clearing it and blinding me for a couple of seconds.$(p)$(italic)Good thing the blindness is temporary...",

  "mediaworks.entry.text_visages": "Text Visages",
  "mediaworks.page.text_visages.1": "A type of visages that can show any text, with a constant line height of $(thing)9/$. Their ability to capture iotas' $(italic)current/$ texts makes them a more flexible equivalent of $(l:patterns/basics#hexcasting:print)$(thing)Reveal/$.$(p)Text visages can be $(thing)unbounded/$ or $(thing)bounded/$. The former can stretch infinitely, and the latter wrap lines that exceed the max width, displaying only the lines that fully fit within the max height.",
  "hexcasting.spell.book.mediaworks:visage/text/unbounded": "Calligrapher's Prfn.",
  "mediaworks.page.text_visages.create_unbounded": "Extracts current display text from any iota and creates an unbounded text visage iota.",
  "hexcasting.spell.book.mediaworks:visage/text/bounded": "Calligrapher's Exlt.",
  "mediaworks.page.text_visages.create_bounded": "Extracts current display text from any iota and creates a bounded text visage iota, with the first number specifying max width and second - max height.",

  "mediaworks.entry.mediaworks_moreiotas": "Mediaworks-MoreIotas",
  "mediaworks.page.mediaworks_moreiotas.1": "It appears that $(thing)Strings/$ have some special properties when used with $(l:mediaworks:patterns/macula/text_visages)$(thing)Text Visages/$. Specifically, the Calligrapher's patterns extract the underlying strings rather than their colored, quoted displays, and let me take advantage of the old ways of $(l:https://minecraft.fandom.com/wiki/Formatting_codes)formatting/$.",
  "mediaworks.page.mediaworks_moreiotas.2": "To format text, I need only type the \"codes\" with the $(thing)&/$ symbol instead of the paragraph symbol, since I cannot normally type the latter. Any instances of $(thing)&/$ that are not part of a formatting code are left as-is.",

  "mediaworks.entry.mediaworks_tweaks": "Mediaworking Changes",
  "mediaworks.page.mediaworks_tweaks.1": "The _media flow in the world feels somewhat different lately. It has become more... perhaps, the word I am looking for is \"workable\"?$(p)I have unearthed legends about casters pulling _media from items inside $(thing)Shulker Boxes/$, though only after all other available _media sources are exhausted. Application rules seem to be the same as for _media from $(l:items/phials)$(thing)Media Phials/$.",
  "mediaworks.page.mediaworks_tweaks.2": "When choosing an inventory slot to pull _media from, it no longer matters how much _media there is in the slot's item stack. This means that multiple successive casts will now prioritize fully exhausting inventory item stacks instead of \"load-balancing\", and thus will free up my pockets more quickly.",
  "mediaworks.page.mediaworks_tweaks.3": "A $(l:items/lens)$(thing)Scrying Lens/$ worn in my helmet slot or face slot now also condenses the casting grid, much like when held in the other hand. However, having multiple lenses on my person is redundant, because 2 or even 3 of them have the same effect as just 1.",

  "mediaworks.entry.mediaworks_containers": "Mediaworks Containers",
  "mediaworks.page.mediaworks_containers.1": "In a $(italic)modified/$ world, there can be all kinds of containers besides $(thing)Shulker Boxes/$. Some of them can even act as _media $(l:mediaworks:basics/mediaworks_tweaks)$(thing)sources/$ in much the same way! I will be cataloguing such special containers here.",

  "mediaworks.page.magic_cloak.1": "Many scripts hint at cities deep underground where masters of magic wore feathered cloaks. The cloaks were bestowed upon them by a powerful mage who figured out how to embed ideas into the threads of dark fabric. With this fabric did he create the first cloak of this kind.$(p)If I ever manage to obtain one, I will document further discoveries about it here.",
  "mediaworks.page.magic_cloak.2": "The cloaks exist after all! After god knows how many centuries in the $(thing)Deep Dark/$, the weave feels oddly pristine to the touch, and the threads can hold iotas in a way that I have so far failed to replicate.",
  "mediaworks.page.magic_cloak.3": "I can write iotas to and read them from a $(thing)Featherweave Cloak/$ much like with a $(l:items/focus)$(thing)Focus/$. It doesn't seem like waxing it would work, though.$(p)Conveniently, I can also $(l:mediaworks:patterns/cloak_patterns#mediaworks:cloak/read)$(thing)read/$ from a cloak without taking it off, and cut quite the dashing figure while doing so.",
  "mediaworks.page.magic_cloak.4": "Speaking of dashing figures, I can dye the cloak almost any color imaginable! The fabric absorbs dyes much like the mundane leather gear, yet infinitely more befitting of a true mage such as myself.$(p)Should I ever need to get rid of the applied dyes, a good ol' cauldron wash will do.",
  "mediaworks.page.magic_cloak.5": "However, this is not the full extent of their potential, $(italic)far/$ from it. I have been finding some peculiar $(thing)Enchanted Books/$ unique to the dark and damp ancient cities, so perhaps the way to greater power lies through the secrets of enchanting.$(p)On the following pages I have compiled a list of enchantments applicable to featherweave cloaks.",
  "mediaworks.page.magic_cloak.reciprocation.1": "Whenever I take damage, this enchantment forces the cloak to retaliate by automatically evaluating its stored iota. An empty cloak will not do anything, and a cloak with a non-evaluatable iota will cause the usual mishap.",
  "mediaworks.page.magic_cloak.reciprocation.2": "This also triggers when overcasting from health, thereby causing a self-perpetuating loop that can easily consume my mind in the blink of an eye.$(p)However, if it cannot kill me for some reason, it should fizzle out after about 50 repetitions.",
  "mediaworks.page.magic_cloak.media_shield.1": "Adds an external layer of defense that absorbs a percentage of incoming blockable damage, 10% per level at most. This triggers before any armor calculations, and every absorbed damage point costs as much media as a single health point gives when overcasting. the media is spent in the same way as when casting with a staff.",
  "mediaworks.page.magic_cloak.media_shield.2": "If there is not enough media to cover the full effect and no way for Nature to force it out of me, the enchantment will only absorb as much damage as the available media allows. Otherwise, the media is spent in the same way as when casting with a staff.",
  "mediaworks.page.magic_cloak.locale_magnification": "The rarest of them all! An enchantment that unconditionally extends my standard range of influence by 8, 16, or 32 blocks, depending on the level. This extension even applies to my raycast distance, like when using $(l:patterns/basics#hexcasting:raycast)$(thing)Archer's Distillation/$!",
  "mediaworks.page.magic_cloak.other_enchants": "A featherweave cloak is wearable and damageable. It stands to reason, then, that it accepts any enchantments available to other such items (e.g. the $(thing)Elytra/$).",
  "mediaworks.page.magic_cloak.other_enchants.title": "Other Enchantments",
  "mediaworks.page.magic_cloak.post": "$(italic)More scrawls on ancient paper... \"He betrayed us, these cloths given to our leaders were nothing but a way to disarm us. The Skulk will follow soon after. I am leaving before it's too late. Beware these dark fabrics...\"$(p)I should stay away from this place and its heirlooms. These linens are cursed and no allure of power would ever change that fact.$(p)But how bad could it really be?/$",

  "mediaworks.entry.media_patterns": "Mediaworks",
  "mediaworks.page.media_patterns.get_media": "Returns the amount of _media currently available to the hex without overcasting, in units of $(l:items/amethyst)$(item)Amethyst Dust/$.",
  "mediaworks.page.media_patterns.get_entity_media.1": "Returns the amount of _media in a dropped item entity, or in an entity's inventory if it is a player, in units of $(l:items/amethyst)$(item)Amethyst Dust/$. Returns 0 if not applicable.",
  "mediaworks.page.media_patterns.get_entity_media.2": "Curiously, the _media in $(l:items/hexcasting)$(thing)Casting Items/$ seems to be obscured: they do not contribute to a player's evaluated _media total. However, this obscurity does not hold under closer scrutiny: when evaluating a dropped casting item directly, the pattern does report its contained _media.",
  "mediaworks.page.media_patterns.get_pos_media.1": "Returns the total amount of _media in the container at the position, in units of $(l:items/amethyst)$(item)Amethyst Dust/$. Returns 0 if not applicable. Works for a certain $(l:greatwork/impetus)$(thing)special container/$ as well.",
  "mediaworks.page.media_patterns.get_pos_media.2": "Stored $(l:items/hexcasting)$(thing)Casting Items/$ do not contribute to the calculated _media total.",

  "mediaworks.entry.cloak_patterns": "Cloakworks",
  "mediaworks.page.cloak_patterns.cloak_read.1": "Old tales depict a figure of power unmatched, yet tender to all creatures under the sun. Among his many great feats, he was the first to spin the $(l:mediaworks:items/magic_cloak)$(thing)Featherweave Cloak/$ fabric out of feathers and dust.",
  "mediaworks.page.cloak_patterns.cloak_read.2": "This pattern can extract the iota held in a worn featherweave cloak, without the need to take it off and resort to $(l:patterns/readwrite)$(thing)traditional methods/$."
}