{
  "name": "Imbuer",
  "icon": "roots:imbuer",
  "category": "crafting_devices",
  "read_by_default": true,
  "pages": [
    {
      "type": "crafting",
      "recipe": "roots:imbuer",
      "text": "$(info) Please see the $(l:spells/introduction#imbuing)spells introduction section on imbuing$() for information on spells.$(br2)Specific use instructions along with all other uses of the imbuer will be outlined and discussed in the following pages.$(br2)"
    },
    {
      "type": "text",
      "title": "Additional Features",
      "text": "$(warning) Many of these features can be disabled via configuration. If something doesn't work, it may have been disabled in your modpack.$(br2)In addition to imbuing into the spell library, the imbuer allows you to perform the following actions:$(li)repair items for no XP cost using their repair ingredients$(li)using $(l:resources/runic_dust)runic dust$() to strip all enchants from an enchanted item."
    },
    {
      "type": "text",
      "title": "Item Repair",
      "text": "Damaged items can be inserted into the imbuer, followed by their repair material. The amount repaired is slightly less than that of an anvil.$(br2)$(warning) The damaged item must be inserted first and only damaged items can be inserted.$(br2)Only a single repair item can be inserted at a time, but there is no experience cost nor cumulative penalty."
    },
    {
      "type": "text",
      "title": "Item Disenchantment",
      "text": "It's possible to strip out the enchantments of an item, as well as potentially reducing the repair cost of the item by up to a third. Simply place the enchanted item in the imbuer, followed by $(l:resources/runic_dust)runic dust$().$(br2)$(warning) The enchanted item must be inserted first.$(br2)It's only possible to reduce the repair cost by removing enchantments."
    },
    {
      "type": "relations",
      "anchor": "related",
      "entries": [
        "crafting/imposer",
        "spells/introduction1",
        "crafting/staff"
      ]
    }
  ]
}