{
  "name": "Crafting Spells",
  "icon": "minecraft:lectern",
  "category": "arcanuscontinuum:basics",
  "advancement": "arcanuscontinuum:arcane/wizard_level_1",
  "sortnum": 2,
  "pages": [
    {
      "type": "patchouli:text",
      "text": "In order to craft spells, you'll need two things: a spell book and a lectern. If you place your spell book into the lectern, and then open it, you'll notice a different UI appear.$(br2)It'll look a little something like the image on the right. On either side are boxes containing various glyphs, depending on how high your wizard level is."
    },
    {
      "type": "patchouli:image",
      "border": true,
      "images": [
        "arcanuscontinuum:textures/gui/patchouli/entries/spell_crafting_blank.png"
      ],
      "text": "To the left are all your Spell Shapes, and to your right are all your Spell Effects."
    },
    {
      "title": "Spell Shapes",
      "type": "patchouli:text",
      "text": "Spell shapes are the mode by which the effects of a spell reach their target. For instance, a Projectile Shape will fire a projectile that, when it collides with an entity or block, will activate the spell effects associated with it.$(br2)Spell Shapes determine the weight, cooldown, and mana multiplier of a spell, and are all you really need for a valid spell - as long as you didn't want it to do anything."
    },
    {
      "title": "Spell Effects",
      "type": "patchouli:text",
      "text": "Spell Effects, on the other hand, are the actual functional parts of a spell. If you want to set a target on fire, you would use a Fire Effect!$(br2)Spell Effects must come after a Spell Shape in order to apply, and will only be applied to the Spell Shape immediately before them. Spell Effects determine the mana cost of a spell, and are additive. So two Spell Effects that cost 2 mana will result in a spell that costs 4."
    },
    {
      "title": "Chaining",
      "type": "patchouli:text",
      "text": "To create a spell, you'll need to put a Spell Shape in your book first, followed by whatever Spell Effects you want that shape to apply to the target.$(br2)You can then add another Spell Shape at the end to chain into another aspect of your spell. For instance, a Lob Shape with whatever Spell Effects you want on it, followed by an AOE Shape with its Spell Effects will result in a spell that can create an AOE at range!"
    },
    {
      "type": "patchouli:text",
      "text": "Chaining spell shapes and effects is very important to creating powerful spells. You may be inclined to just go all out by stacking a single Spell Effect on a single Spell Shape, but that gets costly and isn't as effective as a spell with chained shapes.$(br2)Just be aware you will need to unlock Spell Shapes and Effects by increasing your wizard level. You also can't cast a spell that costs more than double your mana, so watch those mana costs!"
    }
  ]
}
