{
  "name": "Rituals - Getting Started",
  "icon": "bloodmagic:activationcrystalcreative",
  "category": "bloodmagic:rituals",
  "priority": "true",
  "pages": [
    {
      "type": "text",
      "text": "Once you have gotten your $(l:bloodmagic:altar/blood_altar)Blood Altar$(/l) to Tier 3, you can delve into the wonderful world of Rituals. $(br2)For working with rituals, you will require the following: $(li)An $(l:bloodmagic:rituals/activation_crystals)Activation Crystal$(). At tier 3 only the $(item)Weak Crystal$() is available. $(li)A $(item)Master Ritual Stone$(). Every ritual requires exactly one of these at its centre."
    },
    {
      "type": "text",
      "text": "$(li)Enough Ritual Stones to build the Ritual. $(li)(Recommended) A $(l:bloodmagic:rituals/ritual_diviner)Ritual Diviner$(). Although not required, it will make ritual construction significantly easier. $(br2)Building a ritual is relatively straightforward. Simply press [$(k:sneak)] + [$(k:use)] with the Ritual Diviner in hand until it displays the name of the desired ritual. Check the number of runes required by mousing over it in your"
    },
    {
      "type": "text",
      "text": "inventory and holding [$(k:sneak)]. $(br2)Place down a Master Ritual Stone, and hold [$(k:use)] until all the stones have been placed and painted with the correct element. Finally, press [$(k:use)] on the Master Ritual Stone with your Activation Crystal in hand. If you've done everything right, you should get a message saying 'A rush of energy flows through the ritual!'. The ritual is now active."
    },
    {
      "type": "text",
      "text": "If this does not occur, a few things may have gone wrong. If you instead get text saying 'You feel a push, but are too weak to complete this ritual', then you do not have enough $(blood)LP$() in your $(thing)Soul Network$() to activate the ritual. $(br2)If the message reads 'You feel that these runes are not configured correctly...', then something has gone wrong in the placement of the runes. Check the area for any blockages and try assembling the ritual again."
    },
    {
      "type": "text",
      "text": "Remember that some rituals extend several blocks above and below the Master Ritual Stone. If you get no error, ensure that the activation crystal is bound to your soul network - this can be accomplished by pressing [$(k:use)] while holding it. $(br2) It is important to note that the crystal does not have to be bound to YOUR network - if you can get a hold of another player's crystal, you can activate rituals using their $(blood)LP$(). Guard yours well!"
    },
    {
      "type": "text",
      "text": "one last note; all rituals respond to a $(fire)redstone$() signal, so sticking a lever on the side of the Master Ritual Stone is a good way to deactivate it. You can combine this knowledge with some of the information in $(l:bloodmagic:altar/redstone_automation)Redstone and Automation$() to ensure your rituals shut down automatically long before your $(thing)Soul Network$() runs dry."
    }
  ]
}
