{
    "name": "Glyphs",
    "icon": "the_afterlight:glyph_of_power",
    "category": "the_afterlight:category_glyph",
    "sortnum": 4,
    "advancement": "the_afterlight:radiance",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "A total of five types of glyphs can be made. See the following few pages to learn information on each glyph. See the last page for a link to the wiki, where you can find the recipes to all five."
        },
        {
            "type": "patchouli:spotlight",
            "item": "the_afterlight:glyph_of_power",
            "text": "The glyph of power signifies ultimate power. It can be used to create a powerful sword called the Moon Blade, thus making it very useful for late game weaponry. In order to create this glyph, you will need the elements of radiance and bloodshed, or bloodstone shards and two glyphs of radiance."
        },
        {
            "type": "patchouli:spotlight",
            "item": "the_afterlight:glyph_of_sickness",
            "text": "The glyph of sickness signifies sickness and disease. While it is not harmful directly, it can be used in anything that inflicts harmful effects to a target, such as the Moon Blade. In order to create the element of sickness, one must combine verdant shards and two glyphs of knowledge."
        },
        {
            "type": "patchouli:spotlight",
            "item": "the_afterlight:glyph_of_radiance",
            "text": "The glyph of radiance signifies long life and holy light. It can be used to create lesser lifesteal, thus making it an ingredient in the Moon Blade. In order to create this glyph, you must combine pearl shards with two spectral glyphs."
        },
        {
            "type": "patchouli:spotlight",
            "item": "the_afterlight:spectral_glyph",
            "text": "The Spectral glyph signifies the thoughts of the dead and the spirits of the living. It can be used to create thoughts in a given item, thus making it an ingredient in the Moon Blade. In order to create this glyph, you must combine soul prisms with two eclipse shards."
        },
        {
            "type": "patchouli:spotlight",
            "item": "the_afterlight:glyph_of_knowledge",
            "text": "The glyph of knowledge signifies pure knowledge. It can be used in many things in order to bypass wisdom. In order to create this glyph, you will need to combine verdant shards with some moon crystal dust. See the next page for a link to all of the recipes for the glyphs listed."
        },
        {
            "type": "patchouli:text",
            "title": "Glyph Recipes",
            "text": "See the $(l:http://the-afterlight.fandom.com/wiki/Glyph_Altar_Recipes)Afterlight wiki$(/l) for all of the glyph recipes."
        }                      
    ]
}