{
    "name": "The Beginning",
    "icon": "the_afterlight:lore_scrap",
    "category": "the_afterlight:category_5",
    "sortnum": 1,
    "pages": [
        {
            "type": "patchouli:text",
            "text": "In the early days of the Afterlight dimension, a prosperous group of creatures called moonspawn set up several civilizations. Many of them were miners, builders, or craftsmen of incredible expertise. They also dabbled in astronomy, studying the blue moon that watched over them."
        },
        {
            "type": "patchouli:text",
            "text": "Sometime in the middle of an increasingly prosperous civilization, a moonspawn astronomer found a way to communicate to the moon through a process he called glyph working. He was attempting to create glyphs, which were magical runes that depicted the elements of the moon. In doing so, he realized that he actually called upon the moon itself."
        },
        {
            "type": "patchouli:text",
            "text": "Shortly after the moonspawns discovered they could call the Moon, little did they know but they gradually began to be driven mad at the mere idea of such pure power. The Moon was not as much of a friend after all, but a deceiving force that was in reality tricking them into insanity. However, the moonspawn nevertheless unintentionally submitted to the evergrowing madness."
        },
        {
            "type": "patchouli:text",
            "text": "Very few of the moonspawn could realize what was happening to rest of their kin, but those who did often sought to stop it. They knew the moon caused the insanity, as it happened only after they began communicating with the moon. Some of these moonspawns thought up a plan to strike back at the moon itself. "
        },
        {
            "type": "patchouli:text",
            "text": "Some moonspawn scientists started studying the effect of radiant shards. These were found commonly in the dimension as solid crystals. However, they realized that they could be used to harm creatures of some types, including the moon itself. A crucial component of the glyph working rituals turned out to be radiant shards coated in gold."
        },
        {
            "type": "patchouli:text",
            "text": "The moonspawn not under the moon's influence realized that they might be able to take advantage of the glyph working ritual by tricking the moon into accepting regular radiant shards in the ritual, rather than radiant shards covered in a metal that would protect the moon from them. Therefore, they tried out their plan by conducting some of those rituals themselves."
        },
        {
            "type": "patchouli:text",
            "text": "The moonspawns' plan seemed to work at first; the moon was succcessfully tricked into accepting the radiant shards. However, unfortunately for the remaining moonspawns, they did not realize that they could by no means resist the insanity, so they drove themselves mad regardless. Although, they did successfully destroy the moon and it's power."  
        }    
    ]

}