{
    "name": "Mystic Infusions",
    "icon": "the_afterlight:strange_obsidian",
    "category": "the_afterlight:category_1",
    "sortnum": 4,
    "pages": [
        {
            "type": "patchouli:text",
            "text": "Once you have created your very own ritual altar and obtained some crushed moon crystals, you'll need to do some special rituals on it. All of these rituals will not work during the day, so make sure to wait till nighttime before attempting to execute any infusions. See the next few pages for the recipes and details."
        },
        {
            "type": "patchouli:image",
            "images": ["the_afterlight:textures/strangeobsidianrecipe2.png", "the_afterlight:textures/staffofmoonlightrecipe2.png"],
            "title": "Basic Recipes",
            "border": true,  
            "text": "See the next page for more."
        },
        {
            "type": "patchouli:text",
            "title": "Moving Forward",
            "text": "The two recipes on the previous page are for strange obsidian and the staff of moonlight. Strange obsidian acts as the portal block for the Afterlight gateway, whereas the staff serves as the igniter, and can open it up. See the following pages for more recipes that can be done on the ritual altar, and see the next chapter for more about the portal itself."
        },
        {
            "type": "patchouli:text",
            "title": "Other Infusions",
            "text": "Like mentioned previously, the Ritual Altar can also be used to forge other various materials, including alloys and metals. Some of these things are important for the process of glyph working as well, making them quite useful for later when you enter the dimension. See the next few pages for all of the infusions possible on a built Ritual Altar at night."
        },    
        {
            "type": "patchouli:image",
            "images": ["the_afterlight:textures/crystilliumrecipe2.png"],
            "border": true,
            "title": "Crystillium", 
            "text": "Crystillium is a common and easy to make material."
        }, 
        {
            "type": "patchouli:image",
            "images": ["the_afterlight:textures/moonsteelrecipe2.png"],
            "border": true,
            "title": "Moonsteel",
            "text": "Moonsteel is a durable material, though quite rare and therefore valuable."
        },
        {
            "type": "patchouli:image",
            "images": ["the_afterlight:textures/livingessenceingotrecipe2.png"],
            "border": true,
            "title": "Living Ingots",    
            "text": "Ingots made of the living and of the dead."
        },    
        {
            "type":"patchouli:image",
            "images": ["the_afterlight:textures/livingstarrecipe2.png"],
            "border": true,
            "title": "Living Core", 
            "text": "Mystic cores made of living energy."
        }                 
    ]
}