{
    "name": "Elemental Crystals",
    "icon": "the_afterlight:bloodstone_ore",
    "category": "the_afterlight:category_3",
    "sortnum": 6,
    "advancement": "the_afterlight:delving_into_the_dark",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "Elemental crystals are rare objects found deep underground in the Afterlight dimension. There are three types: Bloodstone (or grim knowledge), verdant (or wisdom), and aqua (or nature). Each crystal has differing uses, although sometimes being able to be used together, like in respawn catalysts."
        },
        {
            "type": "patchouli:text",
            "title": "Formation",
            "text": "Each crystal is only found deep underground, in respective biomes. For bloodstone shards, they are only found below the heights of moonlight highlands and the plains of moonlight lowlands. For aqua, they can only be found in swampy areas. And lastly, verdant can only be found in lush areas, like forests."
        },
        {
            "type": "patchouli:text",
            "title": "Bloodstone",
            "text": "Bloodstone is an eerie type of elemental crystal made entirely of crystallized blood. I have no findings as to why or how, but that blood somehow has magical abilities that can be harnessed in some objects. Bloodstone ore can be found at deep levels, encased in slate."
        },
        {
            "type": "patchouli:text",
            "title": "Uses",
            "text": "Bloodstone shards are dropped by Bloodstone ore, and pulse with mystical energy. One can use Bloodstone shards to create a few magical objects, such as the respawn catalyst and the elemental amulet. Can also be used in glyph working."
        },
        {
            "type": "patchouli:text",
            "title": "Aqua",
            "text": "Aquastones are shiny crystals whose main characteristic is always forming as a rather dark shade of blue. The crystallized water trapped in these strange crystals can be used for magical uses. Aquastone can be found at deep levels, encased in slate."
        },
        {
            "type": "patchouli:text",
            "title": "Uses",
            "text": "Aqua Crystals are dropped from Aquastone ore, and pulse with mystical energy. One can use Aqua Crystals to create a few magical objects, such as the respawn catalyst and the elemental amulet."
        },
        {
            "type": "patchouli:text",
            "title": "Verdant",
            "text": "Verdant Quartz is an odd formation of floral matter and some sort of crystallized poison. I have no clue where the poison came from, but the crystals seems to draw magical energy from it. Verdant crystals can be found at deep levels, encased in slate."
        },
        {
            "type": "patchouli:text",
            "title": "Uses",
            "text": "Verdant Quartz shards are dropped by Verdant ore, and pulse with mystical energy. One can use Verdant Quartz shards to create a few magical objects, such as the respawn catalyst and the elemental amulet. They can also be used in glyph working."
        }
    ]
}