{
  "name": "Crucible",
  "icon": "reactive:crucible",
  "category": "reactive:intro",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "The $(item)Power Crucible$() is the $(thing)Essential Tool of Alchemy$(). Its unique capability to convert matter into its raw $(thing)Alchemical Power$() enables easy access to these powers.$(br2)Additionally, it acts as a medium for $(thing)Transmutation$(0) and a viable chamber for $(4)Reactions$(0)."
    },
    {
      "type": "patchouli:spotlight",
      "item": "reactive:crucible",
      "text": "First, the $(item)Crucible$() must be placed $(thing)In-World$(). Then, the $(item)Device$() may be filled with Water by hand. Due to the Warded Nature of its sides, $(thing)Automated Piping$() regrettably cannot access its interiors.$(br2)$(o)You can empty it with a shift right click."
    },
    {
      "type": "patchouli:text",
      "text": "When Items are added to the Crucible, a few things may happen. First, if an Item is the input for a $(thing)Transmutation$(0) recipe, the Item may be transformed by it if the necessary $(l:intro/powers)Powers$(/l) are present. You may view an example of such a recipe $(l:reactive:intro/techniques)here$(/l). $(br2)Otherwise, items that bear Power may Dissolve, leaving that Power in solution. This process halts if the Crucible's maximum capacity is reached."
    },
    {
      "type": "patchouli:text",
      "text": "The presence of Powers within the Crucible will often change the color or movement of the water inside.$(p)Usually, no trace of a dissolved Item remains, but some Items (those which possess a $(thing)Power Release$(0) recipe) leave a Byproduct. You may view an example of such a recipe $(l:reactive:intro/pure_quartz)here$(/l).$(br2)If none of these things happen, the Item will just float inside the Crucible, unaffected."
    },
    {
      "type": "patchouli:text",
      "text": "$(1)For the engineering-oriented: $(p)$(item)Dispensers$(1) are able to both fill and empty $(l:reactive:objects_of_study/bottles)bottles of Power$(/l) when aimed at a Crucible. $(p)A $(item)Hopper$(1) is able to autonomously add items to the Crucible, even from the sides. $(p)Finally, output items bounce out of the Crucible high enough that a stream of Water would be able to catch them."
    }
  ]
}