{
  "name": "The End",
  "icon": "minecraft:ender_eye",
  "category": "reactive:intro",
  "advancement": "minecraft:end/kill_dragon",
  "secret": true,
  "sortnum": 100,
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(o)Sorry if I got you all excited for a new crafting recipe or hint or something, but I really just needed to write you a note.$(br2)Let me explain. Recently, I was sleuthing around one of those Strongholds that the Endermen hold so dear while seeking guidance on $(l:reactive:results/astral)another matter$(/l)."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)Amongst the shelves of empty pages, I found something written down. A poem. I think you've heard it before, but to refresh your memory, the first lines are this: $(br2)$(reset)\"$(3)I see the player you mean. $(2)$(playername)?$(0)\"$(br2)$(o)That's you, isn't it? Don't be coy -- if this passage revealed itself to you, it must be so."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)Thinking about that poem, about your existence, brought me to an interesting state of mind. I'm not a spiritual person, but the more I learn about this world, the more it makes sense that there might be things at work that are beyond my ability to understand.$(br2)Don't worry about me too much -- I'll be dead by the time you're reading this. That's not the point."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)At any rate, knowing there will be someone after I'm gone, someone to put the pieces together, to build back whatever is left... I knew that I had to make an attempt to reach out to this person. But, I know you what you are. You're a player. You wouldn't burden yourself with a message that wasn't tied to a game. With that in mind, I created this journal."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)I assembled all the old notes, I added my own, I tied it all together and soon I will send it into a crafting recipe.$(br2)I needed you to care about this book, because if you did, it would mean you would know of our world. Your dream would include us. $(br2)I know it's selfish, but what can I say?"
    },
    {
      "type": "patchouli:text",
      "text": "$(o)Of course, there are many other things that exist at once. Maybe this message doesn't make any sense in the context you've created for it. Maybe your world truly has no trace of us, beyond this book. Maybe you simply don't care. $(br2)If that's the case, I am sorry for wasting your time."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)In any case, $(playername)... I hope you remember the end of the poem. You're part of everything, and now I am too. $(br2)It all loves you. $(br2)Take care."
    },
    {
      "type": "patchouli:empty"
    }
  ]
}