{
  "name": "Progression Guide",
  "icon": "terramity:guiding_moonlight",
  "category": "terramity:overview",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Terramity is all about furthering the progression, so it may be confusing for someone who doesn't know the mod very well to hop in immediately with no guidance, such is the consequence of having more stuff in a mod.$(br2)However, not to worry. This chapter is here to tell you what order you need to get things."
    },
    {
      "type": "patchouli:spotlight",
      "text": "After all, everyone wants the minigun, right?$(br)But you can't get it right off the bat, you'll need to work for it. On the next page, you should find a graph on what order metals should be obtained throughout the mod. Anytime a metal is on the same Y axis as another, they are the same tier, meaning you can choose what you want.",
	  "item": {
		"item": "terramity:stairway_to_heaven"
	  }
    },
	{
      "type": "patchouli:image",
      "title": "The Graph",
      "images": ["terramity:textures/screens/the_graph.png"],
      "border": false,
      "text": "      Higher is better."
    },
	{
      "type": "patchouli:text",
      "text": "As stated on the previous page, if a metal is on the same Y axis as another, it is the same tier as the others. You won't be able to get the top 3 metals without first getting the burning material below, $(l:terramity:ores/profanum)Profanum$().$(br2)Some materials may be locked behind bosses, such as black matter, which can only be obtained after defeating the Trial Guardian."
    },
	{
      "type": "patchouli:image",
      "title": "The Graph",
      "images": ["terramity:textures/screens/consult_the_graphs.png"],
      "border": true
    },
	{
      "type": "patchouli:spotlight",
      "text": "If you don't know what to do next, check the $(l:terramity:bosses)'Bosses' Category$() of this book. The bosses are ordered from top to bottom, first in progression to last in progression.",
	  "item": {
		"item": "terramity:offering_pedestal"
	  }
    }
  ]
}