{
  "itemGroup.hexresearch.hex_research": "Hex Research",

  "block.hexresearch.cognitive_inducer": "Cognitive Inducer",

  "effect.hexresearch.mind_fatigue": "Mind Fatigue",

  "text.hexresearch.thought_sieve.villager": "a villager",
  "text.hexresearch.villager_actions.villager": "a villager",
  "text.hexresearch.imbue_mind.cognitive_inducer": "an artificial mind",

  "text.hexresearch.cognitive_inducer.empty": "Empty",
  "text.hexresearch.cognitive_inducer.profession": "Profession: %s",
  "text.hexresearch.cognitive_inducer.biome": "Biome: %s",
  "text.hexresearch.cognitive_inducer.rank": "Rank: %s",

  "hexresearch.mishap.bad_mind_imbue": "a filled artificial mind",
  "hexresearch.mishap.not_per_world_pattern": "Expected a scroll containing a great spell",
  "hexresearch.mishap.not_scroll": "Expected a written scroll",

  "hexresearch.entry.items.cognitive_inducer": "Cognitive Inducer",
  "hexresearch.page.items.cognitive_inducer.1": "I have devised a construction capable of precipitating a rudimentary mind by induction from nearby villagers. It's not capable of true sapience, but I believe it will suffice for purposes such as bookkeeping or media manipulation.",
  "hexresearch.page.items.cognitive_inducer.2": "Constructed of slate, amethyst, and a diamond to serve as an anchor point for the mind.",
  "hexresearch.page.items.cognitive_inducer.3": "The operation of the Cognitive Inducer is simple enough. Set it down near a villager, feed it media with a hopper or similar, and wait. A $(l:hexcasting:items/lens)Scrying Lens/$ should help me monitor progress. Over time the inducer will take impressions of nearby villagers and over enough of these, will form a usable 'mind' of its own. I have noticed that after some time of continuous induction, a villager will stop contributing. I have not yet found a way to utilize this mind, but with more research I'm sure I will find a solution.",
  "hexresearch.page.items.cognitive_inducer.4": "I've done it!$(br2)I have invented? discovered? a $(l:hexresearch:patterns/great_spells/imbue_mind)great spell/$ that can transfer the mind from the inducer into a suitable construction in the same manner as $(l:hexcasting:greatwork/brainsweeping)Flay Mind/$.$(br2)Now I may cultivate minds for my own use and put them to work...$(br2)Should this bother me?",

  "hexcasting.spell.hexresearch:thought_sieve": "Thought Sieve",
  "hexcasting.spell.hexresearch:imbue_mind": "Imbue Mind",
  "hexcasting.spell.hexresearch:villager_rank": "Professional Purification",
  "hexcasting.spell.hexresearch:villager_popularity": "Suggestibility Purification",

  "hexresearch.entry.greatwork.on_thought_sifting": "On Thought Sifting",
  "hexresearch.page.greatwork.on_thought_sifting.1": "I thought I was asking Nature for the spells. I thought I was asking an entity for answers! I immersed their mind in the great tangle. Filtering thoughts through synapse through idea through...$(br2)It is a wonder that they survived at all. As I felt the filtered media I swear I got a glimpse memory thought idea colour...$(br)Stop. Here. Now. Breathe.",
  "hexresearch.page.greatwork.on_thought_sifting.2": "Were they more?",

  "hexresearch.entry.villager_actions": "Villagers",
  "hexcasting.spell.book.hexresearch:villager_rank": "Professional Prfn.",
  "hexcasting.spell.book.hexresearch:villager_popularity": "Suggestibility Prfn.",
  "hexresearch.page.villager_actions.intro.1": "These pages describe actions that glean information about villagers.",
  "hexresearch.page.villager_actions.villager_rank": "Accepts a Villager $(l:casting/101)entity/$ and returns their profession rank.",
  "hexresearch.page.villager_actions.villager_popularity": "Accepts a Villager $(l:casting/101)entity/$ and returns a number indicating how much the caster may influence them (the caster's popularity).",

  "hexresearch.entry.thought_sieve": "Thought Sieve",
  "hexcasting.spell.book.hexresearch:thought_sieve": "Thought Sieve",
  "hexresearch.page.thought_sieve.intro.1": "These great spells elude me so. There must be a better way to discover these than diving into old ruins to find what those before knew. If they discovered these, then so can I. To that end, I have found a way to ask Nature directly for these answers, but the answer comes as a torrent of what I can only perceive as garbage. Maybe I could filter the result somehow?",
  "hexresearch.page.thought_sieve.intro.2": "Villagers may have just enough mind to them. I wonder if I could use them as a filter or \"sieve\" to reduce the the torrent to something comprehensible. The villager should have have mastery of their profession so as to have the proper discipline. They would also need to be suggestible, so as to accept the flow of media. Gaining popularity with them should accomplish this. I fear for them if they resist the process. Filtering that much information through their mind could \"snag\".",
  "hexresearch.page.thought_sieve.spell.1": "Requests the proper way to invoke a great spell and filters the response through the mind of the villager. The scroll must hold a pattern that looks like a $(l:patterns/great_spells)great spell/$ but the stroke order is irrelevant.",
  "hexresearch.page.thought_sieve.spell.2": "If the spell is successful, it will rewrite the scroll to match the great spell. The greater the villager's $(l:hexresearch:patterns/villager_actions#hexresearch:villager_rank)mastery/$ over their profession, the more likely it is that their mind is up to the task. However, if the villager is not $(l:hexresearch:patterns/villager_actions#hexresearch:villager_popularity)suggestible/$ enough, they may lose part of themselves. In extreme cases, they may lose their life entirely... Am I really going to do this?",
  "hexresearch.page.thought_sieve.spell.3": "Thought sifting is mentally fatiguing for the villager. I must be careful to avoid using the same villager too often, or I may cause them additional harm. It doesn't take long for them to recover, however. Half a minute should be enough.",

  "hexresearch.entry.imbue_mind": "Imbue Mind",
  "hexcasting.spell.book.hexresearch:imbue_mind": "Imbue Mind",
  "hexresearch.page.spells.imbue_mind.1": "There's something here but I can't quite understand what it does...",
  "hexresearch.page.spells.imbue_mind.2": "I've grasped the meaning! This spell takes the location of a Cognitive Inducer and a target construction, then imbues the mind into the construction. The minds and constructions are exactly the same as for $(l:hexcasting:greatwork/brainsweeping)Flay Mind/$.",

  "hexresearch.misc.overlay.infinite": "§kInfinite§r",
  "hexresearch.misc.overlay.mind": "%s %s"
}
