{
  "name": "Time Crystals",
  "sortnum": 20,
  "category": "justdirethings:resources",
  "icon": "justdirethings:time_crystal",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Time Crystals are no trivial task to create, but they are very worth while as they have the power to affect time itself!  Creating them is a multi step process that will be outlined in the following pages.$(br2)First, use $(l:justdirethings:goo_tier4)Shadowpulse Goo$(/l) to convert a budding Amethyst block into a Budding Time Crystal block."
    },
    {
      "type": "patchouli:text",
      "text": "The Budding Time Crystal block must absorb time energy from each of Minecraft's 3 dimensions: The Overworld, The Nether, and The End.$(br2)Place the Budding Time Crystal block in The Overworld for some time. It will begin absorbing Overworld Time Energy, which you'll be able to see as blue particle effects. Once the block changes color, its ready for the next step."
    },
    {
      "type": "patchouli:text",
      "text": "You'll need to move the block into The Nether at this point, however you cannot break the block without shattering it - Even with Silk touch! You'll need to find $(l:justdirethings:mach_blockswappert1)Some Other Way$(/l) to move it across dimensions.  Once in the nether, it will absorb Nether Time Energy, which will appear as orange particle effects. Once the block changes color, its ready to move again."
    },
    {
      "type": "patchouli:text",
      "text": "Finally, move the block into The End. Here, it will absord End Time Energy, visualized as Green particle effects. Once complete, the block will turn green, and Time Crystal Buds will begin to appear.$(br2)Each time a time crystal bud sprouts, it consumes some of the time energy. Ensure you don't break the time crystal buds until they've fully grown, or you will destroy them, receiving nothing in return!"
    },
    {
      "type": "patchouli:text",
      "text": "Eventually, all of the time energy in the budding time crystal will be consumed.  At this point, you'll need to move it back to the Overworld and begin the charging process from the start.$(br)Note: While out of charge, the buds will not grow any longer. In addition, if you move JUST the Budding Time Crystal, the buds themselves will shatter. Its recommended to move the Crystal and its buds $(l:justdirethings:mach_blockswappert2)All Together$(/l)."
    },
    {
      "type": "patchouli:text",
      "text": "Some people have reported unusual time distortions while carrying these around.  You should be cautious."
    }
  ]
}
