{
  "itemGroup.ars_elemental": "元素魔艺",
  "item.ars_elemental.spell_horn": "巫师号角",
  "item.ars_elemental.fire_focus": "火之核心",
  "item.ars_elemental.water_focus": "水之核心",
  "item.ars_elemental.air_focus": "气之核心",
  "item.ars_elemental.earth_focus": "土之核心",
  "item.ars_elemental.lesser_fire_focus": "雏形火之核心",
  "item.ars_elemental.lesser_water_focus": "雏形水之核心",
  "item.ars_elemental.lesser_air_focus": "雏形气之核心",
  "item.ars_elemental.lesser_earth_focus": "雏形土之核心",
  "item.ars_elemental.necrotic_focus": "腐坏核心",
  "item.ars_elemental.base_bangle": "基础手环",
  "item.ars_elemental.fire_bangle": "火之手环",
  "item.ars_elemental.water_bangle": "水之手环",
  "item.ars_elemental.air_bangle": "气之手环",
  "item.ars_elemental.earth_bangle": "土之手环",
  "item.ars_elemental.fire_caster_tome": "火之施法者卷册",
  "item.ars_elemental.water_caster_tome": "水之施法者卷册",
  "item.ars_elemental.air_caster_tome": "气之施法者卷册",
  "item.ars_elemental.earth_caster_tome": "土之施法者卷册",
  "item.ars_elemental.anima_caster_tome": "灵魂施法者卷册",
  "tooltip.ars_elemental.caster_tome": "模仿该学派核心的能力",
  "item.ars_elemental.siren_shards": "塞壬碎片",
  "item.ars_elemental.siren_charm": "塞壬护符",
  "item.ars_elemental.firenando_charm": "烈焰加农护符",
  "item.ars_elemental.curio_bag": "饰品袋",
  "item.ars_elemental.caster_bag": "Spellcaster Bag",
  "item.ars_elemental.debug": "调试核心",
  "item.ars_elemental.mark_of_mastery": "Mark of Mastery",
  "item.ars_elemental.anima_essence": "Anima Essence",
  "item.ars_elemental.flashpine_pod": "Flashpine",
  "item.ars_elemental.thread_shock": "Shocking",
  "item.ars_elemental.thread_spore": "Spores",
  "item.ars_elemental.thread_summon": "Summoning",
  "item.ars_elemental.arc_prism_lens": "Arc Prism Lens",
  "item.ars_elemental.homing_prism_lens": "Homing Prism Lens",
  "item.ars_elemental.rainbow_prism_lens": "Rainbow Prism Lens",
  "item.ars_elemental.acceleration_prism_lens": "Acceleration Prism Lens",
  "item.ars_elemental.deceleration_prism_lens": "Deceleration Prism Lens",
  "item.ars_elemental.piercing_prism_lens": "Piercing Prism Lens",
  "block.ars_elemental.water_upstream": "Bubble Current Elevator",
  "block.ars_elemental.magma_upstream": "Magmatic Current Elevator",
  "block.ars_elemental.air_upstream": "Slipstream Current Elevator",
  "block.ars_elemental.everfull_urn": "Urn of Endless Waters",
  "block.ars_elemental.mermaid_rock": "塞壬神坛",
  "block.ars_elemental.spell_mirror": "Spell Mirror",
  "block.ars_elemental.advanced_prism": "Advanced Spell Prism",
  "block.ars_elemental.yellow_archwood": "闪耀至高木",
  "block.ars_elemental.yellow_archwood_log": "闪耀至高原木",
  "block.ars_elemental.stripped_yellow_archwood": "去皮闪耀至高木",
  "block.ars_elemental.stripped_yellow_archwood_log": "去皮闪耀至高原木",
  "block.ars_elemental.yellow_archwood_sapling": "闪耀至高树苗",
  "block.ars_elemental.yellow_archwood_leaves": "闪耀至高树叶",
  "block.ars_elemental.spore_blossom_up": "孢子花（地面）",
  "block.ars_elemental.fire_turret": "火之灌注炮台",
  "block.ars_elemental.water_turret": "水之灌注炮台",
  "block.ars_elemental.air_turret": "气之灌注炮台",
  "block.ars_elemental.earth_turret": "土之灌注炮台",
  "block.ars_elemental.manipulation_turret": "Manipulation Infused Turret",
  "entity.ars_elemental.homing_projectile": "Homing Projectile",
  "entity.ars_elemental.curved_projectile": "Arc Projectile",
  "entity.ars_elemental.lerp": "Interpolated Projectile",
  "entity.ars_elemental.summon_skelehorse": "被召唤的骷髅马",
  "entity.ars_elemental.summon_direwolf": "被召唤的冰原狼",
  "entity.ars_elemental.summon_vhex": "被召唤的邪恶恼鬼",
  "entity.ars_elemental.summon_wskeleton": "被召唤的复仇者",
  "entity.ars_elemental.summon_dolphin": "被召唤的海豚",
  "entity.ars_elemental.summon_strider": "被召唤的炽足兽",
  "entity.ars_elemental.linger_magnet": "引力场",
  "entity.ars_elemental.siren_entity": "塞壬",
  "entity.ars_elemental.siren_familiar": "塞壬",
  "entity.ars_elemental.firenando_entity": "烈焰加农",
  "entity.ars_elemental.firenando_familiar": "烈焰加农",
  "entity.ars_elemental.fire_mage": "漂泊火之法师",
  "entity.ars_elemental.water_mage": "漂泊水之法师",
  "entity.ars_elemental.air_mage": "漂泊气之法师",
  "entity.ars_elemental.earth_mage": "漂泊土之法师",
  "entity.ars_elemental.flashing_weald_walker": "闪耀林地行者",
  "key.ars_elemental.open_pouch": "[元素魔艺] 打开饰品袋",
  "curios.modifiers.an_focus": "当放置在法术核心槽时：",
  "curios.modifiers.bangle": "当放置在手环槽时：",
  "curios.identifier.bundle": "手袋",
  "curios.identifier.bangle": "手环",
  "effect.ars_elemental.enderference": "Enderference",
  "effect.ars_elemental.enderference.description": "Makes the target unable to teleport or be teleported.",
  "effect.ars_elemental.watery_grave": "沉重之水",
  "effect.ars_elemental.watery_grave.description": "使目标更快沉入水底并加速氧气消耗。",
  "effect.ars_elemental.mana_shield": "Mana Shield",
  "effect.ars_elemental.mana_shield.description": "Use mana to mitigate damage taken and add a chance to not suffer from negative effects.",
  "effect.ars_elemental.static_charged": "Static Charged",
  "effect.ars_elemental.static_charged.description": "Calls a lightning to hit the afflicted when the duration ends.",
  "effect.ars_elemental.hellfire": "地狱之火",
  "effect.ars_elemental.hellfire.description": "地狱之火可以让包括下界生物在内的生物燃烧，降低其治疗效果，并使其更容易被火焰伤害。",
  "effect.ars_elemental.life_link": "生命链接",
  "effect.ars_elemental.life_link.description": "Caster will split incoming damage with the target and the target will split incoming healing with the caster. Using Cut will dispel the effect on both sides.",
  "effect.ars_elemental.enthralled": "魂不着体",
  "effect.ars_elemental.enthralled.description": "使目标生物被魅惑，令其不会攻击施法者，而是为施法者战斗。",
  "effect.ars_elemental.hymn_of_order": "秩序之歌",
  "effect.ars_elemental.hymn_of_order.description": "无法以正常手段获得，仅限管理员使用。沉默目标玩家并使其法力上限锁定为1，以防止他继续在服务器中作乱。",
  "enchantment.ars_elemental.mirror_shield": "法术镜射",
  "enchantment.ars_elemental.mirror_shield.desc": "将其附魔在巫师之盾上，让它可以像镜子一样反弹法术。",
  "enchantment.ars_elemental.soulbound": "Soulbound",
  "enchantment.ars_elemental.soulbound.description": "Preserve items on death.",
  "ars_nouveau.page.elemental_tweaks": "元素魔艺带来的新特性",
  "ars_elemental.page.elemental_tweaks": "以下特性会在你安装元素魔艺后生效：$(br)巫师之盾可以在阻挡时触发反应魔咒；$(br)被召唤的闪电不再会摧毁物品；$(br)粉碎构件+敏感构件的组合可以处理掉落物；$(br)寒流构件会对冰冻的生物造成更多伤害；$(br)点燃构件能够将冰融化成水。",
  "ars_nouveau.page.flashing_archwood": "Flashing Archwood Trees",
  "ars_elemental.page1.flashing_archwood": "This golden tree has an affinity with the sky. Just like the other archwood trees it can be found anywhere and in their biome. It can be used to make ritual tablets or as a dim light source. The corresponding Weald Walker launches enemies in the air and wind shear them.",
  "ars_elemental.page2.flashing_archwood": "A fruit with a shocking flavour used to brew Static Charge Potions, causing a lightning to fall on the entity when the duration ends or allowing Discharge to hit. The energy stored in the fruit may cause whoever eats it to glow, get night vision, be shocked or charged with static energy.",
  "ars_elemental.page1.spell_horn": "The Enchanter's Horn can be used to cast spells on you and nearby entities. Hold the Horn to increase the range, at max charge it will also give a Spell Damage effect to the player. It MUST be inscribed with a spell that does NOT have another method, using a Scribing Table.",
  "ars_elemental.page.curio_bag": "All those trinkets can easily clutter your inventory, but you never know when they will be useful. Using some magebloom fiber you can make a pouch to store and carry around curios, potion flasks, charms and other small items. You can also open it with $(k:ars_elemental.open_pouch) while in the hotbar or in a curio slot.",
  "ars_elemental.page.caster_bag": "The trinket pouch can only hold rather small things, but with a stronger fiber it seems possible to hold different kind of magical items. The Spellcaster bag can hold any caster tool and the mod's magic armor, arrow and shield. You can also open it with $(k:ars_elemental.open_pouch) while in the hotbar or in a curio slot.",
  "ars_elemental.page1.fire_focus": "This spell focus is attuned to the school of Fire. While equipped, the glyphs of this school will be amplified and discounted. The lesser focus, as a drawback, will weaken glyphs of the other elemental schools. The major focus will also grant Spell Damage II while the wearer is on fire or in lava.",
  "ars_elemental.page2.fire_focus": "This focus empowers Ignite to inflict Hellfire Burn. This effect reduces healing and allows flare to inflict damage and spread even on fire resistant mobs. Summon Steed will be changed to summon a rideable Strider. Ignite + Evaporate combo will sublimate Ice.",
  "ars_elemental.page1.water_focus": "水之核心是水元素学派对应的元素核心。当装备上该核心时，该学派的魔符效益将会增强并减少魔力消耗。雏形元素核心具有一个缺点，它将会削弱其他元素学派的魔符。更高级的水之核心会为潮湿状态的装备者带来魔力再生I的效果，会为游泳时的装备者带来魔力再生II和海豚的恩惠效果。",
  "ars_elemental.page2.water_focus": "This focus empowers Freeze, adding Freezing seconds to the target. If used after Conjure Water, the conjured water will become ice. Summon Steed will be changed to summon a rideable Dolphin, time your jumps out of the water to build up speed. All Drowning damage against water creatures will be converted to magic.",
  "ars_elemental.page1.air_focus": "This spell focus is attuned to the school of Air. While equipped, the glyphs of this school will be amplified and discounted. The lesser focus, as a drawback, will weaken glyphs of the other elemental schools. The major focus will also grant Mana Regen I while the wearer stands over Y 200 or is under the shocked effect.",
  "ars_elemental.page2.air_focus": "This focus empowers Launch, changing it to apply Levitate when augmented with ExtendTime. It also empower Cut, giving chances to drop an head or skull if it deals the killing blow.",
  "ars_elemental.page1.earth_focus": "土之核心是土元素学派对应的元素核心。当装备上该核心时，该学派的魔符效益将会增强并减少魔力消耗。雏形元素核心具有一个缺点，它将会削弱其他元素学派的魔符。更高级的土之核心会让装备者在处于Y=0以下时获得魔力再生I的效果。",
  "ars_elemental.page2.earth_focus": "This focus empowers Poison Spores and Grow, dealing damage to undead with a chance of spawning a spore blossom, and Gravity, when augmented with Sensitive, changing it to create a gravity field that pull entities towards its center (filter-compatible), also offers knockback resistance and boosts natural and instant healing by 1.5.",
  "ars_elemental.page1.necrotic_focus": "This school of magic branched out from Conjuration and Abjuration mages that tried to understand life, death and what's between. The essence tied to this school cycles between life and death, experiments suggest that it will make horses cycle between flesh, skeleton and zombie forms, but will it be the same horse as before?",
  "ars_elemental.page2.necrotic_focus": "By imbuing the Focus of Summoning with evil energies, you can corrupt its powers towards Necromancy. Glyphs of the Anima school will get two free ExtendTime, Heal gets two amplify and Charm has way more chance to affect undead mobs. Summon Steed will change in Summon Skeletal Steed, which is able to walk and breathe underwater.",
  "ars_elemental.page3.necrotic_focus": "Summoned Wolves, Undead and Vexes seems unchanged at first, but if they die while the summoner wear this focus they will rise from death once, filled with blood lust. These undead summons will cast Homing spells when you do and heal you every time they kill an enemy.",
  "ars_elemental.page.water_upstream": "This block generates an upstream current that will make surrounding entities in water float upwards as if inside a bubble column, even if they are not in source blocks. Sneaking will allow to descend.",
  "ars_elemental.page.magma_upstream": "This block generates an upstream current that will make surrounding entities in lava float upwards and gain a short Fire Resistance effect. Sneaking will allow to descend",
  "ars_elemental.page.air_upstream": "This block generates an upstream current that will make surrounding entities levitate. Sneaking will give Slowfall and allow to descend. Consumes Source when at least an entity is affected.",
  "ars_elemental.page.everfull_urn": "This magic urn converts Source into water. Link a cauldron or an Apothecary to the urn using a dominion wand and it will be refilled for a cheap amount of source.",
  "ars_elemental.page1.fire_golem": "烈焰加农就像林地行者那样，是一个游荡式的哨兵。它可以发射烈焰包裹的追踪炮弹来攻击敌人，使用支配之杖可以规定他巡逻的区域。可以用灵魂沙或岩浆块来改变它的外观。如果烈焰加农负伤瘫痪，可以使用烈焰粉或岩浆膏将其重新激活。你也可以叫它费尔南多。",
  "ars_elemental.page1.mermaid": "Sirens are found in warmer seas, jumping out of the water or following boats. You can befriend a wild mermaid by giving them a sea pickle, they will jump and leave behind few shards. The siren charm can be used to summon a Siren and if used on Prismarine it will transform in a Siren Shrine. Tamed sirens can change colors if you give them kelp or corals.",
  "ars_elemental.page2.mermaid": "随着时间的推移，神坛会慢慢地产生钓鱼产物，每经过一个生产周期都会消耗一些魔源。如果神坛附近存在许多不同的水生动物和植物，产生物品的数量与获得宝藏的机会会增加。为了让塞壬们感到快乐，你可以在神坛附近建一座漂亮的水族馆或生态丰富的池塘。[注：更新分数需要一些时间]。",
  "ars_elemental.page1.advanced_prism": "Upgrade of the Spell Prism that can be adjusted to aim to a specific block. Use the dominion wand to link the prism to a block. This prism also allows lenses, but can't be pushed by pistons.",
  "ars_elemental.page2.advanced_prism": "A Prism Lens can be applied to this advanced prisms to customize how the prism redirects projectiles. Arc and Homing lenses change the projectile to be an arc or homing projectile. Rainbow lens randomize the color of the projectile, while Acceleration and Deceleration lenses allow to adjust the speed.",
  "ars_elemental.page.spell_mirror": "Mirror similar to a Spell Prism that can be placed on walls, floor and ceiling. If a spell projectile hits the mirror, it will be reflected by with a mirrored angle.",
  "ars_nouveau.page.elemental_turrets": "元素灌注炮台",
  "ars_elemental.page1.elemental_turrets": "Enchanted Turrets can be imbued with the power of an elemental focus to gift them a fractions of its abilities. Spells shot by these turrets will trigger the combos of the corresponding focus and will be discounted by 65 %% if the spell contains a glyph of the matching elemental school.",
  "ars_elemental.page.base_bangle": "This magic accessory has a chance to boost the damage of your spells. Its magic is unstable but perhaps attuning it to a school can stabilize its abilities.",
  "ars_elemental.page1.air_bangle": "气之手环会增加气元素魔符造成的伤害。你的手臂伴随着气岚的鼓动，你的移动速度和攻击击退将被提升。",
  "ars_elemental.page1.fire_bangle": "火之手环会增加火元素魔符造成的伤害。你的手臂被烈火包裹，攻击将附有火焰，当你处于炎热的地形时，你会感到移动速度得到提升。",
  "ars_elemental.page1.earth_bangle": "土之手环会增加土元素魔符造成的伤害。你的手臂爬满艳丽的花藤，它们会束缚你所攻击的敌人，让你奔行于仙人掌或浆果丛时如若等闲。",
  "ars_elemental.page1.water_bangle": "水之手环会增加水元素魔符造成的伤害。你的手臂周围飘满寒气，令你所攻击的敌人冻结，若你于水中或雨中徐行，你会感到移动速度得到提升。",
  "ars_elemental.page.book_protection": "This book upgrade will protect your spellbook from all kinds of damage, may it be a cactus or a pool of lava. Can't guarantee on the void. The gold inlays will become netherite-black but you can toggle it off in the client configs.",
  "ars_elemental.perk_desc.thread_shock": "Damaging effects cause the target to be shocked for a short duration before the effect resolves. Inflicts Static Charged at tier 3.",
  "ars_elemental.perk_desc.thread_spore": "Damaging effects cause the target to be poisoned or hungry for a short duration before the effect resolves.",
  "ars_elemental.perk_desc.thread_summon": "Reduce Summon Sickness by 10%% for each tier. Starting from tier 2, it also slightly increase damage dealt by summoned creatures.",
  "item.ars_elemental.ritual_squirrels": "Fast Squirrels",
  "ars_elemental.ritual_desc.ritual_squirrels": "Gives a long speed boost to Starbuncles in the area. Refresh buff every 30 seconds in a 15 cubes radius. Radius can be augmented to 30 with a gold block",
  "item.ars_elemental.ritual_tesla_coil": "Zapping",
  "ars_elemental.ritual_desc.ritual_tesla_coil": "Calls lightning on entities that approach the ritual area of effect. Will target players if augmented with Air Essence. [11x7x11 cube centered on the brazier].",
  "item.ars_elemental.ritual_repulsion": "Repulsion",
  "ars_elemental.ritual_desc.ritual_repulsion": "Repel all mobs in a 15 block radius. Can be augmented with a bone to repel only undead mobs. Won't work on player and bosses.",
  "item.ars_elemental.ritual_attraction": "Attraction",
  "ars_elemental.ritual_desc.ritual_attraction": "Make the brazier act as a magnet for entities in a 8 blocks radius. Won't work on players and bosses.",
  "item.ars_elemental.ritual_detection": "Detection",
  "ars_elemental.ritual_desc.ritual_detection": "Makes all monsters in a 128 blocks radius glow for 10 minutes.",
  "ars_elemental.enchantment_desc.mirror_shield": "Can only be applied on the Enchanter's Shield. Gives a chance of reflecting spell projectile while blocking with the shield. 25% per level.",
  "ars_elemental.enchantment_desc.soulbound": "Prevent the item enchanted from being lost on death.",
  "item.ars_elemental.siren_familiar": "Bound Script: Siren",
  "ars_elemental.familiar_name.siren_familiar": "Siren",
  "ars_elemental.familiar_desc.siren_familiar": "A Siren Familiar will increase the damage of Water spells by 2. It will also give Dolphin Grace II to the summoner while in water. Obtained by performing the Ritual of Binding near a Siren.",
  "item.ars_elemental.firenando_familiar": "Bound Script: Flarecannon",
  "ars_elemental.familiar_name.firenando_familiar": "Flarecannon",
  "ars_elemental.familiar_desc.firenando_familiar": "A Flarecannon Familiar increases the damage of Fire spells by 2 and reduce projectile-based spells cost by 20%%. You can feed it a Magma Cream to get a short Fire Resistance buff. Obtained by performing the Ritual of Binding near a Flarecannon.",
  "ars_elemental.glyph_name.glyph_discharge": "Discharge",
  "ars_elemental.glyph_desc.glyph_discharge": "Discharge an entity affected by static charge or shocked, damaging it and shocking surrounding enemies. If the damage was triggered by static charge, it will be empowered. If the main target had energy-based armors, some of the energy in it will be absorbed to boost damage.",
  "ars_elemental.glyph_name.glyph_bubble_shield": "Mana Bubble",
  "ars_elemental.glyph_desc.glyph_bubble_shield": "Creates a protective coating that consumes mana to reduce incoming damage. The shield might also prevent debuff to affect the entity and will dissipate if the mana exhausts while defending. May also cure from Hellfire burn if used with the water focus.",
  "ars_elemental.glyph_name.glyph_watery_grave": "Watery Grave",
  "ars_elemental.glyph_desc.glyph_watery_grave": "Dooms a creature to drown. Reduces the target air supply and causes drowning damage when depleted. Similar to gravity the target will sunken down if in water, can be augmented with ExtendTime.",
  "ars_elemental.glyph_name.glyph_conjure_terrain": "Conjure Terrain",
  "ars_elemental.glyph_desc.glyph_conjure_terrain": "Places Dirt or other terrain blocks. Can be augmented with AoE and Pierce to place more blocks, one Amplify to place cobblestone, two for cobbled deepslate, or one of the following combinations: Followed by ConjureWater, it will place Mud. If augmented with Amplify(s) and followed by Smelt, it will place Stone or Deepslate. If followed by Crush it will place Sand or, if amplified, Sandstone.",
  "ars_elemental.glyph_name.glyph_poison_spores": "Poison Spores",
  "ars_elemental.glyph_desc.glyph_poison_spores": "A fog of poison spores erupts from the target, damaging it and causing poison and hunger to spread to nearby entities. It can only damage mobs poisoned or afflicted by hunger.",
  "ars_elemental.glyph_name.glyph_phantom_grasp": "Phantom Grasp",
  "ars_elemental.glyph_desc.glyph_phantom_grasp": "Heals a small amount of health to undead. When used on living beings, the spell will deal an equal amount of magic and exhaustion damage, depleting their saturation or hunger.",
  "ars_elemental.glyph_name.glyph_homing_projectile": "Homing Projectile",
  "ars_elemental.glyph_desc.glyph_homing_projectile": "This projectile seek the nearest entity and follow it, will behave as a classic projectile while there are no valid targets. Players will only be targeted if augmented by Sensitive.",
  "ars_elemental.glyph_name.glyph_propagator_homing": "Propagate Homing",
  "ars_elemental.glyph_desc.glyph_propagator_homing": "Convert the remainder of the spell into an Homing Projectile and shoot it from where it lands.",
  "ars_elemental.glyph_name.glyph_curved_projectile": "Arc Projectile",
  "ars_elemental.glyph_desc.glyph_curved_projectile": "This projectile is affected by gravity. Every Pierce applied will make it bounce one time when it hit the ground.",
  "ars_elemental.glyph_name.glyph_propagator_arc": "Propagate Arc",
  "ars_elemental.glyph_desc.glyph_propagator_arc": "Convert the remainder of the spell into an Arc Projectile and shoot it from where it lands.",
  "ars_elemental.glyph_name.glyph_aquatic_filter": "Filter: Aquatic",
  "ars_elemental.glyph_desc.glyph_aquatic_filter": "Stops the spell from resolving unless it targets an aquatic creature.",
  "ars_elemental.glyph_name.glyph_not_aquatic_filter": "Filter: Not Aquatic",
  "ars_elemental.glyph_desc.glyph_not_aquatic_filter": "Stops the spell from resolving if it targets an aquatic creature.",
  "ars_elemental.glyph_name.glyph_aerial_filter": "Filter: Aerial",
  "ars_elemental.glyph_desc.glyph_aerial_filter": "Stops the spell from resolving unless it targets an aerial creature.",
  "ars_elemental.glyph_name.glyph_not_aerial_filter": "Filter: Not Aerial",
  "ars_elemental.glyph_desc.glyph_not_aerial_filter": "Stops the spell from resolving if it targets an aerial creature.",
  "ars_elemental.glyph_name.glyph_fiery_filter": "Filter: Fireproof",
  "ars_elemental.glyph_desc.glyph_fiery_filter": "Stops the spell from resolving unless it targets a fire immune or fiery creature.",
  "ars_elemental.glyph_name.glyph_not_fiery_filter": "Filter: Flammable",
  "ars_elemental.glyph_desc.glyph_not_fiery_filter": "Stops the spell from resolving if it targets a fire immune or fiery creature.",
  "ars_elemental.glyph_name.glyph_insect_filter": "Filter: Insect",
  "ars_elemental.glyph_desc.glyph_insect_filter": "Stops the spell from resolving unless it targets an arthropod creature.",
  "ars_elemental.glyph_name.glyph_not_insect_filter": "Filter: Not Insect",
  "ars_elemental.glyph_desc.glyph_not_insect_filter": "Stops the spell from resolving if it targets an arthropod creature.",
  "ars_elemental.glyph_name.glyph_undead_filter": "Filter: Undead",
  "ars_elemental.glyph_desc.glyph_undead_filter": "Stops the spell from resolving unless it targets an undead creature.",
  "ars_elemental.glyph_name.glyph_not_undead_filter": "Filter: Not Undead",
  "ars_elemental.glyph_desc.glyph_not_undead_filter": "Stops the spell from resolving if it targets an undead creature.",
  "ars_elemental.glyph_name.glyph_summon_filter": "Filter: Summon",
  "ars_elemental.glyph_desc.glyph_summon_filter": "Stops the spell from resolving unless it targets a summoned creature.",
  "ars_elemental.glyph_name.glyph_not_summon_filter": "Filter: Not Summon",
  "ars_elemental.glyph_desc.glyph_not_summon_filter": "Stops the spell from resolving if it targets a summoned creature.",
  "ars_nouveau.school.necromancy": "灵魂",
  "ars_elemental.glyph_name.glyph_life_link": "Life Link",
  "ars_elemental.glyph_desc.glyph_life_link": "You create a link between your life force and the target's. Any damage dealt to you will be shared with the target and any healing of the target will be shared with you. Cut can sever the life link, ending the effect on both sides.",
  "ars_elemental.glyph_name.glyph_charm": "Charm",
  "ars_elemental.glyph_desc.glyph_charm": "Try to dominate the mind of enemy, making them fight for you as a temporary ally, a tamable mob, to tame it, or a wild animal, to make it fall in love. Each Amplify and damage dealt raises the chance of successfully charming the target, as stronger mobs will have higher resistance to your control.",
  "death.attack.hellflare": "%1$s在魔法火焰中起舞",
  "death.attack.hellflare.item": "%1$s被%2$s使用%3$s的魔法火焰燃烧成灰烬飘散",
  "death.attack.poison": "%2$s抛洒的毒孢子在%1$s体内开出美丽的花朵",
  "death.attack.poison.item": "%1$s被%2$s使用%3$s毒害",
  "item.ars_elemental.fire_hat": "Pyromancer's Hat",
  "item.ars_elemental.fire_robes": "Pyromancer's Robes",
  "item.ars_elemental.fire_leggings": "Pyromancer's Leggings",
  "item.ars_elemental.fire_boots": "Pyromancer's Boots",
  "item.ars_elemental.aqua_hat": "Aquamancer's Hat",
  "item.ars_elemental.aqua_robes": "Aquamancer's Robes",
  "item.ars_elemental.aqua_leggings": "Aquamancer's Leggings",
  "item.ars_elemental.aqua_boots": "Aquamancer's Boots",
  "item.ars_elemental.earth_hat": "Geomancer's Hat",
  "item.ars_elemental.earth_robes": "Geomancer's Robes",
  "item.ars_elemental.earth_leggings": "Geomancer's Leggings",
  "item.ars_elemental.earth_boots": "Geomancer's Boots",
  "item.ars_elemental.air_hat": "Aethermancer's Hat",
  "item.ars_elemental.air_robes": "Aethermancer's Robes",
  "item.ars_elemental.air_leggings": "Aethermancer's Leggings",
  "item.ars_elemental.air_boots": "Aethermancer's Boots",
  "ars_elemental.armor_set.shift_info": "Hold %s for set info",
  "ars_elemental.lens.shift_info": "Hold %s for lens info",
  "ars_elemental.lens.arc": "Convert the redirected projectile in an Arc Projectile.",
  "ars_elemental.lens.homing": "Convert the redirected projectile in an Homing Projectile. The targeting filters of the original projectile won't be inherited.",
  "ars_elemental.lens.rgb": "Randomly change the color of the redirected projectile.",
  "ars_elemental.lens.acceleration": "Increase the speed of the redirected projectile.",
  "ars_elemental.lens.deceleration": "Decrease the speed of the redirected projectile.",
  "ars_elemental.lens.pierce": "Makes the redirected projectile more piercing if source is supplied.",
  "ars_elemental.page.armor_set.wip": "Note: Since the Armor Rework requires a lot of assets work, the light and heavy elemental armors variants won't be ready for 1.19, so the 'medium' elemental armors can be crafted will all three types. Upgrading will keep enchants and threads, but requires the base armor to be at tier 3.",
  "ars_elemental.armor_set.fire": "Pyromancer's Set",
  "ars_elemental.armor_set.fire.desc": "Absorb some fire-related damage and convert into mana, instantly clears fire.",
  "ars_elemental.armor_set.aqua": "Aquamancer's Set",
  "ars_elemental.armor_set.aqua.desc": "Absorb some water-related damage and convert into mana, refill air if about to drown.",
  "ars_elemental.armor_set.earth": "Geomancer's Set",
  "ars_elemental.armor_set.earth.desc": "Absorb some earth-related damage and convert into mana, gives food deep underground if about to starve.",
  "ars_elemental.armor_set.air": "Aethermancer's Set",
  "ars_elemental.armor_set.air.desc": "Absorb some air-related damage and convert into mana, falling won't be a problem anymore!",
  "ars_elemental.page.armor_set.fire": "Attuned to the School of Fire, each piece of this armor will amplify fire glyphs, make them cheaper, and reduce damage related to fire, like lava, dragon breath and magma.$(br)When all the pieces are equipped, the damage reduced is converted into mana and fire is immediately put out.",
  "ars_elemental.page.armor_set.aqua": "Attuned to the School of Water, each piece of this armor will amplify water glyphs, make them cheaper and reduce damage related to water, like drowning, freezing and lightning.$(br)When all the pieces are equipped, the damage reduced is converted into mana and refill air if about to drown.",
  "ars_elemental.page.armor_set.air": "Attuned to the School of Air, each piece of this armor will amplify air glyphs, make them cheaper and reduce damage related to air, like falling, hitting walls while flying and lightning.$(br)When all the pieces are equipped, the damage reduced is converted into mana and falling won't be a problem anymore!.",
  "ars_elemental.page.armor_set.earth": "Attuned to the School of Earth, each piece of this armor will amplify earth glyphs, make them cheaper and reduce damage related to earth, like starving, berry bushes, cactus and crushing.$(br)When all the pieces are equipped, the damage reduced is converted into mana and gives food deep underground if about to starve.",
  "ars_elemental.thread_of": "Thread of %s",
  "ars_elemental.tablet_of": "Tablet of %s",
  "tooltip.siren_shards": "Obtained by giving a sea pickle to a siren.",
  "tooltip.ars_elemental.lens": "Can be applied on Advanced Spell Prisms.",
  "tooltip.ars_nouveau.blessed": "Protection of the 4 elements",
  "item.minecraft.splash_potion.effect.enderference_potion_strong": "Splash Potion of Enderference",
  "item.minecraft.splash_potion.effect.enderference_potion": "Splash Potion of Enderference",
  "item.minecraft.splash_potion.effect.enderference_potion_long": "Splash Potion of Enderference",
  "item.minecraft.potion.effect.enderference_potion_strong": "Potion of Enderference",
  "item.minecraft.potion.effect.enderference_potion": "Potion of Enderference",
  "item.minecraft.potion.effect.enderference_potion_long": "Potion of Enderference",
  "item.minecraft.lingering_potion.effect.enderference_potion_strong": "Lingering Potion of Enderference",
  "item.minecraft.lingering_potion.effect.enderference_potion": "Lingering Potion of Enderference",
  "item.minecraft.lingering_potion.effect.enderference_potion_long": "Lingering Potion of Enderference",
  "item.minecraft.tipped_arrow.effect.enderference_potion_strong": "Arrow of Enderference",
  "item.minecraft.tipped_arrow.effect.enderference_potion": "Arrow of Enderference",
  "item.minecraft.tipped_arrow.effect.enderference_potion_long": "Arrow of Enderference",
  "item.minecraft.splash_potion.effect.shock_potion_potion_strong": "Splash Potion of Static Charge",
  "item.minecraft.splash_potion.effect.shock_potion": "Splash Potion of Static Charge",
  "item.minecraft.splash_potion.effect.shock_potion_long": "Splash Potion of Static Charge",
  "item.minecraft.potion.effect.shock_potion_strong": "Potion of Static Charge",
  "item.minecraft.potion.effect.shock_potion": "Potion of Static Charge",
  "item.minecraft.potion.effect.shock_potion_long": "Potion of Static Charge",
  "item.minecraft.lingering_potion.effect.shock_potion_strong": "Lingering Potion of Static Charge",
  "item.minecraft.lingering_potion.effect.shock_potion": "Lingering Potion of Static Charge",
  "item.minecraft.lingering_potion.effect.shock_potion_long": "Lingering Potion of Static Charge",
  "item.minecraft.tipped_arrow.effect.shock_potion_strong": "Arrow of Static Charge",
  "item.minecraft.tipped_arrow.effect.shock_potion": "Arrow of Static Charge",
  "item.minecraft.tipped_arrow.effect.shock_potion_long": "Arrow of Static Charge",
  "ars_nouveau.connections.fail.urn": "This block is not compatible with the urn.",
  "ars_elemental.adv.title.siren_charm": "Not a Manatee",
  "ars_elemental.adv.desc.siren_charm": "Acquire a Siren Charm",
  "ars_elemental.adv.title.firenando_charm": "They call me Firenando Mc Cannon",
  "ars_elemental.adv.desc.firenando_charm": "Acquire a Flarecannon Charm",
  "ars_elemental.adv.title.lesser_air_focus": "The way of Air",
  "ars_elemental.adv.desc.lesser_air_focus": "Acquire a lesser focus of Air",
  "ars_elemental.adv.title.air_focus": "Master of Air",
  "ars_elemental.adv.desc.air_focus": "Acquire a major focus of Air",
  "ars_elemental.adv.title.lesser_fire_focus": "The way of Fire",
  "ars_elemental.adv.desc.lesser_fire_focus": "Acquire a lesser focus of Fire",
  "ars_elemental.adv.title.fire_focus": "Master of Fire",
  "ars_elemental.adv.desc.fire_focus": "Acquire a major focus of Fire",
  "ars_elemental.adv.title.lesser_earth_focus": "The way of Earth",
  "ars_elemental.adv.desc.lesser_earth_focus": "Acquire a lesser focus of Earth",
  "ars_elemental.adv.title.earth_focus": "Master of Earth",
  "ars_elemental.adv.desc.earth_focus": "Acquire a major focus of Earth",
  "ars_elemental.adv.title.lesser_water_focus": "The way of Water",
  "ars_elemental.adv.desc.lesser_water_focus": "Acquire a lesser focus of Water",
  "ars_elemental.adv.title.water_focus": "Master of Water",
  "ars_elemental.adv.desc.water_focus": "Acquire a major focus of Water",
  "ars_elemental.adv.title.curio_bag": "Never ask a mage what's in their bag",
  "ars_elemental.adv.title.necrotic_focus": "A corrupted summoning",
  "ars_elemental.adv.desc.necrotic_focus": "Acquire a Necromancy focus",
  "ars_elemental.adv.desc.curio_bag": "Acquire a Trinkets Pouch",
  "ars_elemental.adv.title.caster_bag": "Your portable arsenal",
  "ars_elemental.adv.desc.caster_bag": "Acquire a Spellcaster Bag",
  "ars_elemental.adv.title.spore_blossom": "A Blooming Death",
  "ars_elemental.adv.desc.spore_blossom": "Obtain a Spore Blossom by killing an undead with Grow or Poison Spores",
  "ars_elemental.adv.title.mark_of_mastery": "Elemental Maestro",
  "ars_elemental.adv.desc.mark_of_mastery": "Combine the essences with the tribute and obtain the Mark of Mastery",
  "ars_elemental.adv.title.summon_dolphin": "Your personal submarine",
  "ars_elemental.adv.desc.summon_dolphin": "Summon a dolphin using Summon Steed wearing a water focus",
  "ars_elemental.adv.title.summon_strider": "It's Striding Time",
  "ars_elemental.adv.desc.summon_strider": "Summon a strider using Summon Steed wearing a fire focus",
  "ars_elemental.adv.title.summon_skeleton_horse": "The Harbinger",
  "ars_elemental.adv.desc.summon_skeleton_horse": "Summon a skeleton horse using Summon Steed wearing a necromancy focus",
  "ars_elemental.adv.title.everfull_urn": "Filled with tears of Nostalgia",
  "ars_elemental.adv.desc.everfull_urn": "Acquire an Urn of Endless Waters",
  "ars_elemental.adv.title.levitation": "It's Shulkèr, not Shulkeér",
  "ars_elemental.adv.desc.levitation": "Use Launch + Extend Time while wearing an air focus to make a mob levitate",
  "ars_elemental.adv.title.mirror_shield": "Feeling like a Prism",
  "ars_elemental.adv.desc.mirror_shield": "Reflect a spell projectile using a spell reflection shield",
  "ars_elemental.adv.title.x": "",
  "ars_elemental.adv.desc.x": ""
}
