{
	"name": "Potion Brewing",
	"category": "crafting",
	"icon": "minecraft:potion",
	"pages": [{
			"type": "spotlight",
			"item": "minecraft:potion",
			"text": "There are many a new potions that can be brewed for new effects. They will be documented on the following pages..."
		},
		{
			"type": "spotlight",
			"item": "minecraft:charcoal",
			"text": "By running a potion through charcoal, one can reverse purify it usually. Similar to how one can corrupt it's effect with a spider eye. It doesn't work with every potion, but does with a lot of them."
		},
		{
			"type": "spotlight",
			"item": "minecraft:rotten_flesh",
			"text": "By using Rotten Flesh, one can make a potion of Undead Stench. These potions allow one to walk past undead as long as they don't disturb them."
		},
		{
			"type": "spotlight",
			"item": "craftandhunt:bee_chitin",
			"text": "Bug Pheromones allows one to be in the presence of anthropods without being attacked by them. One can brew this potion with Bee Chitin, Spider Chitin, Poison Spider Chitin, or Fermented Spider Chitin."
		},
		{
			"type": "spotlight",
			"item": "craftandhunt:stray_cloth",
			"text": "By brewing stray cloth, one can make potions that increase thier damage with projectiles."
		},
		{
			"type": "spotlight",
			"item": "craftandhunt:goat_hide",
			"text": "Goat hide makes for a great potion ingredent. With it one can increase thier melee power (however not as much as a regular potion of strength) and knockback strength."
		},
		{
			"type": "spotlight",
			"item": "craftandhunt:witch_book",
			"text": "One can breakdown the magical properties in an Evokers book at the brewing stand. By drinking this potion, one can cause thier attacks to deal magical damage."
		},
		{
			"type": "spotlight",
			"item": "craftandhunt:venom_sack",
			"text": "The poison from this sack can be distilled into potions. When drank, it will cause one's attacks to inflict poison onto the target."
		},
		{
			"type": "spotlight",
			"item": "craftandhunt:wither_spine",
			"text": "Manipulation of the wither effect is dangerous. Using Wither spines, one can create a potion to cause thier attacks to inflict it apon those they strike."
		},
		{
			"type": "spotlight",
			"item": "craftandhunt:fire_heart",
			"text": "By breaking down the properties of the Ghast's Fire lung in the brewing stand, one can give them the ability to light entities on fire by punching them."
		},
		{
			"type": "spotlight",
			"item": "craftandhunt:vampire_fang",
			"text": "The Vampire's Fang has interesting properties. Being able to absorb the life of a thing one killed and heal the user. Breaking down the Fang in the brewing stand will allow one to make potions with this property."
		}
	]
}