{
  "item.hexchanting.amethyst_arrow": "Amethyst Arrow",
  "item.hexchanting.amethyst_axe": "Amethyst Axe",
  "item.hexchanting.amethyst_boots": "Amethyst Boots",
  "item.hexchanting.amethyst_chestplate": "Amethyst Chestplate",
  "item.hexchanting.amethyst_helmet": "Amethyst Helmet",
  "item.hexchanting.amethyst_hoe": "Amethyst Hoe",
  "item.hexchanting.amethyst_leggings": "Amethyst Leggings",
  "item.hexchanting.amethyst_pickaxe": "Amethyst Pickaxe",
  "item.hexchanting.amethyst_shovel": "Amethyst Shovel",
  "item.hexchanting.amethyst_sword": "Amethyst Sword",
  "hexcasting.action.hexchanting:imbue_equipment": "Imbue Equipment",

  "hexchanting.page.imbuing.title": "Imbuing Equipment",
  "hexchanting.page.imbuing.0": "I have found uses for many of Nature's resources outside of my work with _Hexes, such as the construction of tools and armaments. It follows that I am able to do the same with amethyst. If I can align the crystalline structure correctly they can even channel media to cast Hexes.",
  "hexchanting.page.imbuing.1": "After experimentation I have found that charged amethyst works best when crafting equipment. By substituting it for a material like iron or diamond I can craft items with comparable performance to their diamond equivalents, though they are less durable. Their true strength is how they interact with the world. When used they resonate with the latent media in the surrounding environment, providing a guide for hexes channeled through them.",
  "hexchanting.page.imbuing.2": "Compromises have had to be made in the creation of these tools. They must be fed with external media when casting else they will cannibalize their own materials, possibly to the point of destruction. This is similar to a $(l:items/hexcasting)$(item)Cypher/$, though these tools can be recharged.",
  "hexchanting.page.imbuing.3": "Regular use also slowly drains this reservoir - I believe the media is being expended to heal damage to the structure of the amethyst. Conventional means of equipment repair have proved ineffective due to difficulties in integrating a new matrix into the existing crystal.",
  "hexchanting.page.imbuing.tools.0": "Axes, hoes, pickaxes and shovels cast after breaking a block. The stack is initialized with the location of the broken block. Break block spells cast through these tools behave as if broken by the tool, which includes any enchantment effects.",
  "hexchanting.page.imbuing.weapons.sword": "Swords cast on hit and push the targeted entity to the stack.",
  "hexchanting.page.imbuing.weapons.arrow.1": "My attempts to craft a bow on similar principles have failed. Amethyst simply doesn't have the flexibility required. I have instead resorted to crafting arrows with amethyst shards, in place of flint. These can be imbued like my other amethyst equipment but they can only draw on their internal media and affect a limited area. I am sure I could craft an equivalent out of media alone, but there are niches where I may find this useful.",
  "hexchanting.page.imbuing.weapons.arrow": "Arrows cast when striking an entity or a block. In the first case the entity is pushed to the stack, in the latter the block position. Arrows have an amethyst shard's worth of media and a 4 block ambit radius.",
  "hexchanting.page.imbuing.armour.helmet": "Helmets casts when a mob, hostile or otherwise, begins to target me. The identity of the mob is pushed to the stack.",
  "hexchanting.page.imbuing.armour.chestplate": "Chestplates cast when I take damage. Two nullable entities and the amount of damage are pushed to the stack. The first entity is the direct source of the damage, such as an arrow, and the second is the indirect source, such as whoever fired the arrow.",
  "hexchanting.page.imbuing.armour.leggings": "Leggings cast in the unfortunate event of my death. The source of my demise is pushed to the stack, in the same form as the chestplate. Because I am no longer alive to serve as a conduit this will always use the legging's internal media.",
  "hexchanting.page.imbuing.armour.boots": "Boots cast whenever I fall about 1.5 blocks, pushing the precise distance to the stack. This trigger is sensitive and can be fooled into resetting by going up.",
  "hexchanting.page.imbue_equipment.summary.0": "Imbues the supplied hexes into the amethyst equipment in my other hand, so that they will be cast whenever the item is used. Costs 9 charged amethyst except on arrows, which cost 5 shards."
}
