{
  "name": "Amadron Tablet",
  "icon": "pneumaticcraft:amadron_tablet",
  "category": "tools",
  "advancement": "pneumaticcraft:plastic",
  "pages": [
    {
      "type": "text",
      "text": "The $(item)Amadron Tablet/$ is an item that can be used to $(thing)order/$ items and fluids for delivery by $(l:tools/drone)Drones/$.$(p)To do so, an inventory and/or fluid tank needs to be selected by $(thing)right-clicking/$ with the tablet to bind it. This inventory/tank is then used to take items as payment, and receive the items you ordered."
    },
    {
      "type": "text",
      "text": "The tablet GUI is smart enough to figure out what you can buy by looking at the bound inventory and/or tank. When you order $(ttcolor)$(t:Resources can be either items or fluids)resources/$, a $(thing)Drone/$ will spawn to collect the resources you're paying with. Once collection is complete, a second $(thing)Drone/$ will arrive to deliver the purchased items.$(p)This is a way to get items you can't get otherwise, like the $(l:components/pcb_blueprint)PCB Blueprint/$ and $(l:manufacturing/assembly_programs)Assembly Programs/$. It also adds some random $(thing)Villager Trades/$; these trades are re-shuffled daily."
    },
    {
      "type": "text",
      "title": "Player-Player Trading",
      "text": "By clicking the $(bold)Custom Player Trade/$ button (on the $(bold)Custom Trades/$ side tab) you can offer your own resources to be traded for other players' resources. In the trading GUI you can select an resource to sell on the left-hand side, and a resource you want to buy on the right-hand side. You can set the trade amounts with the text fields."
    },
    {
      "type": "text",
      "text": "You can also specify in the GUI where you want to provide the resources from, and where you want to receive payment from other players. You will need a $(l:tools/gps_tool)GPS Tool/$ (set to the right location) for this.$(p)If you don't specify custom locations here, the default locations stored in the tablet (for normal trades) will be used."
    },
    {
      "type": "text",
      "text": "When all is set, the $(bold)Add Trade/$ button will become clickable. This trade will be visible to other players in their $(item)Amadron Tablet/$ just like any normal offers.$(p)An important difference is that there is no unlimited stock: you must add your resources to the selling inventory/tank. A $(thing)Drone/$ will arrive to pick up these resources; when pick-up is complete, the stock will be increased. Stock levels for custom offers are shown in the $(item)Amadron Tablet/$ GUI."
    },
    {
      "type": "text",
      "text": "Other players can now accept the offer up to the amount that is in stock. When a player accepts an offer you'll be notified (provided you are online), and a $(thing)Drone/$ will arrive to deliver you the resources that the other player paid you with. A trade has been completed!"
    },
    {
      "type": "text",
      "text": "By $(thing)shift-clicking/$ the $(#F00)x/$ button on one of your own trades in the Amadron GUI, the trade will be removed, and Amadron will attempt to return your resources to the inventory/tank that provided it. $(p)$(bold)Warning:/$ Amadron take no responsibility for resources lost in the event of a problem returning them!"
    },
    {
      "type": "crafting",
      "text": "Creating the Amadron Tablet",
      "recipe": "pneumaticcraft:amadron_tablet"
    }
  ]
}