{
	"category": "essentials:technomancy",
	"name": "Technomancy Armor",
	"icon": "crossroads:module_goggles",
	"sortnum": 0,
	"priority": false,
	"advancement": "crossroads:progress/path/technomancy",
	"read_by_default": "true",
	"pages": [
		{
			"type": "patchouli:spotlight",
			"title": "Technomancy Armor",
			"item": "crossroads:module_goggles",
			"text": "There is an augmented armor set with special abilities. Every part of the armor set has a utility ability, is unbreakable, is enchantable, and doesn't burn in fire/lava.$(br2)The armor set provides no protection normally, but can be combined with the corresponding "
		},
		{
			"type": "patchouli:text",
			"text": "piece of netherite armor (not an ingot) in an anvil to provide netherite-tier armor protection. The enchantments of the armor itself (not the netherite armor) are kept when combining them in an anvil.$(br2)If upgraded with netherite, the armor will have durability, but won't be destroyed when it runs out of durability, and will still provide "
		},
		{
			"type": "patchouli:text",
			"text": "the utility power (but won't provide armor until repaired with netherite).$(br2)"
		},
		{
			"type": "patchouli:spotlight",
			"anchor": "goggles",
			"item": "crossroads:module_goggles",
			"text": "The <item>Modular Goggles/$ are a helpful multitool worn as a helmet. They do not have durability or provide armor.$(br2)Lenses- which provide abilities- are added to the goggles in an anvil. Each added lens increases XP cost. The four items that can be added as lenses "
		},
		{
			"type": "patchouli:text",
			"text": "are $(l:essentials:intro/ores)rubies/$, emeralds, diamonds, and $(l:essentials:fluid/ingr)pure quartz/$.$(br2)Three of these lenses are actived using keybinds, which are unbound by default. To use them, make sure to go into the keybinds menu under 'Crossroads' and bind the item control keys.$(br2)A $(l:essentials:intro/ores)ruby/$ lens will add a toggle-able fire laser that shoots anything "
		},
		{
			"type": "patchouli:text",
			"text": "you look at, setting entities on fire and starting fire. It is toggled with the 'energy control key' with an empty hand.$(br2)An emerald lens will add toggle-able night vision for the wearer. It is toggled with the 'potential control key' with an empty hand.$(br2)A diamond lens will allow opening a <item>$(l:essentials:intro/path)detailed "
		},
		{
			"type": "patchouli:text",
			"text": "<item>$(l:essentials:intro/path)crafter/$ crafting UI anywhere by pressing the 'stability control key' with an empty hand.$(br2)A $(l:essentials:fluid/ingr)pure quartz/$ lens will act as a permanent <item>$(l:essentials:intro/omnimeter)omnimeter/$ which provides full information on any machine you look at (with a large range). This is very handy to have.$(br2)"
		},
		{
			"type": "patchouli:spotlight",
			"anchor": "propeller_plate",
			"item": "crossroads:propeller_pack",
			"text": "The <item>Propelled Wingpack/$ acts like an Elytra with a built-in rocket boost. To use the boost, it needs to be wound in a <item>$(l:essentials:rotary/winding_table)Spring-Winding Stand/$.$(br2)While <em>holding/$ the boost key (default control), the wearer gets a speed boost in the direction they're looking and the "
		},
		{
			"type": "patchouli:text",
			"text": "<thing>$(l:essentials:rotary/winding_table)spring speed/$ will be slowly drained.$(br2)It can be used as an unbreakable Elytra that provides netherite-tier armor protection and doesn't need fireworks for boosting.$(br2)"
		},
		{
			"type": "patchouli:spotlight",
			"anchor": "toolbelt",
			"item": "crossroads:toolbelt",
			"text": "The <item>Toolbelt/$ protects your hotbar and offhand on death- you will respawn with your entire hotbar and offhand. The toolbelt itself still drops normally.$(br2)"
		},
		{
			"type": "patchouli:spotlight",
			"anchor": "enviro_boots",
			"item": "crossroads:enviro_boots",
			"text": "<item>All-Terrain Boots/$ combine the Soul Speed, Feather Falling, Depth Strider, and Frost Walker enchantments into one item. None of the effects will consume durability, the depth strider effect is a general speed boost when swimming instead of only applying when walking, and the feather falling effect totally "
		},
		{
			"type": "patchouli:text",
			"text": "eliminates fall damage. The frost walker effect of freezing water only applies while sneaking.$(br2)"
		},
		{
			"type": "patchouli:text",
			"text": "<bobo>iT\"S mEE! $(l:essentials:intro/welcome#bobo)bOBO/$<bobo>!!$(br2)<bobo>dEr iSS ANOHTER google LENSE! lUk thRU darkNes!/$$(br2)"
		}
	]
}