{
	"category": "essentials:intro",
	"name": "Intro to Rotary",
	"icon": "crossroads:gear_base",
	"sortnum": 2,
	"priority": true,
	"read_by_default": "true",
	"pages": [
		{
			"type": "patchouli:spotlight",
			"title": "Intro to Rotary",
			"item": "crossroads:gear_base",
			"text": "<thing>Rotary/$ is one of the basic energy systems in Crossroads, and usually the first or second one you'll use (alongside <thing>$(l:essentials:intro/heat)Heat/$) Rotary is the transfer of mechanical energy using <item>gears/$ and <item>axles/$.$(br2)Rotary can seem complicated at first when reading about it, but is actually "
		},
		{
			"type": "patchouli:text",
			"text": "pretty simple in practice.$(br2)Every gear, axle, or other spinning device has a few basic values.$(br2)The <thing>Moment of Inertia/$ is written as 'I', usually in tooltips. The I value can be thought of as the 'weight' of the gear- things with higher I values are heavier and are harder to spin quickly.$(br2)"
		},
		{
			"type": "patchouli:text",
			"text": "The <thing>Speed/$, usually written 'ω' and measured in 'rad/s' or 'radians/second' in tooltips, is how fast something is spinning. A normal speed might be 2-4rad/s, while 10rad/s is very fast. A negative speed means the gear is spinning clockwise (counter-clockwise is positive).$(br2)The <thing>Energy/$, usually written 'E' and measured in 'J' or 'Joules', "
		},
		{
			"type": "patchouli:text",
			"text": "is the total energy in a spinning object. As you'd expect, the faster somethings' speed, the more energy it has, and the higher the I, the more energy. There is actually a formula (E=Iω²/2), but it isn't useful or worth remembering.$(br2)The <thing>Power/$, measured in 'J/s' or 'Joules/second', is the rate of change of the energy of a gear. No machines "
		},
		{
			"type": "patchouli:text",
			"text": "look at the power value at all- it only exists to help show the player the change in energy.$(br2)"
		},
		{
			"type": "patchouli:text",
			"text": "Gears will also have a small amount of <thing>power loss/$ proportional to the <thing>speed/$. A system will lose <thing>energy/$ every tick- so you have to keep producing power. The amount of <thing>power loss/$ <em>does not/$ increase with the number of gears in a system. By default, a system loses -ω² J/tm where ω is the average gear <thing>speed/$. [Note: The formula, rate, and even whether it scales with number of gears might "
		},
		{
			"type": "patchouli:text",
			"text": "be changed in the config]$(br2)"
		},
		{
			"type": "patchouli:text",
			"text": "Usually, a machine will consume a certain amount of <thing>energy/$ per operation, but have a minimum <thing>speed/$ to work. Most machines will work faster at higher <thing>speeds/$.$(br2)<item>$(l:essentials:rotary/gear_base)Gears and axles/$ can be connected together to transfer energy. Placing a <item>$(l:essentials:rotary/gear_base)small gear/$ next to a <item>$(l:essentials:rotary/gear_large)large gear/$ will cause the larger gear to spin slower than the small one- as you'ld expect."
		},
		{
			"type": "patchouli:text",
			"text": ""
		},
		{
			"type": "patchouli:text",
			"text": "All networks of gears/axles/whatever <em>MUST HAVE/$ a <item>$(l:essentials:rotary/axis)Master Axis/$ connected somewhere in the network- otherwise nothing will work!$(br2)"
		}
	]
}