{
  "flag": "mod:aquaculture",
  "secret": true,
  "name": "Aquaculture Set",
  "icon": "buddycards:pack.6",
  "category": "buddycards:sets",
  "sortnum": 5,
  "pages": [
    {
      "type": "text",
      "text": "The aquaculture set of Buddycards is a set that is not hard to collect, as it is easily farmable. There are 18 cards in this set in total, but many more when you consider shiny variants and grades. $(br2)In order to get aquaculture set cards, you must go fishing for cards and packs."
    },
    {
      "type": "crafting",
      "recipe": "buddycards:aquaculture/buddycard_hook",
      "text": "In order to get aquaculture set packs, you must first make a buddycard hook or rod. $(br2)This hook can than be applied to a fishing rod using a tackle box, and gives a chance to fish up cards or packs while fishing.",
      "link_recipe": true
    },
    {
      "type": "crafting",
      "recipe": "buddycards:aquaculture/buddysteel_fishing_rod",
      "text": "The other way to get aquaculture set packs, would be using the buddysteel fishing rod. This rod will give you better odds the more cards you collect, just like other buddysteel gear.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "title": "Aquaculture Set Packs",
      "item": "buddycards:pack.6",
      "text": "Found randomly when fishing with a rod that is using a Buddycard hook. While you can fish up normal cards with the hook, the aquaculture packs are the only way to get shiny variantes.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "title": "Aquaculture Set Cards",
      "item": "buddycards:card.6.6",
      "text": "The aquaculture set packs, unlike most packs, will give you 3 cards in total, with only one of them being a shiny variant. $(br2)The cards come in four rarities: common, uncommon, rare, and epic. You can tell them apart by the colors of their corners."
    },
    {
      "type": "spotlight",
      "title": "Aquaculture Set Cards",
      "item": "buddycards:card.6.16{\"foil\":true}",
      "text": "Cards number 1-7 are common with no colored corners, cards number 8-13 are uncommon with 2 yellow corners, cards number 14-16 are rare with 4 blue corners, and cards 17 and 18 are epics with 2 yellow and 2 purple corners. Both shiny and non shiny cards have the same odds for card rarity."
    },
    {
      "type": "spotlight",
      "item": "buddycards:medal.6",
      "title": "Aquaculture Set Medal",
      "text": "The aquaculture set medal can be earned by getting all 27 cards, shiny and not shiny, of the create set. When equipped, it will give you Luck I.",
      "link_recipe": true
    },
    {
      "type": "relations",
      "title": "Medal Enchantments",
      "entries": [
        "buddycards:enchantments/buddy_binding",
        "buddycards:enchantments/buddy_boost"
      ],
      "text": "The medal can also be enchanted with Buddy Binding and Buddy Boost. Buddy Boost I will upgrade the medal to give Luck I & Dolphin Grace I, and Buddy Boost II will upgrade it to give Luck II & Dolphin Grace I."
    }
  ]
}