{
  "name": "Elemental Soil",
  "icon": "roots:elemental_soil",
  "category": "resources",
  "read_by_default": true,
  "pages": [
    {
      "type": "text",
      "text": "Elemental soil is all that is required in order to grow either of the four elemental plants: $(l:herbs/infernal_bulb)infernal bulb$(), $(l:herbs/dewgonia)dewgonia$(), $(l:herbs/stalicripe)stalicripe$() and $(l:herbs/cloud_berry)cloud berry$().$(br2)$(info) This soil can also grow almost any other crop, giving them all a growth boost.$(br2)There are also variants of elemental soil aligned with each of the four elements, with special crafting methods."
    },
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "roots:elemental_soil_air",
      "text": "Caelic soil is produced when elemental soil is thrown onto the ground above the height of $(config:air_min_y), where, after $(config:air_delay) seconds, the proximity to the sky will convert it.$(br2)$(info) It accelerates the growth of anything planted upon."
    },
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "roots:elemental_soil_earth",
      "text": "Terran soil is produced by throwing elemental soil onto the floor of an underground cave (at least below the height of $(config:earth_max_y)). After $(config:earth_delay) seconds absorbing the depths, the soil can be collected.$(br2)$(info) Terran soil is exceedingly fertile, occasionally causing plants to produce additional drops."
    },
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "roots:elemental_soil_water",
      "text": "Aqueous soil is produced by submerging elemental soil in water for at least $(config:water_delay) seconds. Once thoroughly soaked, the imbued soil can be collected.$(br2)$(info) Aqueous soil automatically harvests any plant grown on it, unless gravel is placed directly below the soil."
    },
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "roots:elemental_soil_fire",
      "text": "Magmatic soil is produced by throwing elemental soil directly into lava. The harsh flames will immediately convert the soil and return it for collection.$(br2)$(info) Magmatic soil automatically cooks a portion of the drops of all plants grown upon it, occasionally granting experience for harvesting."
    },
    {
      "type": "relations",
      "anchor": "related",
      "entries": [
        "crafting/fey_crafter",
        "herbs/infernal_bulb",
        "herbs/dewgonia",
        "herbs/cloud_berry",
        "herbs/stalicripe",
        "herbs/renewable_resources",
        "automation/aqueous_soil"
      ]
    }
  ]
}