{
  "name": "Modules",
  "icon": "modularrouters:breaker_module",
  "category": "intro",
  "pages": [
    {
      "type": "text",
      "text": "$(thing)Modules/$ are inserted into an $(l:intro/item_router)Modular Router/$ and tell the router what to do. There are 20 different module types, each of which has a specific function.  All modules have some characteristics in common, however:$(li)All modules have 9 $(thing)filter slots/$ to control which item(s) a module will process.$(li)Many modules have a defined $(thing)direction/$, relative to the router's facing."
    },
    {
      "type": "text",
      "text": "$(li)Some modules have extra settings for configuring module-specific functionality.$(p)All this can be configured in the module's GUI, which you can access by $(thing)Right-Clicking/$ the module in hand.$(p)You can also configure an installed module in a router GUI by pressing $(4)$(bold)[$(k:modularrouters.configure)]/$ while hovering over it, or $(thing)Middle-Clicking/$ the module in the GUI, without needing to remove it from the router."
    },
    {
      "type": "image",
      "images": [
        "modularrouters:textures/patchouli/module_gui.png"
      ],
      "text": "$(italic)Module GUI: see following pages for a description of each part of the GUI/$",
      "border": true
    },
    {
      "type": "text",
      "title": "1. Filter Slots",
      "anchor": "filter",
      "text": "There are nine filter slots, where you can insert ghost copies of any item or block. The module will only operate if the item in the router's $(thing)buffer/$ matches an item in the module's filter (if whitelisting; the opposite if blacklisting)."
    },
    {
      "type": "text",
      "anchor": "direction",
      "title": "2. Direction Selector",
      "text": "Most modules operate in a defined direction, relative to the router's facing. Here you can define the direction.$(p)Some modules (e.g. the $(l:modules/sender2)Sender Mk2/$) target a distant block directly, so do not have a definable direction. In this case, the direction selector will be blank."
    },
    {
      "type": "text",
      "title": "3. Filter Control",
      "text": "Here there are several buttons which control:$(li)Whitelisting vs. blacklisting$(li)Whether to match item damage (for items with durability)$(li)Whether to match item NBT, e.g. enchantments$(li)Whether to match by $(l:https://minecraft.gamepedia.com/Tag)item tags/$$(p)There is also a button here to control $(l:router/termination)Termination Behaviour/$, which is explained in a separate page."
    },
    {
      "type": "text",
      "title": "4. Augments",
      "text": "Every module has four $(thing)Augment/$ slots where augments (module-specific upgrades) can be inserted.$(p)The Augments which may be inserted here depend on the module type; not every module type accepts every augment type."
    },
    {
      "type": "text",
      "title": "5. Extra Settings",
      "text": "Some modules have some extra configuration options. For example, the $(l:modules/detector)Detector Module/$ shown earlier has options to set the redstone output level, and whether the output signal should be a weak or strong redstone signal.$(p)Where modules have such options, they're shown on the right-hand side of the GUI."
    }
  ]
}