{
  "name": "Osmosis",
  "icon": "srpcotesia:osmosis",
  "category": "osmosis_brewing",
  "pages": [
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:osmosis",
      "text": "The Osmosis is a parasitic analogue to a Brewing Stand, used by Vagrants to make Brew Sacs stronger. $(br2)$(#630000)That's about it on what the author wrote."
    },
    {
      "type": "text",
      "text": "$(#630000)The Osmosis is used to configure and add effects to Brew Sacs. It has two slots, one for the Sac and another for a reagent. Items can be inserted inside via $(k:use), the Brew Sac is generally inserted first, followed by the desired reagent."
    },
    {
      "type": "text",
      "text": "$(#630000)Items can be taken out at any point in the process via the same method used to insert them. The reagent will be taken out first if one is present, then the Sac.$(#630000)The Osmosis will begin brewing once a viable reagent and Brew Sac have been inserted."
    },
    {
      "type": "image",
      "images": ["srpcotesia:textures/book/osmosis.png"],
      "text": "$(#630000)An Osmosis with a Brew Sac and Sugar placed inside. The flames indicate it is working."
    },
    {
      "type": "text",
      "text": "$(#630000)There are generally three types of reagents:$(br)Effect Additives, which add a special effect, such as Harm, or a potion effect.$(br)Intensifiers, which increase the amplifier of applied potion effects.$(br)Or Damage Enhancers, which change a Brew Sac's base damage dealt by harming effects."
    },
    {
      "type": "text",
      "text": "$(#630000)Generally, effects are applied in the order they are added to the Sac in, so putting Harm in before Explosion will do the former before the latter. This does not apply to the other two types of reagents, which can be added at any point in the process."
    },
    {
      "type": "text",
      "text": "$(#630000)Damage Enhancers can be added at any time, for any reason. Intensifiers, however, must be added in a a specific order, starting from intensity I. This ordering can be intermingled with the addition of Effect Additives, since the two reagent types do not interfere."
    },
    {
      "type": "text",
      "text": "$(#630000)I can tell what type of reagent an item is, or what effect it will add, via simply reading its tooltip. I can also tell if, in the case of adding potion effects, whether or not the potion is applied to parasites or enemies by the text color. Green means it applies to parasites."
    },
    {
      "type": "text",
      "text": "$(#630000)There are quite a few ways to turn a Brew Sac into a potent weapon, whether it be supporting other parasites or damaging enemies severely."
    },
    {
      "type": "crafting",
      "recipe": "srpcotesia:osmosis",
      "recipe2": "srpcotesia:osmosis_alt"
    }
  ]
}