{
  "itemGroup.ars_elemental": "Ars Elemental",
  "item.ars_elemental.spell_horn": "Enchanter's Horn",
  "item.ars_elemental.fire_focus": "Focus of Fire",
  "item.ars_elemental.water_focus": "Focus of Water",
  "item.ars_elemental.air_focus": "Focus of Air",
  "item.ars_elemental.earth_focus": "Focus of Earth",
  "item.ars_elemental.lesser_fire_focus": "Lesser Focus of Fire",
  "item.ars_elemental.lesser_water_focus": "Lesser Focus of Water",
  "item.ars_elemental.lesser_air_focus": "Lesser Focus of Air",
  "item.ars_elemental.lesser_earth_focus": "Lesser Focus of Earth",
  "item.ars_elemental.necrotic_focus": "Focus of Necromancy",
  "item.ars_elemental.base_bangle": "Enchanter's Bangle",
  "item.ars_elemental.fire_bangle": "Fire Bangle",
  "item.ars_elemental.water_bangle": "Water Bangle",
  "item.ars_elemental.air_bangle": "Air Bangle",
  "item.ars_elemental.earth_bangle": "Earth Bangle",
  "item.ars_elemental.fire_caster_tome": "Caster Tome of Fire",
  "item.ars_elemental.water_caster_tome": "Caster Tome of Water",
  "item.ars_elemental.air_caster_tome": "Caster Tome of Air",
  "item.ars_elemental.earth_caster_tome": "Caster Tome of Earth",
  "item.ars_elemental.anima_caster_tome": "Caster Tome of Anima",
  "tooltip.ars_elemental.caster_tome": "Mimics the abilities of a school focus.",
  "item.ars_elemental.siren_shards": "Siren Shards",
  "item.ars_elemental.siren_charm": "Siren Charm",
  "item.ars_elemental.firenando_charm": "Flarecannon Charm",
  "item.ars_elemental.curio_bag": "Trinkets Pouch",
  "item.ars_elemental.debug": "Focus of Debug",
  "block.ars_elemental.water_upstream": "Upstream Bubble Elevator",
  "block.ars_elemental.mermaid_rock": "Siren Shrine",
  "block.ars_elemental.yellow_archwood": "Flashing Archwood Wood",
  "block.ars_elemental.yellow_archwood_log": "Flashing Archwood Log",
  "block.ars_elemental.stripped_yellow_archwood": "Stripped Flashing Archwood Wood",
  "block.ars_elemental.stripped_yellow_archwood_log": "Stripped Flashing Archwood Log",
  "block.ars_elemental.yellow_archwood_sapling": "Flashing Archwood Sapling",
  "block.ars_elemental.yellow_archwood_leaves": "Flashing Archwood Leaves",
  "block.ars_elemental.spore_blossom_up": "Spore Blossom (ground)",
  "block.ars_elemental.fire_turret": "Fire Infused Turret",
  "block.ars_elemental.water_turret": "Water Infused Turret",
  "block.ars_elemental.air_turret": "Air Infused Turret",
  "block.ars_elemental.earth_turret": "Earth Infused Turret",
  "entity.ars_elemental.summon_skelehorse": "Summoned Skeletal Steed",
  "entity.ars_elemental.summon_direwolf": "Summoned Direwolf",
  "entity.ars_elemental.summon_vhex": "Summoned Vhex",
  "entity.ars_elemental.summon_wskeleton": "Summoned Revenant",
  "entity.ars_elemental.summon_dolphin": "Summoned Dolphin",
  "entity.ars_elemental.summon_strider": "Summoned Strider",
  "entity.ars_elemental.summon_mk": "Summoned Emmekiappo",
  "entity.ars_elemental.linger_magnet": "Gravity Well",
  "entity.ars_elemental.siren_entity": "Siren",
  "entity.ars_elemental.siren_familiar": "Siren Familiar",
  "entity.ars_elemental.firenando_entity": "FlareCannon",
  "entity.ars_elemental.firenando_familiar": "FlareCannon Familiar",
  "entity.ars_elemental.fire_mage": "Rogue Fire Mage",
  "entity.ars_elemental.water_mage": "Rogue Water Mage",
  "entity.ars_elemental.air_mage": "Rogue Air Mage",
  "entity.ars_elemental.earth_mage": "Rogue Earth Mage",
  "entity.ars_elemental.flashing_weald_walker": "Flashing Weald Walker",
  "key.ars_elemental.open_pouch": "[Elemental] Open trinkets pouch",
  "curios.modifiers.an_focus": "While in spell focus slot:",
  "curios.modifiers.bangle": "While in bangle slot:",
  "curios.identifier.bundle": "Bundle",
  "curios.identifier.bangle": "Bangle",
  "effect.ars_elemental.watery_grave": "Watery Grave",
  "effect.ars_elemental.watery_grave.description": "Makes the target sink and run out of air quicker.",
  "effect.ars_elemental.hellfire": "Hellfire Burn",
  "effect.ars_elemental.hellfire.description": "The hellfire burns even nether creatures, reducing the healing power and making it vulnerable to fire.",
  "effect.ars_elemental.life_link": "Life Linked",
  "effect.ars_elemental.life_link.description": "Caster will split incoming damage with the target and the target will split incoming healing with the caster.",
  "effect.ars_elemental.enthralled": "Enthralled",
  "effect.ars_elemental.enthralled.description": "Enthralled mobs won't attack the caster but defend them.",
  "effect.ars_elemental.hymn_of_order": "Hymn of Order",
  "effect.ars_elemental.hymn_of_order.description": "Unobtainable potion, for Admin use. Sets the punished player's mana to 1 and disables spellcasting, greatly reducing their chances to create chaos in the server.",
  "enchantment.ars_elemental.mirror_shield": "Spell Reflection",
  "enchantment.ars_elemental.mirror_shield.desc": "Shield have a chance to reflect projectile spells",
  "ars_nouveau.page.elemental_tweaks": "Elemental Tweaks",
  "ars_elemental.page.elemental_tweaks": "As long as Ars Elemental is installed, these tweaks will be active:$(br)Enchanter's Shield can trigger reactive on block.$(br)Summoned Lightnings won't destroy items.$(br)Crush can process items if augmented with Sensitive.$(br)Cold Snap deals more damage to mobs that are freezing.$(br)Ignite melts ice blocks into water.",
  "ars_elemental.page1.flashing_archwood": "This golden tree have an affinity with the sky. Just like the other archwood trees it can be found anywhere with a bit of luck and it can be used to make ritual tablets. The corresponding Weald Walker launches enemies in the air and wind shear them.",
  "ars_elemental.page1.spell_horn": "The Enchanter's Horn can be used to cast Arc projectiles spells similar to a Casting Wand. An Horn always start with Arc -> Accelerate and MUST be inscribed with a spell that does not have another method, using a Scribing Table.",
  "ars_elemental.page.curio_bag": "All those trinkets can easily clutter your inventory, but you never know when they will be useful. Using some magebloom fiber you can make a pouch to store and carry around curios, potion flasks, mirrors, charms and other small items. You can also open it with $(k:ars_elemental.open_pouch) while in the hotbar or in a curio slot.",
  "ars_elemental.page1.fire_focus": "This spell focus is attuned to the school of Fire. While equipped, the glyphs of this school will be amplified and discounted. The lesser focus, as a drawback, will weaken glyphs of the other elemental schools. The major focus will also grant Mana Regen II while the wearer is on fire or in lava.",
  "ars_elemental.page2.fire_focus": "This focus empowers Ignite to inflict Hellfire Burn. This effect reduces healing and allows flare to inflict damage and spread even on fire resistant mobs. Summon Steed will be changed to Summon Strider. Ignite + Evaporate combo will sublimate Ice.",
  "ars_elemental.page1.water_focus": "This spell focus is attuned to the school of Water. While equipped, the glyphs of this school will be amplified and discounted. The lesser focus, as a drawback, will weaken glyphs of the other elemental schools. The major focus will also grant Mana Regen I while the wearer is wet or Mana Regen II and Dolphin Grace while swimming.",
  "ars_elemental.page2.water_focus": "This focus empowers Freeze, adding Freezing seconds to the target. If used after Conjure Water, the conjured water will become ice. Summon Steed will be changed to Summon Dolphin. All Drowning damage against water creature will be converted to magic.",
  "ars_elemental.page1.air_focus": "This spell focus is attuned to the school of Air. While equipped, the glyphs of this school will be amplified and discounted. The lesser focus, as a drawback, will weaken glyphs of the other elemental schools. The major focus will also grant Mana Regen I while the wearer stand over Y 200 or is falling for long time.",
  "ars_elemental.page2.air_focus": "This focus empowers Launch, changing it to apply Levitate when augmented with ExtendTime.",
  "ars_elemental.page1.earth_focus": "This spell focus is attuned to the school of Earth. While equipped, the glyphs of this school will be amplified and discounted. The lesser focus, as a drawback, will weaken glyphs of the other elemental schools. The major focus also grants Mana Regen I while the wearer stand under Y 0.",
  "ars_elemental.page2.earth_focus": "This focus empowers Poison Spores, inflicting hunger before dealing damage, Grow, dealing damage to undead with a chance of spawning a blossom, and Gravity, when augmented with Sensitive, changing it to create a gravity field that pull entities towards its center (filter-compatible), also boosts incoming healing by 1.5 and, only the major focus, knockback resistance.",
  "ars_elemental.page1.necrotic_focus": "By imbuing the Focus of Summoning with evil energies, you can corrupt its powers towards Necromancy. Glyphs of the Anima school will get two free ExtendTime, Heal gets two amplify and Charm have way more chance to affect undead mobs. Summon Steed will change in Summon Skeletal Steed, which is able to walk and breath underwater.",
  "ars_elemental.page2.necrotic_focus": "Summoned Wolves, Skeletons and Vexes seems unchanged at first, but if they die while the summoner wear this focus they will rise from death once, filled with blood lust. These undead summons will cast Homing spells when you do and heal you every time they kill an enemy.",
  "ars_elemental.page.water_upstream": "This block generates a wide upstream current that will make surrounding entities in water float upwards, works even if the water is flowing. Sneaking will ignore the current, allowing to descend.",
  "ars_elemental.page1.fire_golem": "The Flarecannon can be used as a wandering sentry, like the weald walkers. It will shoot flare homing projectiles at enemies and patrol around the area assigned using the dominion wand. Soul Sand and Magma blocks can be used to change appearance. If defeated, it can be reactivated with blaze powder or magma cream. Friends call it Firenando.",
  "ars_elemental.page1.mermaid": "Sirens are found in warm and lukewarm seas, jumping out of the water or following boats. You can befriend a wild mermaid by giving them a sea pickle, they will jump and leave behind few shards. The siren charm can be used to summon a Siren and if used on Prismarine it will transform in a Siren Shrine. Tamed sirens can change colors if you give them kelp or corals.",
  "ars_elemental.page2.mermaid": "The Shrine will slowly generate fishing loot items over time, asking for source after each cycle. The number of items and chance of getting a treasure will increase if many different water animals and plants are near the Shrine. You should build an aquarium or pond around the Shrine, to let your sirens have fun. [Note: it will take some time to update the score].",
  "ars_nouveau.page.elemental_turrets": "Elemental Infused Turrets",
  "ars_elemental.page1.elemental_turrets": "Enchanted Turrets can be imbued with the power of an elemental focus to gift them a fractions of its abilities. Spells shot by these turrets will trigger the combos of the corresponding focus and will be discounted by 65 percent if the spell contains a glyph of the matching elemental school.",
  "ars_elemental.page.base_bangle": "This magic accessory have a chance to boost the damage of your spells. Its magic is unstable but perhaps attuning it to a school can stabilize its abilities.",
  "ars_elemental.page1.air_bangle": "This bangle will boost the damage of your Air spells. Your arms sparks with the element, giving a passive boost to speed and attack knockback.",
  "ars_elemental.page1.fire_bangle": "This bangle will boost the damage of your Fire spells. Your arms are engulfed in the element, setting on fire enemies hit and granting a passive boost to speed while in hot biomes.",
  "ars_elemental.page1.earth_bangle": "This bangle will boost the damage of your Earth spells. Plants blossom on your arms, inflicting snare to enemies hit and granting the wearer immunity to cactus and berry bushes and knockback resistance.",
  "ars_elemental.page1.water_bangle": "This bangle will boost the damage of your Water spells. Your arms chills the air around, freezing enemies on every hit. It will also grant the wearer a passive boost to speed in water and rain.",
  "item.ars_nouveau.ritual_ae_squirrels": "Tablet of Fast Squirrels",
  "ars_nouveau.ritual_desc.ae_squirrels": "Gives a long speed boost to Starbuncles in the area. Refresh buff every 30 seconds in a 15 cubes radius. Radius can be augmented to 30 with a gold block",
  "item.ars_nouveau.ritual_ae_tesla_coil": "Tablet of Zapping",
  "ars_nouveau.ritual_desc.ae_tesla_coil": "Calls lightnings on entities that approach the ritual area of effect. Will target players if augmented with Air Essence. [11x7x11 cube centered on the brazier].",
  "item.ars_nouveau.ritual_ae_detection": "Tablet of Detection",
  "ars_nouveau.ritual_desc.ae_detection": "Makes all monsters in a 128 blocks radius glow for 10 minutes.",
  "ars_elemental.enchantment_desc.mirror_shield": "Can only be applied on the Enchanter's Shield. Gives a chance of reflecting spell projectile while blocking with the shield. Temporary recipe, feedbacks accepted.",
  "item.ars_nouveau.familiar_siren": "Bound Script: Siren",
  "ars_nouveau.familiar_name.siren": "Siren",
  "ars_nouveau.familiar_desc.siren": "A Siren Familiar will increase the damage of Water spells by 2. It will also give Dolphin Grace II to the summoner while in water. Obtained by performing the Ritual of Binding near a Siren.",
  "item.ars_nouveau.familiar_firenando": "Bound Script: Flarecannon",
  "ars_nouveau.familiar_name.firenando": "Flarecannon",
  "ars_nouveau.familiar_desc.firenando": "A Flarecannon Familiar increases the damage of Fire spells by 2 and reduce projectile-based spells cost by a fifth. You can feed it a Magma Cream to get a short Fire Resistance buff. Obtained by performing the Ritual of Binding near a Flarecannon.",
  "item.ars_nouveau.glyph_watery_grave": "Glyph of Watery Grave",
  "ars_nouveau.glyph_name.watery_grave": "Watery Grave",
  "ars_nouveau.glyph_desc.watery_grave": "This spell dooms a creature to drown. Reduces the target air supply and causes drowning damage when depleted. Similar to gravity the target will sunken down if in water, can be augmented with ExtendTime.",
  "item.ars_nouveau.glyph_conjure_dirt": "Glyph of Conjure Terrain",
  "ars_nouveau.glyph_name.conjure_dirt": "Conjure Terrain",
  "ars_nouveau.glyph_desc.conjure_dirt": "Places Dirt or other terrain blocks. Can be augmented with AoE and Pierce to place more blocks, Amplify to place cobblestone or one of the following combinations. If augmented with Amplify and followed by Smelt, it will place Stone. If followed by Crush it will place Sand or, if amplified, Sandstone.",
  "item.ars_nouveau.glyph_poison_spores": "Glyph of Poison Spores",
  "ars_nouveau.glyph_name.poison_spores": "Poison Spores",
  "ars_nouveau.glyph_desc.poison_spores": "A fog of poison spores erupts from the target, damaging it and causing poison and hunger to spread to nearby entities. It can only damage mobs poisoned or afflicted by hunger.",
  "item.ars_nouveau.glyph_homing_projectile": "Glyph of Homing Projectile",
  "ars_nouveau.glyph_name.homing_projectile": "Homing Projectile",
  "ars_nouveau.glyph_desc.homing_projectile": "This projectile seek the nearest entity and follow it, will behave as a classic projectile while there are no valid targets. Players will only be targeted if augmented by Sensitive.",
  "item.ars_nouveau.glyph_propagator_homing": "Glyph of Propagate Homing",
  "ars_nouveau.glyph_name.propagator_homing": "Propagate Homing",
  "ars_nouveau.glyph_desc.propagator_homing": "Convert the remainder of the spell into an Homing Projectile shoot from where the glyph resolves.",
  "item.ars_nouveau.glyph_curved_projectile": "Glyph of Arc Projectile",
  "ars_nouveau.glyph_name.curved_projectile": "Arc Projectile",
  "ars_nouveau.glyph_desc.curved_projectile": "This projectile is affected by gravity. Every Pierce applied will make it bounce one time when it hit the ground.",
  "item.ars_nouveau.glyph_propagator_arc": "Glyph of Propagate Arc",
  "ars_nouveau.glyph_name.propagator_arc": "Propagate Arc",
  "ars_nouveau.glyph_desc.propagator_arc": "Convert the remainder of the spell into an Arc Projectile shoot from where the glyph resolves.",
  "ars_nouveau.school.necromancy": "Anima",
  "item.ars_nouveau.glyph_life_link": "Glyph of Life Link",
  "ars_nouveau.glyph_name.life_link": "Life Link",
  "ars_nouveau.glyph_desc.life_link": "You create a link between your life force and the target's. Any damage dealt to you will be shared with the target and any healing of the target will be shared with you.",
  "item.ars_nouveau.glyph_charm": "Glyph of Charm",
  "ars_nouveau.glyph_name.charm": "Charm",
  "ars_nouveau.glyph_desc.charm": "Try to dominate the mind of enemy, making them fight for you as a temporary ally, a tamable mob, to tame it, or a wild animal, to make it fall in love. Each Amplify and damage dealt raises the chance of successfully charming the target, as stronger mobs will have higher resistance to your control.",
  "death.attack.hellflare": "%1$s was burned by magic flames",
  "death.attack.hellflare.item": "%1$s was burned by %2$s with the magic flames of %3$s",
  "death.attack.poison": "%2$s's poison spores blossomed inside %1$s",
  "death.attack.poison.item": "%1$s was poisoned by %2$s using %3$s"
}