{
    "type": "manual_content",
    "lang": "en_US",
    "category": "vehicles",
    "content": [
        {
            "content_type": "heading",
            "text": "Vehicles",
            "level": 1
        },
        {
            "content_type": "heading",
            "text": "Introduction",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Ancient Warfare provides a vehicles for both combat and civilian use, allowing you to destroy your rival’s castle or transport your items with great ease. \nCombat Vehicles tend to come in three variations, or a mix of the variations. These variations are Fixed, Mobile, and Turret. Fixed means the vehicle cannot be moved without repacking, and is harder to turn. Mobile means the vehicle has wheels, and can be moved about without repacking. Turret means that the vehicle’s weapon is capable of moving independently of movement, and is also easier to turn. These variations can mix, such as Fixed Turreted or Turreted Mobile, or even “Fixed” Mobile. Vehicle variations also come in four Material Levels. Each level increases the hitpoints of the vehicle, and also enables it to fire heavier ammos. \nEvery vehicle will take some amount of time to setup once placed. Once the setup is complete, the Vehicles GUI can be accessed by Shift Right-Clicking, where you can repack the vehicle and place Ammo, Armor, and Upgrades.  Most Combat Vehicles require ammunition to be loaded into them in order to fire. The Vehicle controls can be found in the Key Binding Menu, and by default the “Attack key” is the space bar."
        },
        {
            "content_type": "text",
            "text": "\n\n\n\n\n\n\n "
        },
        {
            "content_type": "heading",
            "text": "Catapults",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Catapults are the classic rock launcher, using very simply torsion mechanics. Catapults take Stone Shots, Flame Shots, Explosive Shots, Napalm Shots, Cluster Shot, and Pebble Shot as ammo. Catapults come in Fixed, Fixed Turret, Fixed Mobile, and Mobile Turret variations. Catapults can make use of Armor upgrades, and all of the various Upgrades, where applicable."
        },
        {
            "content_type": "image",
            "path": "/images/Catapult1.jpg",
            "width": 756,
            "height": 413
        },
        {
            "content_type": "heading",
            "text": "Trebuchets",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Trebuchets are marvels of engineering launching projectiles at high speeds over long distances. Trebuchets take Stone Shots, Flame Shots, Explosive Shots, Napalm Shots, Cluster Shot, and Pebble Shot as ammo. Trebuchets come in Fixed, Fixed Turret, Mobile Fixed, and Giant Trebuchet variations. All of the Armor upgrades, and the Upgrades can be used where applicable."
        },
        {
            "content_type": "image",
            "path": "/images/Trebuchet1.jpg",
            "width": 756,
            "height": 413
        },
        {
            "content_type": "heading",
            "text": "Ballistas",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Ballistas are enormous crossbows, taking the idea of the bow and making use of high torsion arms to launch huge Bolts across huge distances. Ballista come in Fixed, Fixed Turret, Fixed Mobile, and Mobile Turret variations. Ballistas take Ballista Bolts, Ballista Flame Bolts, Ballista Explosive Bolts as ammo. All of the Armor upgrades, and the Upgrades can be used where applicable. "
        },
        {
            "content_type": "image",
            "path": "/images/Ballista1.jpg",
            "width": 756,
            "height": 414
        },
        {
            "content_type": "heading",
            "text": "Battering_Rams",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Battering Ram is used to simply destroy the walls in your way by using an enormous ram to hit and break them down. These come in Fixed Mobile units, where you must move your battering ram up against the blocks you’d like to break down. You can see white bounding boxes displaying where the attack will be. The Battering Rams only come in Material Level variations."
        },
        {
            "content_type": "image",
            "path": "/images/Battering_Ram1.jpg",
            "width": 756,
            "height": 413
        },
        {
            "content_type": "heading",
            "text": "Cannons",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Cannons make use of gunpowder harvested from the mysterious Creepers, whose explosive power is greatly feared, to launch iron cannonballs at tremendous speeds. Cannons come in Fixed, Turret, Mobile Fixed variations. Cannons can make use Iron Shots, Canister Shots, and Grapeshot as ammo. All of the Armor upgrades, and the Upgrades can be used where applicable."
        },
        {
            "content_type": "image",
            "path": "/images/Cannons1.jpg",
            "width": 756,
            "height": 413
        },
        {
            "content_type": "heading",
            "text": "Hwachas",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Hwacha also makes use of gunpowder in the form of rockets. The Hwacha can rapidly launch rockets to cover a great deal of area in damage. Hwachas make use of Standard Rockets, Flame Rockets, Explosive Rockets, and Airburst Rockets as ammo. Hwachas only come in the four material levels, and are Mobile Fixed units. All of the Armor upgrades, and the Upgrades can be used where applicable."
        },
        {
            "content_type": "image",
            "path": "/images/Hwacha1.jpg",
            "width": 756,
            "height": 413
        },
        {
            "content_type": "heading",
            "text": "Carts",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Carts are massive mobile storage units, useful for moving a high volume of items from one place to another. A Cart’s storage area is accessible by shift right-clicking the vehicle, where you can see the first three rows of the storage area. Use the - and + buttons to move up and down in the storage area. There are a total of 24 rows, and 9 columns, so the Carts can hold 216 stacks of items, or 13,824 items. All of the Armor upgrades, and Speed and Turning Upgrades are applicable to Carts. Carts only come in Material Level variations, increasing their hitpoints with each level."
        },
        {
            "content_type": "image",
            "path": "/images/Cart1.jpg",
            "width": 756,
            "height": 413
        },
        {
            "content_type": "text",
            "text": "\n\n\n\n\n\n\n "
        },
        {
            "content_type": "heading",
            "text": "Boat Ballistas",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Boat Ballista is a Fixed Ballista placed on a Mobile water vehicle, enabling water based assaults. This vehicle works exactly the same as the Ballista in regards to ammo and upgrades. It comes in the Material Level Variations. "
        },
        {
            "content_type": "image",
            "path": "/images/Boat_Ballista1.jpg",
            "width": 756,
            "height": 413
        },
        {
            "content_type": "heading",
            "text": "Boat Catapults",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Boat Catapult is a Fixed Catapult placed on a Mobile water vehicle, enabling water based assaults. This vehicle works exactly the same as the Catapult in regards to ammo and upgrades. It comes in the Material Level Variations."
        },
        {
            "content_type": "image",
            "path": "/images/Boat_Catapult1.jpg",
            "width": 756,
            "height": 413
        },
        {
            "content_type": "heading",
            "text": "Boat Transports",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Boat Transport is a Cart placed on a water vehicle, enabling water based Item Transport. This vehicle works exactly the same as the Cart in regards to storage and upgrades. It comes in the Material Level Variations."
        },
        {
            "content_type": "image",
            "path": "/images/Boat_Transport1.jpg",
            "width": 756,
            "height": 413
        },
        {
            "content_type": "text",
            "text": "\n\n "
        },
        {
            "content_type": "item",
            "items": [
                {
                    "name": "ancientwarfarevehicle:armor_stone"
                },
                {
                    "name": "ancientwarfarevehicle:armor_iron"
                },
                {
                    "name": "ancientwarfarevehicle:vehicle_upgrade_speed"
                },
                {
                    "name": "ancientwarfarevehicle:vehicle_upgrade_aim"
                },
                {
                    "name": "ancientwarfarevehicle:vehicle_upgrade_reload"
                },
                {
                    "name": "ancientwarfarevehicle:vehicle_upgrade_power"
                },
                {
                    "name": "ancientwarfarevehicle:vehicle_upgrade_turret_pitch"
                },
                {
                    "name": "ancientwarfarevehicle:vehicle_upgrade_pitch_up"
                },
                {
                    "name": "ancientwarfarevehicle:vehicle_upgrade_pitch_down"
                }
            ]
        },
        {
            "content_type": "heading",
            "text": "Armor and Upgrades",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "All Vehicles can make use three tiers of Armor and various Upgrades that improve the performance of various aspects of their features. \nArmor comes in three tiers, Stone, Iron, and Obsidian, with each one increasing the amount of damage a vehicle can take before being destroyed. \nIron Bearing improve the max speed of vehicles.  \nBasic Trajectory Calculators improve the accuracy of Combat Vehicles. \nSpring Fed Reloaders decrease the time it takes to reload combat vehicles. \nPower Upgrades increase the speed at which the projecticles move. \nPitch extensions extend the Turret Rotation limits. \nTurret wedge (+3) increases turret pitch movement (up and down) by +3. \nTurret Wedge (-3) increases turret pitch movement (up and down) by +3."
        }
    ]
}
