{
  "name": "Component Pouches",
  "icon": "roots:herb_pouch",
  "category": "spells",
  "priority": true,
  "sortnum": 4,
  "pages": [
    {
      "type": "text",
      "text": "$(l:spells/introduction)Spell-casting$() with a $(l:crafting/staff)staff$() generally comes at a cost: that of $(cat:herbs)herbs$().$(br2)These herbs cannot be directly consumed from your inventory. Instead, they must be stored in a component pouch.$(br2)There are a variety of pouches, some of which only hold herbs, although others can also store additional items."
    },
    {
      "type": "text",
      "title": "Casting & Dying",
      "text": "$(info) When casting a spell, all of the pouches in your inventory will be searched for the relevant herbs.$(br2)$(info) In addition to the different types of pouches, each pouch can be dyed by combining it with a dye in a crafting table.$(br2)This allows you to easily differentiate between pouches of the same type."
    },
    {
      "type": "spotlight",
      "item": "roots:herb_pouch",
      "text": "The $(l:crafting/herb_pouch)herb pouch$() is the simplest of the pouches, containing 9 slots which only hold herbs."
    },
    {
      "type": "spotlight",
      "item": "roots:component_pouch",
      "text": "A more advanced container, the $(l:crafting/component_pouch)component pouch$() not only holds 6 herb slots, but it has an additional 12 slots that can contain any item."
    },
    {
      "type": "spotlight",
      "item": "roots:apothecary_pouch",
      "text": "Combining the 9 slots of the herb pouch with an additional 18 slots for non-herb items, the $(l:crafting/apothecary_pouch)apothecary pouch$() provides significant utility."
    },
    {
      "type": "spotlight",
      "item": "roots:fey_pouch",
      "text": "Inversely to the apothecary pouch, the $(l:crafting/fey_leather_pouch)fey leather pouch$() contains 12 slots for herbs (more than enough for one of every herb), with a smaller compartment that holds up to 6 non-herb items."
    },
    {
      "type": "text",
      "title": "Additional Features",
      "text": "With the Baubles mod installed, it is possible to equip the pouch on your belt.$(br2)By pressing the $(k:roots.keybinds.pouch) key allows you to open either the pouch contained within your belt Baubles slot (if installed), or otherwise the first pouch in your inventory.$(br2)With the $(bold)Auto-Refill Pouches$() configuration option enabled, any time you pick up a herb that is already"
    },
    {
      "type": "text",
      "text": "contained in one of your pouches, it will attempt to fill that slot before putting it into your inventory.$(br2)The keybind is also visible in the tooltip of the pouch. Likewise, if the auto-refill option is enabled, additional text will explain this function and that it can be disabled in the config."
    },
    {
      "type": "relations",
      "anchor": "related",
      "entries": [
        "crafting/apothecary_pouch",
        "crafting/component_pouch",
        "crafting/fey_leather_pouch",
        "crafting/herb_pouch"
      ]
    }
  ]
}