{
  "name": "Introduction to Spells",
  "icon": "minecraft:writable_book",
  "category": "spells",
  "priority": true,
  "sortnum": 1,
  "pages": [
    {
      "type": "text",
      "text": "The creation and management of spells is a complicated system to understand, and divided into multiple chapters.$(li)This chapter covers basic concepts, including imbuing.$(li)$(l:spells/introduction2)The mechanics of imposing modifiers$()$(li)$(l:spells/modifiers)The functional uses of modifiers and spells$()$(li)$(l:spells/library)The mechanics of the spell library and its uses$()."
    },
    {
      "type": "text",
      "text": "Spells are, like $(l:rituals/introduction)rituals$(), a way of unleashing the wild energy contained within herbs, harnessing it to effect change in the world around you.$(br2)Unlike rituals, spells merely require that you carry with you a $(l:crafting/staff)staff$() and $(l:spells/component_pouches)any component pouch$().$(br2)$(warning) However, like rituals, certain steps must be completed before you can begin"
    },
    {
      "type": "text",
      "text": "casting spells, including the gathering of certain ingredients, crushing them into spell dust, and imbuing them into $(l:spells/library)your spell library$().$(br2)$(info) Thus, you will also require a $(l:crafting/mortar_and_pestle)mortar & pestle$(), $(l:crafting/imbuer)imbuer$() and finally a $(l:crafting/gramary)gramary$(), which acts as a personal link to your spell library.$(br2)The modification of spells using modifiers will be covered in more detail in a separate entry, $(l:spells/introduction2)Introduction to Modifiers$()."
    },
    {
      "type": "crafting",
      "title": "Staffs",
      "recipe": "roots:staff",
      "text": "The primary implement for casting spells is the staff. Simple to craft, it contains five slots, and each of these slots can contain a spell (including multiples of the same spell), each with its own modifiers."
    },
    {
      "type": "text",
      "text": "$(info) Full information for manipulating staffs and spell slots $(l:crafting/staff)can be found on the page dedicated to the staff$().$(br2)Once a spell has been imbued into your library, you can hold a staff and press '$(k:roots.keybinds.spell_library)' to bring up your $(l:spells/library)spell library$().$(br2)$(info) Instructions on using the spell library can be found in the $(l:spells/library)spell library$() entry.$(br2)Although spells may be changed at any time, you may need to re-enable modifiers afterwards."
    },
    {
      "type": "crafting",
      "title": "Components",
      "recipe": "roots:herb_pouch",
      "text": "While staffs contain spells, you must also provide the herbs to power it through means of a $(l:spells/component_pouches)component pouch$().$(br2)There are a variety of options of various sizes. The one shown is the easiest to make, containing 9 slots."
    },
    {
      "type": "text",
      "text": "While explained in further detail in the $(l:spells/component_pouches)entry on the various component pouches$(), a simple explanation now follows:$(br2)$(li)Herbs placed into a pouch slot are consumed to power spells.$(li)$(info) As most spells do not require a complete item, the remainder is not lost but stored within the lining of the pouch itself.$(li)The quantity of a specific herb remaining will be displayed in the bottom-left of the screen after consuming herb, as a decimal value."
    },
    {
      "type": "text",
      "title": "Spell Costs",
      "text": "The costs of spells is displayed as a decimal value with three points of precision, such as: Wildroot x0.250.$(br2)$(info) They are applied whenever a spell is directly cast or, in the case of spells that are channeled, a portion of the cost is applied for every tick that the spell is channeled.$(br2)The cost of spells may consist of one or more herbs, and these costs may contain"
    },
    {
      "type": "text",
      "text": "additional herbs and multipliers when modifiers have been applied.$(br2)As mentioned, your herb totals are displayed in the bottom-left of the screen whenever herbs are removed from your pouch.$(br2)"
    },
    {
      "type": "text",
      "title": "Spell Dusts",
      "text": "Spell dust is created by combining the ingredients listed in the relevant entry in a $(l:crafting/mortar_and_pestle)mortar$() and grinding them with the pestle.$(br2)This spell dust contains the raw information needed by your $(l:spells/library)spell library$(), and it can be imbued into your library with a $(l:crafting/gramary)gramary$().$(br2)$(warning) It is not possible to imbue spell dust directly into your staff."
    },
    {
      "type": "text",
      "title": "Imbuing",
      "anchor": "imbuing",
      "text": "The process of energizing spell dust and channeling it into your $(l:spells/library)library$() involves both an $(l:crafting/imbuer)imbuer$() and a $(l:crafting/gramary)gramary$().$(br2)This process can be performed by placing the gramary and the spell dust on the imbuer.  A message will appear informing you of the spell that has been added to your library.$(br2)$(info) Additional uses of the imbuer beyond spells are explained in the $(l:crafting/imbuer)imbuer entry$()."
    },
    {
      "type": "text",
      "text": "$(info) Once the spell is imbued, it will be accessible in your $(l:spells/library)spell library$(), and you can immediately use the interface to add it to your staff.$(br2)$(info) Unlike other uses of the $(l:crafting/imbuer)imbuer$(), the gramary will remain inside it once the process is complete. You may remove it by simply right-clicking the imbuer."
    },
    {
      "type": "relations",
      "anchor": "related",
      "entries": [
        "spells/introduction2",
        "spells/library",
        "spells/modifiers",
        "crafting/gramary",
        "crafting/staff",
        "crafting/imbuer"
      ]
    }
  ]
}