{
  "name": "Modifiers",
  "icon": "roots:imbuer",
  "category": "spells",
  "priority": true,
  "sortnum": 5,
  "pages": [
    {
      "type": "text",
      "text": "The creation and management of spells is a complicated system to understand, and divided into multiple chapters.$(li)$(l:spells/introduction)The first introduction basic concepts, including imbuing.$()$(li)$(l:spells/introduction2)The second introduction covers the mechanics of imposing modifiers$()$(li)This entry covers the functional uses of modifiers and spells$()$(li)$(l:spells/library)The mechanics of the spell library and its uses$()."
    },
    {
      "type": "text",
      "text": "Once a modifier is applied to a spell, it is accessible to your library and all staves that contain the spell. You can use the $(l:crafting/imposer)imposer$() or $(l:spells/library)spell library$() to enable or disable modifiers.$(br2)A modifier adds a cost of the modifying herb, although some additionally increase or decrease the overall spell cost.$(br2)Enabled modifier costs stack, making it possible for spells to become quite expensive."
    },
    {
      "type": "text",
      "title": "Conflicts",
      "text": "$(warning) Not all modifiers can be used together.$(br2)When enabling a modifier, the highlight colour of other modifiers may change to purple.$(br2)This indicates that these modifiers are in conflict, and you cannot enable them.$(br2)$(info) These cannot be enabled until the conflicting modifier is disabled."
    },
    {
      "type": "text",
      "text": "The tooltip of conflicting modifiers will specify which modifier is causing the conflict.$(br2)$(info) As a shortcut, you can hold [Alt] while clicking on a modifier to enable it, disabling any modifiers which conflict.$(br2)Otherwise, you are free to combine modifiers as you see fit, so long as you provide the necessary herbs."
    },
    {
      "type": "relations",
      "anchor": "related",
      "entries": [
        "spells/introduction",
        "spells/introduction2",
        "spells/library",
        "crafting/staff",
        "crafting/gramary",
        "crafting/imposer"
      ]
    }
  ]
}