{
  "name": "Grading Sleeve",
  "icon": "buddycards:grading_sleeve",
  "category": "buddycards:items",
  "sortnum": 4,
  "pages": [
    {
      "type": "text",
      "text": "Grading Sleeves are not for the casual Buddycard collector. You have been warned. $(br2)Grading Sleeves allow you to grade cards by holding it in your offhand with an ungraded card in your main hand. It will get 1 of 5 grades."
    },
    {
      "type": "crafting",
      "recipe": "buddycards:grading_sleeve",
      "text": "Grading sleeves are relatively cheap, but can also be found naturally in villages, bastions, end cities, shipwrecks, and buried treasures."
    },
    {
      "type": "spotlight",
      "title": "Grade D",
      "item": "buddycards:card.1.1{\"grade\":1}",
      "text": "Grade D is the most common grade to get when you grade a card. $(br2)These cards are below average quality, and extremely common. Roughly 2/5 cards are grade D."
    },
    {
      "type": "spotlight",
      "title": "Grade C",
      "item": "buddycards:card.1.1{\"grade\":2}",
      "text": "Grade C is the second most common grade to get when you grade a card. $(br2)These cards are average quality, and are quite common. Roughly 8/25 cards are grade C."
    },
    {
      "type": "spotlight",
      "title": "Grade B",
      "item": "buddycards:card.1.1{\"grade\":3}",
      "text": "Grade B is one of the more obtainable high quality card grades. $(br2)These cards are above average quality, but not too hard to find. Roughly 9/50 cards are grade B."
    },
    {
      "type": "spotlight",
      "title": "Grade A",
      "item": "buddycards:card.1.1{\"grade\":4}",
      "text": "Grade A is a reasonable high quality card to be proud of. $(br2)These cards are almost perfect in quality, and quite hard to find. Roughly 1/10 cards are grade A."
    },
    {
      "type": "spotlight",
      "title": "Grade S",
      "item": "buddycards:card.1.1{\"grade\":5}",
      "text": "Grade S is the most valuable card grade you can find. Getting one is something to be proud of, and compared to other cards they are priceless. $(br2)These cards are mint condition, perfect quality, and nearly impossible to find with 1/500 cards being this perfect."
    }
  ]
}