{
  "name": "Security Upgrade",
  "category": "upgrades",
  "icon": "modularrouters:security_upgrade",
  "pages": [
    {
      "type": "text",
      "text": "The $(thing)Security Upgrade/$ has several important functions, detailed in the following pages."
    },
    {
      "type": "text",
      "title": "Protection",
      "text": "A Router with a Security Upgrade installed can $(italic)only/$ be opened by players whitelisted by that upgrade. The upgrade doesn't prevent a router being broken; but since upgrades and modules remain in a broken router, players can't break a router to steal modules/upgrades or reconfigure the router. If you want to prevent a router being broken, you may wish to explore other mods' block protection capabilities."
    },
    {
      "type": "text",
      "title": "Fake Players",
      "text": "Several modules ($(l:modules/placer)Placer/$, $(l:modules/breaker)Breaker/$, $(l:modules/activator)Activator/$) do their work as a $(thing)fake player/$. By default this is a player with the username $(thing)[Modular Routers]/$, but when a security upgrade is installed, those modules operate as the upgrade's owner. This is much safer on multiplayer servers with claim protection than simply allowing $(thing)[Modular Routers]/$ to do anything with your claims."
    },
    {
      "type": "text",
      "title": "Activator Attack Mode",
      "text": "When the $(l:modules/activator)Activator Module/$ is in $(thing)Attack Mode/$, it will ignore any players whitelisted by a Security Upgrade installed in the Router. This is generally a good idea to avoid pain & suffering if you have a high-damage weapon in your Router..."
    },
    {
      "type": "spotlight",
      "item": "modularrouters:override_card",
      "anchor": "override",
      "text": "$(li)There is a non-craftable item called the $(thing)Security Override Card/$ - this can be obtained in creative mode or by cheating the item in via JEI etc. A player who holds one of these in either hand is not affected by any Security Upgrade, and can access any router."
    },
    {
      "type": "text",
      "text": "You can add extra players to a Security Upgrade by $(thing)right-clicking/$ the player with the upgrade in your main hand.$(p)You can remove players from a Security Upgrade by $(thing)sneak-right-clicking/$ the player.$(p)There is a maximum of 6 additional players per Security Upgrade (so 7 in total, including the creator), but you can install more than one Security Upgrade in a router if necessary."
    },
    {
      "type": "crafting",
      "recipe": "modularrouters:security_upgrade"
    }
  ]
}
