{
  "name": "Specialty Items",
  "icon": "buddycards:luminis_medal",
  "category": "buddycards:luminis",
  "sortnum": 3,
  "pages": [
    {
      "type": "text",
      "text": "Deep luminis tends to crystalize into odd shapes under a lot of stress. Nobody really knows why this happens, but it's quite an interesting natural phenomenon. The more blocks of deep luminis you put together, the better your odds tend to be to get lucky. Sometimes it might even turn into normal luminis."
    },
    {
      "type": "spotlight",
      "item": "buddycards:luminis_band",
      "text": "The Luminis Rings are very useful for finding deep luminis, and will increase your odds of succesfully finding some when worn.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "item": "buddycards:luminis_pickaxe",
      "text": "The Luminis pickaxe is quite a rare find. They seem to work similarly to a perfect buddysteel pickaxe and will upgrade with your collection, and will also work with the same enchantments. It seems to increase your odds of finding deep luminis as well.",
      "link_recipe": true
    },
    {
      "type": "relations",
      "title": "Related Pages",
      "entries": [
        "buddycards:buddysteel/perfect_buddysteel_gear",
        "buddycards:enchantments/buddy_binding"
      ],
      "text": "We don't quite know how the luminis pickaxe is made, but they work with Buddy Binding and are very similar to Perfect Buddysteel"
    },
    {
      "type": "spotlight",
      "item": "buddycards:luminis_medal",
      "text": "The Luminis Medal is quite a neat trinket, and will boost the odds of getting deep luminis, as well as adding a chance to find a random card when mining luminis. Granted, this is very rare, and only works when you have all 3 specialty items.",
      "link_recipe": true
    },
    {
      "type": "relations",
      "title": "Medal Enchantments",
      "entries": [
        "buddycards:enchantments/buddy_binding",
        "buddycards:enchantments/buddy_boost"
      ],
      "text": "The medal can also be enchanted with Buddy Binding and Buddy Boost. Buddy Boost I will give you Grading Luck I and Buddy Boost II will give you Grading Luck II."
    }
  ]
}