{
  "entity.georenouveau.geore_golem": "GeOre Golem",
  "georenouveau.gui.jei.category.conversion": "GeOre Golem Conversion",
  "georenouveau.gui.jei.category.conversion.required": "Only a %s GeOre Golem can perform this conversion.",
  "item.georenouveau.allthemodium_geore_dowsing_rod": "Allthemodium GeOre Dowsing Rod",
  "item.georenouveau.allthemodium_geore_golem_charm": "Allthemodium GeOre Golem Charm",
  "item.georenouveau.aluminum_geore_dowsing_rod": "Aluminum GeOre Dowsing Rod",
  "item.georenouveau.aluminum_geore_golem_charm": "Aluminum GeOre Golem Charm",
  "item.georenouveau.ancient_debris_geore_dowsing_rod": "Ancient Debris GeOre Dowsing Rod",
  "item.georenouveau.ancient_debris_geore_golem_charm": "Ancient Debris GeOre Golem Charm",
  "item.georenouveau.black_quartz_geore_dowsing_rod": "Black Quartz GeOre Dowsing Rod",
  "item.georenouveau.black_quartz_geore_golem_charm": "Black Quartz GeOre Golem Charm",
  "item.georenouveau.coal_geore_dowsing_rod": "Coal GeOre Dowsing Rod",
  "item.georenouveau.coal_geore_golem_charm": "Coal GeOre Golem Charm",
  "item.georenouveau.copper_geore_dowsing_rod": "Copper GeOre Dowsing Rod",
  "item.georenouveau.copper_geore_golem_charm": "Copper GeOre Golem Charm",
  "item.georenouveau.diamond_geore_dowsing_rod": "Diamond GeOre Dowsing Rod",
  "item.georenouveau.diamond_geore_golem_charm": "Diamond GeOre Golem Charm",
  "item.georenouveau.emerald_geore_dowsing_rod": "Emerald GeOre Dowsing Rod",
  "item.georenouveau.emerald_geore_golem_charm": "Emerald GeOre Golem Charm",
  "item.georenouveau.gold_geore_dowsing_rod": "Gold GeOre Dowsing Rod",
  "item.georenouveau.gold_geore_golem_charm": "Gold GeOre Golem Charm",
  "item.georenouveau.iron_geore_dowsing_rod": "Iron GeOre Dowsing Rod",
  "item.georenouveau.iron_geore_golem_charm": "Iron GeOre Golem Charm",
  "item.georenouveau.lapis_geore_dowsing_rod": "Lapis GeOre Dowsing Rod",
  "item.georenouveau.lapis_geore_golem_charm": "Lapis GeOre Golem Charm",
  "item.georenouveau.lead_geore_dowsing_rod": "Lead GeOre Dowsing Rod",
  "item.georenouveau.lead_geore_golem_charm": "Lead GeOre Golem Charm",
  "item.georenouveau.monazite_geore_dowsing_rod": "Monazite GeOre Dowsing Rod",
  "item.georenouveau.monazite_geore_golem_charm": "Monazite GeOre Golem Charm",
  "item.georenouveau.nickel_geore_dowsing_rod": "Nickel GeOre Dowsing Rod",
  "item.georenouveau.nickel_geore_golem_charm": "Nickel GeOre Golem Charm",
  "item.georenouveau.osmium_geore_dowsing_rod": "Osmium GeOre Dowsing Rod",
  "item.georenouveau.osmium_geore_golem_charm": "Osmium GeOre Golem Charm",
  "item.georenouveau.platinum_geore_dowsing_rod": "Platinum GeOre Dowsing Rod",
  "item.georenouveau.platinum_geore_golem_charm": "Platinum GeOre Golem Charm",
  "item.georenouveau.quartz_geore_dowsing_rod": "Quartz GeOre Dowsing Rod",
  "item.georenouveau.quartz_geore_golem_charm": "Quartz GeOre Golem Charm",
  "item.georenouveau.redstone_geore_dowsing_rod": "Redstone GeOre Dowsing Rod",
  "item.georenouveau.redstone_geore_golem_charm": "Redstone GeOre Golem Charm",
  "item.georenouveau.ruby_geore_dowsing_rod": "Ruby GeOre Dowsing Rod",
  "item.georenouveau.ruby_geore_golem_charm": "Ruby GeOre Golem Charm",
  "item.georenouveau.sapphire_geore_dowsing_rod": "Sapphire GeOre Dowsing Rod",
  "item.georenouveau.sapphire_geore_golem_charm": "Sapphire GeOre Golem Charm",
  "item.georenouveau.silver_geore_dowsing_rod": "Silver GeOre Dowsing Rod",
  "item.georenouveau.silver_geore_golem_charm": "Silver GeOre Golem Charm",
  "item.georenouveau.tin_geore_dowsing_rod": "Tin GeOre Dowsing Rod",
  "item.georenouveau.tin_geore_golem_charm": "Tin GeOre Golem Charm",
  "item.georenouveau.topaz_geore_dowsing_rod": "Topaz GeOre Dowsing Rod",
  "item.georenouveau.topaz_geore_golem_charm": "Topaz GeOre Golem Charm",
  "item.georenouveau.tungsten_geore_dowsing_rod": "Tungsten GeOre Dowsing Rod",
  "item.georenouveau.tungsten_geore_golem_charm": "Tungsten GeOre Golem Charm",
  "item.georenouveau.unobtainium_geore_dowsing_rod": "Unobtainium GeOre Dowsing Rod",
  "item.georenouveau.unobtainium_geore_golem_charm": "Unobtainium GeOre Golem Charm",
  "item.georenouveau.uraninite_geore_dowsing_rod": "Uraninite GeOre Dowsing Rod",
  "item.georenouveau.uraninite_geore_golem_charm": "Uraninite GeOre Golem Charm",
  "item.georenouveau.uranium_geore_dowsing_rod": "Uranium GeOre Dowsing Rod",
  "item.georenouveau.uranium_geore_golem_charm": "Uranium GeOre Golem Charm",
  "item.georenouveau.vibranium_geore_dowsing_rod": "Vibranium GeOre Dowsing Rod",
  "item.georenouveau.vibranium_geore_golem_charm": "Vibranium GeOre Golem Charm",
  "item.georenouveau.zinc_geore_dowsing_rod": "Zinc GeOre Dowsing Rod",
  "item.georenouveau.zinc_geore_golem_charm": "Zinc GeOre Golem Charm",
  "tooltip.geore_nouveau.allthemodium_charm": "Obtained by performing the Ritual of Awakening near Budding Allthemodium GeOre",
  "tooltip.geore_nouveau.allthemodium_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Allthemodium GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.aluminum_charm": "Obtained by performing the Ritual of Awakening near Budding Aluminum GeOre",
  "tooltip.geore_nouveau.aluminum_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Aluminum GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.ancient_debris_charm": "Obtained by performing the Ritual of Awakening near Budding Ancient Debris GeOre",
  "tooltip.geore_nouveau.ancient_debris_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Ancient Debris GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.black_quartz_charm": "Obtained by performing the Ritual of Awakening near Budding Black Quartz GeOre",
  "tooltip.geore_nouveau.black_quartz_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Black Quartz GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.coal_charm": "Obtained by performing the Ritual of Awakening near Budding Coal GeOre",
  "tooltip.geore_nouveau.coal_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Coal GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.copper_charm": "Obtained by performing the Ritual of Awakening near Budding Copper GeOre",
  "tooltip.geore_nouveau.copper_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Copper GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.diamond_charm": "Obtained by performing the Ritual of Awakening near Budding Diamond GeOre",
  "tooltip.geore_nouveau.diamond_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Diamond GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.emerald_charm": "Obtained by performing the Ritual of Awakening near Budding Emerald GeOre",
  "tooltip.geore_nouveau.emerald_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Emerald GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.gold_charm": "Obtained by performing the Ritual of Awakening near Budding Gold GeOre",
  "tooltip.geore_nouveau.gold_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Gold GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.iron_charm": "Obtained by performing the Ritual of Awakening near Budding Iron GeOre",
  "tooltip.geore_nouveau.iron_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Iron GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.lapis_charm": "Obtained by performing the Ritual of Awakening near Budding Lapis GeOre",
  "tooltip.geore_nouveau.lapis_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Lapis GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.lead_charm": "Obtained by performing the Ritual of Awakening near Budding Lead GeOre",
  "tooltip.geore_nouveau.lead_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Lead GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.monazite_charm": "Obtained by performing the Ritual of Awakening near Budding Monazite GeOre",
  "tooltip.geore_nouveau.monazite_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Monazite GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.nickel_charm": "Obtained by performing the Ritual of Awakening near Budding Nickel GeOre",
  "tooltip.geore_nouveau.nickel_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Nickel GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.osmium_charm": "Obtained by performing the Ritual of Awakening near Budding Osmium GeOre",
  "tooltip.geore_nouveau.osmium_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Osmium GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.platinum_charm": "Obtained by performing the Ritual of Awakening near Budding Platinum GeOre",
  "tooltip.geore_nouveau.platinum_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Platinum GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.quartz_charm": "Obtained by performing the Ritual of Awakening near Budding Quartz GeOre",
  "tooltip.geore_nouveau.quartz_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Quartz GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.redstone_charm": "Obtained by performing the Ritual of Awakening near Budding Redstone GeOre",
  "tooltip.geore_nouveau.redstone_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Redstone GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.ruby_charm": "Obtained by performing the Ritual of Awakening near Budding Ruby GeOre",
  "tooltip.geore_nouveau.ruby_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Ruby GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.sapphire_charm": "Obtained by performing the Ritual of Awakening near Budding Sapphire GeOre",
  "tooltip.geore_nouveau.sapphire_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Sapphire GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.silver_charm": "Obtained by performing the Ritual of Awakening near Budding Silver GeOre",
  "tooltip.geore_nouveau.silver_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Silver GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.tin_charm": "Obtained by performing the Ritual of Awakening near Budding Tin GeOre",
  "tooltip.geore_nouveau.tin_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Tin GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.topaz_charm": "Obtained by performing the Ritual of Awakening near Budding Topaz GeOre",
  "tooltip.geore_nouveau.topaz_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Topaz GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.tungsten_charm": "Obtained by performing the Ritual of Awakening near Budding Tungsten GeOre",
  "tooltip.geore_nouveau.tungsten_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Tungsten GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.unobtainium_charm": "Obtained by performing the Ritual of Awakening near Budding Unobtainium GeOre",
  "tooltip.geore_nouveau.unobtainium_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Unobtainium GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.uraninite_charm": "Obtained by performing the Ritual of Awakening near Budding Uraninite GeOre",
  "tooltip.geore_nouveau.uraninite_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Uraninite GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.uranium_charm": "Obtained by performing the Ritual of Awakening near Budding Uranium GeOre",
  "tooltip.geore_nouveau.uranium_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Uranium GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.vibranium_charm": "Obtained by performing the Ritual of Awakening near Budding Vibranium GeOre",
  "tooltip.geore_nouveau.vibranium_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Vibranium GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.zinc_charm": "Obtained by performing the Ritual of Awakening near Budding Zinc GeOre",
  "tooltip.geore_nouveau.zinc_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Zinc GeOre to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals."
}