{
  "entity.georenouveau.geore_golem": "GeOre Golem",
  "item.georenouveau.coal_geore_dowsing_rod": "Coal GeOre Dowsing Rod",
  "item.georenouveau.coal_geore_golem_charm": "Coal GeOre Golem Charm",
  "item.georenouveau.copper_geore_dowsing_rod": "Copper GeOre Dowsing Rod",
  "item.georenouveau.copper_geore_golem_charm": "Copper GeOre Golem Charm",
  "item.georenouveau.diamond_geore_dowsing_rod": "Diamond GeOre Dowsing Rod",
  "item.georenouveau.diamond_geore_golem_charm": "Diamond GeOre Golem Charm",
  "item.georenouveau.emerald_geore_dowsing_rod": "Emerald GeOre Dowsing Rod",
  "item.georenouveau.emerald_geore_golem_charm": "Emerald GeOre Golem Charm",
  "item.georenouveau.gold_geore_dowsing_rod": "Gold GeOre Dowsing Rod",
  "item.georenouveau.gold_geore_golem_charm": "Gold GeOre Golem Charm",
  "item.georenouveau.iron_geore_dowsing_rod": "Iron GeOre Dowsing Rod",
  "item.georenouveau.iron_geore_golem_charm": "Iron GeOre Golem Charm",
  "item.georenouveau.lapis_geore_dowsing_rod": "Lapis GeOre Dowsing Rod",
  "item.georenouveau.lapis_geore_golem_charm": "Lapis GeOre Golem Charm",
  "item.georenouveau.quartz_geore_dowsing_rod": "Quartz GeOre Dowsing Rod",
  "item.georenouveau.quartz_geore_golem_charm": "Quartz GeOre Golem Charm",
  "item.georenouveau.redstone_geore_dowsing_rod": "Redstone GeOre Dowsing Rod",
  "item.georenouveau.redstone_geore_golem_charm": "Redstone GeOre Golem Charm",
  "item.georenouveau.ruby_geore_dowsing_rod": "Ruby GeOre Dowsing Rod",
  "item.georenouveau.ruby_geore_golem_charm": "Ruby GeOre Golem Charm",
  "item.georenouveau.sapphire_geore_dowsing_rod": "Sapphire GeOre Dowsing Rod",
  "item.georenouveau.sapphire_geore_golem_charm": "Sapphire GeOre Golem Charm",
  "item.georenouveau.topaz_geore_dowsing_rod": "Topaz GeOre Dowsing Rod",
  "item.georenouveau.topaz_geore_golem_charm": "Topaz GeOre Golem Charm",
  "item.georenouveau.zinc_geore_dowsing_rod": "Zinc GeOre Dowsing Rod",
  "item.georenouveau.zinc_geore_golem_charm": "Zinc GeOre Golem Charm",
  "tooltip.geore_nouveau.coal_charm": "Obtained by performing the Ritual of Awakening near Budding Coal Geore",
  "tooltip.geore_nouveau.coal_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Coal Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.copper_charm": "Obtained by performing the Ritual of Awakening near Budding Copper Geore",
  "tooltip.geore_nouveau.copper_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Copper Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.diamond_charm": "Obtained by performing the Ritual of Awakening near Budding Diamond Geore",
  "tooltip.geore_nouveau.diamond_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Diamond Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.emerald_charm": "Obtained by performing the Ritual of Awakening near Budding Emerald Geore",
  "tooltip.geore_nouveau.emerald_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Emerald Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.gold_charm": "Obtained by performing the Ritual of Awakening near Budding Gold Geore",
  "tooltip.geore_nouveau.gold_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Gold Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.iron_charm": "Obtained by performing the Ritual of Awakening near Budding Iron Geore",
  "tooltip.geore_nouveau.iron_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Iron Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.lapis_charm": "Obtained by performing the Ritual of Awakening near Budding Lapis Geore",
  "tooltip.geore_nouveau.lapis_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Lapis Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.quartz_charm": "Obtained by performing the Ritual of Awakening near Budding Quartz Geore",
  "tooltip.geore_nouveau.quartz_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Quartz Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.redstone_charm": "Obtained by performing the Ritual of Awakening near Budding Redstone Geore",
  "tooltip.geore_nouveau.redstone_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Redstone Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.ruby_charm": "Obtained by performing the Ritual of Awakening near Budding Ruby Geore",
  "tooltip.geore_nouveau.ruby_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Ruby Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.sapphire_charm": "Obtained by performing the Ritual of Awakening near Budding Sapphire Geore",
  "tooltip.geore_nouveau.sapphire_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Sapphire Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.topaz_charm": "Obtained by performing the Ritual of Awakening near Budding Topaz Geore",
  "tooltip.geore_nouveau.topaz_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Topaz Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals.",
  "tooltip.geore_nouveau.zinc_charm": "Obtained by performing the Ritual of Awakening near Budding Zinc Geore",
  "tooltip.geore_nouveau.zinc_dowsing_rod": "Grants Magic Find and Scrying on use, causing magical creatures to glow and Zinc Geore to be revealed through blocks. Can be used on Imbuement Chamber and Enchanting Apparatus to highlight linked pedestals."
}