{
  "guide.vampirism": "Vampirism Guide",
  "guide.vampirism.title": "Vampirism",
  "guide.vampirism.welcome": "Welcome to Vampirism.",
  "guide.vampirism.overview.title": "Overview",
  "guide.vampirism.overview.intro": "Introduction",
  "guide.vampirism.overview.intro.text": "Welcome to Vampirism, a mod that allows you to become a vampire.\\nAs a vampire you don’t need to eat all that dry bread or eat these strange fruits called \"apples\", you prefer some red and tasty blood, which you have to suck from animals or better villagers. Be careful though, not every animal likes to give blood.\\nBut maybe you don't want to be a vampire yourself, but prefer hunting them.\\nThen you can become a Vampire Hunter and start learning useful skills to defeat these undead creatures. Maybe you are even able to abuse some of their powers for yourself.",
  "guide.vampirism.overview.getting_started": "Getting Started",
  "guide.vampirism.overview.getting_started.text": "First of all you have to decide if you want to become a vampire or a hunter. Checkout the other chapters to see what they can do. Then continue to the respective Getting Started Guide",
  "guide.vampirism.overview.config": "Configuration",
  "guide.vampirism.overview.config.text": "Vampirism has a lot of configuration and balance options.\nThere are multiple config files. Some apply to all worlds and are located in the '.minecraft/config' directory and others are specific to a certain world and are located inside the world directory in 'serverconfig'.",
  "guide.vampirism.overview.config.general.text": "§lClient side configuration§r, like e.g. the render location of the level indicator, can be found in config/vampirism-client.toml. The §lmain gameplay related§r options are world specifc and located in 'severconfig/vampirism-server.toml'.",
  "guide.vampirism.overview.config.general.examples": "§lNoticeable Examples:§r\\n§oSundamage Dimensions§r\\nYou can set a default for unspecified dimension (sundamageUnknownDimension). You can enforce sundamage in modded dimensions by adding them to 'sundamageDimensionsOverridePositive'. You can find out the dimension you are in game with \"/vampirism currentDimension\".\\n§oAuto convert glass bottle§r\\n By default Vampirism automatically converts between blood bottles and glass bottles depending on what is needed right now. If you do not want this or it causes problems with another mod, you can disable it.",
  "guide.vampirism.overview.config.balance.text": "Additionally, 'serverconfig/vampirism-balance.toml' allows you to fine tune a lot of balancing values.",
  "guide.vampirism.overview.trouble": "Troubleshooting",
  "guide.vampirism.overview.trouble.text": "§c§lIf your game crashes or does not start, we do NEED a crashreport§r\\nWithout a log file or at at least a extensive description of your problem, we can do absolutely nothing to help you.\\nSo please follow the following steps (If you have questions about the steps themselves, feel free to ask).\\n1. Find the Minecraft log file If you use the standard Minecraft launcher, the interesting logfile is .minecraft/logs/fml-client-latest.txt. (How to find the .minecraft folder). In case you have a server, the interesting log file should be logs/fml-server-latest.txt. If you use another launcher, it might have a function to easily upload or locate log files.\\n2. Make a post on Curseforge, describe the problem and include the log either within a spoiler or as a Pastebin of it. If you know what you are doing, you can also create an issue on Github.",
  "guide.vampirism.overview.dev": "Development",
  "guide.vampirism.overview.dev.text": "This mod is currently developed by Maxanier and Cheaterpaul and translate by many helpful users. If you have some good Java knowledge and want to help please contact him. If not you still can help by translating, giving feedback or creating textures. For more information checkout the link on the side.",
  "guide.vampirism.overview.support": "Support the development",
  "guide.vampirism.overview.support.text": "Developing this mod takes a lot of time and even I like it most of the time, there are a few things that are absolutely boring and sometimes I wonder if it is worth the trouble.\\n\\nIf you want to support the development and help me motivate myself please consider donating.\\nIt is possible to make one time donations on the CurseForge page.\\nIf you cannot or don’t want to donate money, you can still checkout the 'Development' section on how to help.",
  "guide.vampirism.overview.credits": "Credits",
  "guide.vampirism.vampire.title": "Vampire",
  "guide.vampirism.vampire.getting_started": "Getting Started as Vampire",
  "guide.vampirism.vampire.getting_started.become": "To become a vampire you have to be bitten by a vampire. So either let them attack you from behind or just wait until it happens by accident. When they bite you there is a chance, you receive a potion effect called \"Sanguinare Vampiris\" which lasts about a Minecraft day. After the potion effect has finished, you become a vampire.\\nIn case you don’t want to become one, you can always cancel the effect with a milk bucket.\\n§lAlternatively§r you can right-click with vampire fangs in your hand to inject some blood into you and get the same effect as above.",
  "guide.vampirism.vampire.getting_started.as_vampire": "Once you become a Vampire, one of your main sources of blood (at least the best source) are villagers and you should find plenty of those. Watch out though, Vampire Hunter will now attack you and try to protect the villagers.\\nYou will already notice that you do not feel very good in the sun, but the sunlight won’t hurt such a weak vampire as you are at this point.",
  "guide.vampirism.vampire.getting_started.zombie": "As an undead vampire Zombies will stop attacking you because they can no longer smell you. However, other, smarter, mobs will still identify you as a hostile player.",
  "guide.vampirism.vampire.getting_started.blood": "As a Vampire, you need to watch how much blood you have. Suck blood from villagers and some animals to get more blood by holding down \"%s\". Extra blood will be stored in glass bottles/Blood Bottles on your hotbar. You might even be able to suck blood from other players, as long as you are coming from behind so they can’t defend themselves. If you bite a mob, that does not have blood, you will deal some damage to them.\nBe careful, some mobs have garlic injected into their blood which is indicated by green fangs. Biting these mobs will poison you.",
  "guide.vampirism.vampire.getting_started.level": "In the beginning you will be a level 1 vampire (the level is displayed above your XP-level) and have improved speed, health and strength.\\nTo get to higher vampire levels you have to perform different rituals. As you advance through levels your abilities improve, but some disadvantages like sun damage might appear.",
  "guide.vampirism.vampire.getting_started.level2": "As a vampire you do not breath, so you do not drown. But unfortunately water will greatly weaken you.\\nSo if you want to frequently cross water, you might want to try to make your body water resistant. You will be able to unlock a skill that does this at a higher levels.",
  "guide.vampirism.vampire.blood": "Blood",
  "guide.vampirism.vampire.blood.text": "As a vampire you need blood like normal humans need food. With higher levels your blood usage will even increase.\\nYou already know how to get it (see \"Getting Started\"), but you can also store it).\\nIt is recommend to always have a few %s with you. You can fill them by having them on you hotbar while feeding from mobs with a full blood bar.\\nAlternatively you can use %s which are automatically converted when biting.",
  "guide.vampirism.vampire.blood.storage": "You can also store blood in you base in %s by (sneak-) right-clicking them with a blood bottle in your hand. You should also be able to store the blood in other mod’s fluid tanks.",
  "guide.vampirism.vampire.blood.biteable_creatures": "If you want to make creatures from other mods biteable, checkout the link on the side.",
  "guide.vampirism.vampire.leveling": "Leveling",
  "guide.vampirism.vampire.leveling.intro": "After becoming a vampire you probably want to reach higher levels. To level up you have perform more rituals at different altars, but always during night time.",
  "guide.vampirism.vampire.leveling.inspiration.reach": "To reach level 2-4",
  "guide.vampirism.vampire.leveling.inspiration.text": "Craft an Altar of Inspiration and place it somewhere. To use it, you have to fill it with blood (right-click with filled blood bottles). If there is enough blood inside you can right-click with an empty hand and the blood will be infused into you, making you even stronger.",
  "guide.vampirism.vampire.leveling.inspiration.requirements": "§oRequired blood amount:§r\\nFor level 2: %s\\nFor level 3: %s\\nFor level 4: %s",
  "guide.vampirism.vampire.leveling.infusion.intro": "This altar requires a multiblock structure. First craft the main block (%s) and place it down, then build %s around it and fill them with special blocks by right clicking a pillar. Place a %s at the top of each pillar. The pillar count as well as the required pillar filling depends on the level (more information below). After the structure is complete, put the required amount of items into the altar, right click with an empty hand and wait for the magic to happen.",
  "guide.vampirism.vampire.leveling.infusion.reach": "To reach level 5+",
  "guide.vampirism.vampire.leveling.infusion.structure": "§lStructure§r\\nDepending on the level you want to reach you need a specific amount of \"structure points\". The actual value of the structure is calculated after the following rules: Each pillar has to be either 2 or 3 blocks high and must be filled by the same material. Each pillar adds <height>*<material> points. Possible materials are: %s.\\nAs a simple rule you could say: If the altar says \"structure wrong\", build more pillars or fill the exiting with more valuable materials.\\n§oAt the end of this chapter there are a few example images.§r",
  "guide.vampirism.vampire.leveling.infusion.items": "§lRequired items§r\\nTo level up you also need a few items: %s.\\nFor more information on how to get them, check the links on the side. Also check the next page for the required amounts. You can use higher level pure blood if you want",
  "guide.vampirism.vampire.leveling.infusion.req": "Requirements",
  "guide.vampirism.vampire.leveling.infusion.req.for_level": "For level",
  "guide.vampirism.vampire.leveling.infusion.req.structure_points": "Struct",
  "guide.vampirism.vampire.leveling.infusion.req.heart": "Heart",
  "guide.vampirism.vampire.leveling.infusion.req.book": "Book",
  "guide.vampirism.vampire.leveling.infusion.image1": "The first empty structure",
  "guide.vampirism.vampire.leveling.infusion.image2": "The first structure with stone bricks to reach level 5",
  "guide.vampirism.vampire.leveling.infusion.image3": "The first structure with iron blocks to reach level 6 and 7",
  "guide.vampirism.vampire.leveling.infusion.image4": "The first structure with gold blocks to reach levels 8 to 11",
  "guide.vampirism.vampire.leveling.infusion.image5": "The second structure with gold blocks to reach level 12 to 14",
  "guide.vampirism.vampire.skills": "Skills",
  "guide.vampirism.vampire.skills.text": "As a vampire you can unlock skills. With each levelup you receive one skill point you can use.\\nYou can access the skill menu via the Vampirism Menu\\nBe careful, you won’t be able to unlock all, so decide which are worth it.",
  "guide.vampirism.vampire.skills.actions": "Some of the skills are \"actions\" (e.g. Bat Mode). To use them press %s and keep it pressed. A \"skill rose\" will pop up. Move the mouse in the direction of the desired action until it is highlighted. Then release the button. You might want to set the key binding to the middle mouse button.",
  "guide.vampirism.vampire.skills.actions2": "Most actions have a cooldown time, you can only activate them if they are not in cooldown mode.\\nSome actions also have a duration, then you can deactivate the action if you do not need it anymore by selecting it again to decrease the cooldown time.",
  "guide.vampirism.vampire.skills.refinements": "Vampires can equip vampire accessories. These unique items can either affect their natural abilities, but they can also improve or alter your skills",
  "guide.vampirism.vampire.unvampire": "Un-Vampire",
  "guide.vampirism.vampire.unvampire.text": "If you want to become a normal human again, you have to look for a %s. It can be found in the church of some villages. But be careful, you will loose all your levels.",
  "guide.vampirism.vampire.lord": "Vampire Lord",
  "guide.vampirism.vampire.lord.text": "You feel much more powerful than those weak vampire NPCs? As a vampire lord you can bind some to you allowing you to control them and make them work for you.\\nTo become a vampire lord you must reach the highest vampire level first. Then the %s should offer you a special task which, upon completion, grants you the right to name yourself %s/%s and to control minions.\\nYou can level up to a vampire %s/%s by completing more tasks to be allowed to control more minions.",
  "guide.vampirism.vampire.lord.titles": "Vampire lord titles",
  "guide.vampirism.vampire.lord.minion": "To obtain a minion you will need a %s item. Look for a weak vampire NPC and right-click your chosen minion with it.\\nIt should then be under your control and you can order it to e.g. defend you or collect blood.\\nIf you want to have the best of the best you can additional enhance the minions capabilities using the hard to obtain %s or %s or %s respectively. For each level they receive an additional stat point to can assign.",
  "guide.vampirism.vampire.armor": "Natural armor",
  "guide.vampirism.vampire.armor.text": "Vampires posses a thick skin that improves with increasing levels.\nIt servers as a natural armor. Therefore you have protection even without wearing any armor.\nThis is important as heavy armor hinders your movement. When wearing heavy armor (stronger than leather) you are vampire speed and attack speed boost is decreased.\nSo instead of wearing clunky armor, you can choose to wear (enchantable) vampire clothing instead.\nThe natural armor does not stack with any armor worn.\nAfter dying and respawning your skin takes some time to regenerate.",
  "guide.vampirism.vampire.dbno": "Down But Not Out",
  "guide.vampirism.vampire.dbno.text": "Real vampires are hard to kill. Most damage sources are not lethal to vampires. Therefore, they do not die, but go into a \"Down But Not Out\" (DBNO) state when loosing all their health.\nIn DBNO state you cannot move or act, but slowly recover and are able to resurrect after some time.\nUpon resurrection your remaining blood is converted to health and you have a %s effect for some time.\nDuring this time you cannot enter DBNO state, but die instead.\nCertain damage sources like holy water or fire are lethal even to vampires. Furthermore, hunters are able to finish off vampires using their stakes",
  "guide.vampirism.hunter.title": "Hunter",
  "guide.vampirism.hunter.getting_started": "Getting Started as Hunter",
  "guide.vampirism.hunter.getting_started.become": "To become a Vampire Hunter you will have to find a village, in which a \"%s\" lives. You will find some garlic plants behind his house. Use them to craft a %s. You also should replant some garlic because it will be useful later. Go inside the trainer’s house and use the special chair inside to inject that garlic vaccination. It will make you immune to the vampire’s poisonous Sanguinare Vampiris",
  "guide.vampirism.hunter.getting_started.as_hunter": "This is the main advantage you will have at that level. By leveling up, you will become stronger and learn some useful skills.",
  "guide.vampirism.hunter.leveling": "Leveling",
  "guide.vampirism.hunter.leveling.intro": "After becoming a Vampire Hunter you probably want to reach higher levels to learn some cool skills. To level up you have to train yourself somehow.",
  "guide.vampirism.hunter.leveling.to_reach": "To reach level %s",
  "guide.vampirism.hunter.leveling.train1.text": "You have to collect some vampire blood by killing normal vampire NPCs with a stake.\\nIf you have collected enough look around for a normal hunter NPC. Interact with him and a GUI will open.\\nRequired items:\\nLevel 2: %d Vampire Blood\\nLevel 3: %d Vampire Blood\\nLevel 4: %d Vampire Blood",
  "guide.vampirism.hunter.leveling.train2.text": "To level up further you will have to do some research first.\\nCraft yourself a %s and open its GUI. By inserting some special items (see table at the end) and investigating them you can gain some intel about vampires.\\nThe table can be upgraded by placing the following blocks right next to it: %s, %s and %s.\\n To reach the maximum level you will need all three of the blocks.\nWhen you got the intel, visit a Hunter Trainer. He will be able to train you for the next level, but you will have to pay him a fee for that.\\nJust open the GUI and take a look.",
  "guide.vampirism.hunter.leveling.train2.req": "Hunter Table Items",
  "guide.vampirism.hunter.leveling.train2.fang": "Fang",
  "guide.vampirism.hunter.skills": "Skills",
  "guide.vampirism.hunter.skills.intro": "As a Vampire Hunter you can unlock one skill per level. Open the GUI by pressing %s and take a look at what you can unlock.\\nBe careful, you won’t be able to unlock all, so decide which are worth it.\\nMost skills are self explanatory, but a few skills will be explained on the following pages.",
  "guide.vampirism.hunter.skills.disguise.text": "If you have unlocked this skill, you have learned how to hide.\\nUsing advanced techniques you are able to disguise yourself, so players and hostile mobs will not recognize you.\\nMobs will only attack you if you are very near to them and other players can hardly see you as long as you keep some distance to them. Maybe you are able to sneak to your enemies and surprise them from behind\\nBut you are not able to build or break blocks in this mode, since that would blow your cover.\\nTo activate this hold %s, select the skill and release the button.",
  "guide.vampirism.hunter.skills.weapon_table.text": "The Weapon Table allows you to craft advanced weapons including crossbows and more.\\nSome of the recipe require lava so fill the table with a lava bucket by right clicking it. To see all recipes use the mod \"Just Enough Items\" or browse the Guide Book, but let me tell you there are some interesting things like double crossbows or even a \"Van Helsing style\" crossbow.",
  "guide.vampirism.hunter.skills.potion_table.text": "With the potion table skill branch you can become an expert brewer. The potion table %s is an extended version of the brewing stand %s. With the respective skills acquired, you can unlock its full potential. This includes very expensive, yet very powerful, upgrades to existing potions, making them last incredibly long or strong. You can also craft new unique potions or improve the brewing process to save time or resources.",
  "guide.vampirism.hunter.vamp_slayer": "Vampire Slayer",
  "guide.vampirism.hunter.vamp_slayer.intro": "As a Vampire Hunter your main job is to defeat those blood sucking creatures.\\nYou have already learned which skills you can acquire to improve your vampire slaying capabilities.\\n This chapter explains some of the vampires greates weaknesses you can use to defeat them.",
  "guide.vampirism.hunter.vamp_slayer.garlic": "One of the vampire’s greatest weakness is garlic. They do not take any damage from it, but they are weakened and disoriented by it.\\n You can use that to your advantage.",
  "guide.vampirism.hunter.vamp_slayer.garlic2": "Currently the best way to do so is the Garlic Diffusor.",
  "guide.vampirism.hunter.vamp_slayer.garlic.diffusor": "The Garlic Diffusor dispenses garlic particles into the air. Thereby any vampire near to it is affected.\\nWith this you can keep vampire NPCs out of your base and can weaken any vampire player that enters your base, which e.g. stops them from turning into a bat.\\nCheckout its dedicated page to learn how to use it.",
  "guide.vampirism.hunter.vamp_slayer.holy_water": "A reliable way to hurt vampires is the usage of Holy Water. This elaborately crafted holy liquid deals quite some damage to undead creatures, especially to vampires. It also cancels their disguise and invisibility action.\\n Checkout the linked pages to learn how to obtain this liquid.",
  "guide.vampirism.hunter.vamp_slayer.fire": "Vampires suffer more damage from fire than normal humans.\\nYou can use that to your advantage. You could for example use indefinitely burning alchemical fire to protect your base.\\n Or you could use special fire spreading bolts for your crossbow. Don’t worry, alchemical fire does not spread or damage blocks.",
  "guide.vampirism.hunter.unhunter": "Un-Hunter",
  "guide.vampirism.hunter.unhunter.text": "If you decide to become a vampire, you have to get rid of the garlic in your blood. To do that craft yourself a %s and inject it by right clicking a %s.",
  "guide.vampirism.hunter.lord": "Hunter Lord",
  "guide.vampirism.hunter.lord.text": "You need support in the never ending fight against vampires? As a master hunter also known as hunter lord you can recruit hunter NPCs to work for you.\\nTo become a hunter lord you must reach the highest hunter level first. Then the %s should offer you a special task, which, upon completion, grants you the title %s and the right to command other hunter NPCs.\\nYou can rank up to rank %s and by completing more tasks. At a higher rank more hunter NPCs are willing to work for you.",
  "guide.vampirism.hunter.lord.titles": "Master hunter titles",
  "guide.vampirism.hunter.lord.minion": "To recruit a minion you will need a %s item. Look for a low level hunter NPC and right-click your chosen recruit with it.\\nIt should now be under your command and you can give them orders, E.g defending yoou or collecting resources.\\nIf you want to have the best of the best you can enhance their equipment and their capabilities using hard to obtain %s, %s and %s. For each level they receive an additional stat point to can assign.",
  "guide.vampirism.skills.bind_action": "You can also bind up to two actions to keyboard keys. See controls and /vampirism bind-action.",
  "guide.vampirism.overview.vampirism_menu": "Vampirism Menu",
  "guide.vampirism.overview.vampirism_menu.text": "The vampirism menu is accessible via the key %s and serves as an interface hub for Vampirism.\nIt displays accepted tasks and their details, it allows accessing the skill menu and it allows customizing the action menu.",
  "guide.vampirism.overview.vampirism_menu.text_vampire": "Furthermore, it allows customizing your appearance as a vampire and allows you to equip %s",
  "guide.vampirism.entity.title": "Creatures",
  "guide.vampirism.entity.general": "General",
  "guide.vampirism.entity.general.text": "Vampirism adds several new creatures to the game. Some are vampires, others hunt them. A few are hostile to everybody.\\nSome of these creatures (e.g. normal vampires, normal hunters and more) spawn in different levels. Higher level ones are usually stronger and sometimes have special abilities. When a new creature spawns, the vampire/hunter level of nearby players is checked to decide which level the creatures should have.",
  "guide.vampirism.entity.general.text2": "Some vampire or hunter creatures are even able to use certain skills and actions. The higher their level the better their available skills.",
  "guide.vampirism.entity.hunter.text": "Hunts vampires ;)\\n Spawns in villages or in small camps all over the world.\\nAppears in different outfits and levels\\nVampire Hunters near villages try to defend their village. Drops %s.",
  "guide.vampirism.entity.vampire.text": "Attacks neutral players as well as hunter players. Can infect players and drops %s. Also drops %s if killed with a %s.",
  "guide.vampirism.entity.minion.text": "Are subordinated to their lord/baron.",
  "guide.vampirism.entity.advanced_hunter.text": "Advanced version of a vampire hunter.\\n Is quite a lot stronger and calls normal hunters to help him. They have individual names and skins of Vampirism’s supporters as well as some more random names.",
  "guide.vampirism.entity.advanced_vampire.text": "Experienced vampire. Spawns rarely in the world and sometimes is followed by subordinated vampires. Drops %s and %s.\\nThey have individual names and skins of Vampirism’s supporters as well as some more random names.",
  "guide.vampirism.entity.vampire_baron.text": "Spawns rarely in vampire biomes.\\nOccurs in different levels partially depending on the players level.\\nDrops %s.\\nIs very strong and summons minions which help him.",
  "guide.vampirism.entity.hunter_trainer.text": "The trainer can be found in some villages. They have their own houses.\\nHigher level hunter players can train with them to level up",
  "guide.vampirism.entity.taskmaster": "Faction representative",
  "guide.vampirism.entity.taskmaster.text": "In faction controlled villages there might be a representative of the respective faction. They offers different quests with different rewards for the player.\\nThere are variants for the different factions and they can be found in a village controlled by the respective faction.\\nThere are special task that can be only be completed once, but are available at all representatives. Additionally there are repeatable tasks, which have to be accepted and completed at the same representative.\\nTo check the objectives click on a certain task. If you want to accept the task, click the green check and start working towards the objective. Return once complete to receive your reward.\\nItem objectives require you to have the specified items in your inventory. They will be given to the representative when you click complete.",
  "guide.vampirism.world.title": "World",
  "guide.vampirism.world.vampire_forest": "Vampire Forest",
  "guide.vampirism.world.vampire_forest.text": "The Vampire Forest is a rare biome. It is foggy and occupied by vampire creatures, because they do not receive sun damage due to the fog.",
  "guide.vampirism.world.villages": "Villages",
  "guide.vampirism.world.villages.text": "With Vampirism villages become a little bit more interesting. They appear more frequently and they can be controlled by a faction.\\n Controlling a village has multiple benefits. The inhabitants are somewhat protected against the other faction. Some villagers offer exclusive deals to you, new villagers join occasionally and more.\\n To get control of a village you need to capture it. Build a village totem, if there isn’t one yet, and interact with it to start a capture. But beware, the other faction might try to defend their village.",
  "guide.vampirism.world.villages.raids": "Besides the possibility to actively start a capture of a hostile village, it is also possible that a controlled village is randomly attacked by a hostile faction.\nAnyone defending the village, will receive a bonus with the villagers\nFurthermore, players can also obtain a bad omen effect that triggers a hostile raid when entering a village.",
  "guide.vampirism.items.title": "Items",
  "guide.vampirism.items.vampire_fang.text": "Dropped by vampires. Can be right-clicked to infect yourself with \"Sanguinare Vampiris\".",
  "guide.vampirism.items.human_heart.text": "Dropped by vampire hunter. Can be consumed by vampires to fill their blood bar.",
  "guide.vampirism.items.injection_empty.text": "The garlic version can be used to make yourself immune to \"Sanguinare Vampiris\" and to become a hunter.\\nThe \"Sanguinare\" version can be used to get rid of the immunity in case you want to become a vampire later.",
  "guide.vampirism.items.blood_bottle.text": "Can store blood. Vampires can right-click it to drink blood from it. Can be filled by keeping it on the hotbar when biting a creature. Glass bottles on your hotbar are also automatically converted to blood bottles then.",
  "guide.vampirism.items.pure_blood_0.text": "Dropped by %s depending on their level. Exists in different levels.",
  "guide.vampirism.items.hunter_intel_0.text": "Can be crafted in %s. Required to level up as a Vampire Hunter.",
  "guide.vampirism.items.item_garlic.text": "Can be found in some villages. You can cultivate it similar to carrots.",
  "guide.vampirism.items.pitchfork.text": "Deals a lot of damage",
  "guide.vampirism.items.vampire_book.text": "Can be found in dungeons, mineshafts, pyramids and other loot chests. Rarely dropped by advanced vampires and advanced hunters. Required to level up as a Vampire.",
  "guide.vampirism.items.vampire_blood_bottle.text": "Dropped by %s or %s if killed with a %s . Can be used for blood potions and more.",
  "guide.vampirism.items.crossbows": "Crossbows",
  "guide.vampirism.items.crossbows.text": "There are several different crossbows, some of them require special skills to be crafted or used. They use %s. (The tech bows use %s).\\n§4Crossbows can only be used by Vampire Hunters.§r",
  "guide.vampirism.items.crossbow_arrow_normal.text": "Used in crossbows.",
  "guide.vampirism.items.armor_of_swiftness": "Armor of Swiftness",
  "guide.vampirism.items.armor_of_swiftness.text": "This armor is very light and thereby allows you to run faster. It exists in different versions and the better ones even give you a jump boost. §4Can only be used by Vampire Hunters§r",
  "guide.vampirism.items.hunter_coat": "Hunter Coat",
  "guide.vampirism.items.hunter_coat.text": "Armor specifically designed for Vampire Hunters. If fully equipped it hides your from vampire’s blood vision and protects you from the \"Freeze\" skill. A vampire baron is still able to slow down you a little bit.\\nThe enhanced and special version additionally improve your concealment in disguise mode and increases your looting level by one (but not higher than 3) if fully equipped.\\n§4Can only be used by Vampire Hunters§r",
  "guide.vampirism.items.hunter_axe.text": "Has a high knockback and deals extra damage to vampires. §4Can only be used by Vampire Hunters§r",
  "guide.vampirism.items.stake.text": "Useful for trained Vampire Hunters. If they have the respective skill unlocked, they can e.g. instant kill vampires with below %s health with this.",
  "guide.vampirism.items.holy_water_bottle.text": "Holy Water Bottles is an important weapon against vampires.\\nIt can be either converted to splash bottles to directly damage vampires or used in further recipes.\\n\\nThere are two ways to obtain this.\\nIt can be bought from a priest villager that specialised in vampire hunting or, if you learned how and have unlocked the respective skill, by blessing %s at a church altar (right-clicking the altar).\\n%s can be obtained by adding %s to a water bottle.",
  "guide.vampirism.items.holy_salt.text": "Blessed Salt is the main ingredient for Holy Water.\\nYou can buy it from some priest villagers or create it by blessing %s at a church altar (right-click the altar with it).\\n %s again can be found in chests or, if you have learned how, by cooking water in the %s for a long time.",
  "guide.vampirism.items.purified_garlic.text": "By filtering the most important parts out of the garlic bulb you get purified garlic.\\nWhich can be used for powerful recipes or to boost the effect of a %s.",
  "guide.vampirism.items.item_alchemical_fire.text": "This carefully crafted complex powder creates a fire which burns indefinitely, but does not spread.\\nYou can use it for decoration or defense, alternatively you can craft fire spreading crossbow arrows with it.",
  "guide.vampirism.items.obsidian_armor": "Obsidian Armor of Hell",
  "guide.vampirism.items.obsidian_armor.text": "This armor is crafted using solidified lava.\\nIt is very protecting, but also very heavy and thereby slows you down.\\nDue to its nature it is fire proof, so if fully equipped you do not have to fear fire.\\nBut be careful, lava might still get through it.",
  "guide.vampirism.items.heart_seeker_normal.text": "Dance around your enemy and elegantly pierce their heart, as long as you have learned how to use it.\\nHas to be charged with blood (e.g. using a blood pedestal) to deal reasonable damage.\\nYou have to get used to every sword. In the beginning you can only swing it very slowly, but with every defeated mob you will be able to wield it more quickly.",
  "guide.vampirism.items.heart_striker_normal.text": "Face your enemy and defeat them with ease, as long as you have learned how to use it.\\nHas to be charged with blood (e.g. using a blood pedestal) to deal reasonable damage.\\nYou have to get used to every sword. In the beginning you can only swing it very slowly, but with every defeated mob you will be able to wield it more quickly.",
  "guide.vampirism.items.blood_infused_iron_ingot.text": "Specially treated iron ingot which reacts to blood. Can be used to craft some vampire weapons.",
  "guide.vampirism.items.vampire_clothing": "Vampire Clothing",
  "guide.vampirism.items.vampire_clothing.text": "Modern vampires are fashion-conscious, therefore they need something fancy and enchantable to wear instead of the clunky armor.\\nFor example a sleek cloak might be exactly what you are looking for. Not only does it have a interesting pattern, but it is also perfectly tailored to vampires. It also comes in different colors. However, this piece of fashion is not cheap.",
  "guide.vampirism.items.feeding_adapter.text": "Can be used to directly feed from or fill a blood container in your inventory.\nHave a blood container somewhere in your inventory and place this on your hotbar while feeding to fill the container or right click it to drink blood from the container.",
  "guide.vampirism.items.vampire_minion_binding.text": "The %s can be used by vampire lords to make a vampire NPC their minion by right clicking them.\\nDepending on the current level of the minion %s (%s-%s), %s (%s-%s) or %s (%s-%s) can be used respectively to improve the capabilities of a minion by one level each and gain an additional stat point.\\nThese items can be obtained as rewards from a %s.",
  "guide.vampirism.items.hunter_minion_equipment.text": "The %s can be used by hunter lords on a hunter NPC to properly equip it and allow it to work for them.\\nDepending on the current level of the minion %s (%s-%s), %s (%s-%s) or %s (%s-%s) can be used respectively to improve the capabilities of a minion by one level each and gain an additional stat point.\\nThese items can be obtained as rewards from a %s.",
  "guide.vampirism.items.oblivion_potion.text": "Upon consumption your skills will slowly reset and you will regain skill points allowing you to unlock a different set of skills.\n Can also be given to minions to reset their attributes.",
  "guide.vampirism.items.accessories": "Vampire Accessories",
  "guide.vampirism.items.accessories.text": "Vampire accessories are unique items that can be equipped in the Vampirism menu.\nThey can be obtained as task reward, found in chests or as loot.\nEach accessory provides a specific set of buffs, debuffs or changes to your abilities and skills\nOnce equipped they are bound to you and cannot be unequipped, only destroyed.\nWhen you respawn, they are damaged.",
  "guide.vampirism.blocks.title": "Blocks",
  "guide.vampirism.blocks.castle_block_dark_brick.text": "Decorative block. Prevents non vampire mobs from spawning on it. The Dark Stone variant allows no entity to spawn on it.",
  "guide.vampirism.blocks.vampire_orchid.text": "Flower. Can be found in vampire biome.",
  "guide.vampirism.blocks.altar_infusion.text": "Multiblock structure. Used to level up as a Vampire.",
  "guide.vampirism.blocks.hunter_table.text": "Used to craft %s",
  "guide.vampirism.blocks.church_altar.text": "Found in the church of some villages. Can be used to become a normal human again if you are a vampire.",
  "guide.vampirism.blocks.weapon_table.text": "Used to craft several hunter weapons and tools. Some recipes use lava, so you have to fill it by right clicking with a lava bucket.\\n§4Can only be used by Vampire Hunters§r and requires a special skill.",
  "guide.vampirism.blocks.blocks.coffin.text": "Can be used by vampires to sleep through the day.",
  "guide.vampirism.blocks.item_med_chair.text": "Used to infuse %s and %s.",
  "guide.vampirism.blocks.alchemical_cauldron.text": "Used to craft a few alchemical recipes. §4Can only be used by Vampire Hunters§r and requires a special skill.",
  "guide.vampirism.blocks.garlic_beacon_normal.text": "Diffuses garlic particles into the air to prevent vampires from spawning and to weaken nearby vampires. The normal versions affects an area of %s by %s chunks from bedrock to sky around it, the improved one a %s by %s area. Its effect on vampires can be temporarily boosted by right-clicking it with %s. When boosted it even blinds nearby vampire players.",
  "guide.vampirism.blocks.altar_inspiration.text": "Used to level up as a vampire.",
  "guide.vampirism.blocks.blood_container.text": "Can store a lot of blood. (Sneak-) Rightclick it with a blood bottle to put blood in or take blood out of it.",
  "guide.vampirism.blocks.blood_pedestal.text": "Can be used to charge blood powered items. Place on top of any blood container or tank and insert any appropriate item by right-clicking.",
  "guide.vampirism.blocks.blood_grinder.text": "This advanced machine is able to grind certain items to extract blood. This includes items like %s but also %s and some modded items. However, the extracted blood is impure. Place it on top of a %s to filter the result.\\nIt acts like an hopper extracting suitable items from a inventory above and accepting items thrown on top of it.",
  "guide.vampirism.blocks.blood_sieve.text": "This block can be used to clean %s produced by the %s. It might also be used to convert blood fluids from other mods. Place it on top of a blood container and pump some liquid to filter in to it. It can also drain impure blood from a tank above.",
  "guide.vampirism.blocks.totem_top_crafted.text": "Used to control a village. There is a fragile version that is sometimes found in villages and a normal version that can be obtained as a task reward and be used to control manually built villages.",
  "guide.vampirism.blocks.totem_base.text": "Used to control a village.",
  "guide.vampirism.blocks.potion_table.text": "Hunters can make use of the potion table. It works like a brewing stand but offers additional recipes and benefits.\\nWith the appropriate skills you can craft very long lasting potions, very strong potions or previously unavailable potions.",
  "guide.vampirism.blocks.decorative.title": "Decorative Blocks",
  "guide.vampirism.blocks.decorative.text": "Various blocks for decorative purposes only",
  "guide.vampirism.common.minion_control": "Minion have an inventory which you can use to store items. By interacting with your minion you can access said inventory and also configure the appearance of the minion.\\nYou can also give the minion orders in this screen. Alternatively, you can use the minion command hotkey (%s) to give orders to all of your minions at once. You can also switch from your action menu to the minion task menu by pressing Space while the screen is shown. Therefore, it is sufficient to bind one of this keys.\\nTo exclude a specific minion from your commands (except %s) you can click on the small lock icon in the minion interaction screen.\\nWhen a minion is heavily wounded, it will teleport away to recover from its wounds. Once healed, it will let you know and you can call it back with the %s command.",
  "guide.vampirism.changelog.title": "Changelog",
  "guide.vampirism.changelog.v1_8": "Vampirism 1.8",
  "guide.vampirism.changelog.v1_8.vampirism_menu.image": "The vampirism menu",
  "guide.vampirism.changelog.v1_8.overview.text": "§lOverview§r\n-Vampirism Menu\n-Skill changes\n-Task changes\n-Balancing\n-Misc\n-Vampire accessories\n-Vampire natural armor\n-Vampire immortality\n-Faction raids",
  "guide.vampirism.changelog.v1_8.vampirism_menu.text": "§lVampirism menu§r\nThe new vampirism menu represents a central hub. It is opened by the old skill gui key \"%s\". There you are able to open other vampirism screens like the skill screen or the appearance screen. On the other hand there are two new things to find here, the first is an overview over accepted tasks and the other new things are the accessory slots.",
  "guide.vampirism.changelog.v1_8.skills.text": "§lSkill changes§r\n Besides balancing changes to the hunter/vampire attack damage and attack speed skills and reordering of hunter skills there are some other skill changes on the following pages.",
  "guide.vampirism.changelog.v1_8.skills.vista.image": "Instead of being a skill the vista benefits are now a natural attributes of vampires.",
  "guide.vampirism.changelog.v1_8.skills.neonatal.image": "This new skill reduces the duration of the neonatal effect after being resurrected as vampire.",
  "guide.vampirism.changelog.v1_8.skills.dbno.image": "This new skill reduces the duration a vampire must wait before it can resurrect.",
  "guide.vampirism.changelog.v1_8.skills.hissing.image": "The hissing action disorients nearby entities resulting in a memory loss of their target",
  "guide.vampirism.changelog.v1_8.tasks.text": "§lTask changes§r\nWhile there are new tasks available, the task system has changed in the way that task now have a time limit in which the task must be completed and the reward collected, otherwise the task is failed. The time differs whether you are playing in single player or on a server.\nTo give you an overview over all you current tasks they are displayed in the vampirism menu with additional data like the remaining time and the last known position of the contractee.",
  "guide.vampirism.changelog.v1_8.balancing.text": "§lBalancing§r\n- Vampire and hunter level modifier and weapons were adjusted\n- Vampire swords can be enchanted with most enchantments now\n- Enhanced Hunter Coat now buffs hunter disguise and give bonus looting\n- Reduce minion upgrade diamond price\n- Remove vampire bite attack\n- Don't prevent disguised hunters from interacting/attacking but instead break their disguise",
  "guide.vampirism.changelog.v1_8.misc.text": "§lMisc§r\n- add garlic beacon finder item\n- Skeletons no longer attack vampires and creeper always flee\n- Vampire minions should try to avoid the sun if there current task permits it\n- Minions should consume food/blood items in their offhand to heal\n- Garlic beacon has an activation delay\n- Blood projectile fine-tuning\n- Allow curing converted villagers and creatures with an Infested Apple similar to curing zombie villagers\n- Add training dummy to determine damage and DPS\n- Preview appearance when hovering over a skin/eye type\n- Use correct appropriate model (steve/alex) for vampire and minions texture\n- Allow binding higher level vampires as minions\n- Fix village capture AI requiring line of sight and make sure advanced entities participate in a capture event\n- New minion related and other advancements\n- Reset skills by consuming Potion of Oblivion instead of loosing a level\n- Allow resetting minion stats by giving them a Potion of Oblivion\n- Change totem beam visibility (only during capture)\n- Totem of Undying now gives fire protection and sunscreen\n- Update item tooltips\n- Add third action keybinding option\n- Bat mode does not change the players health anymore, instead it removes any armor effect and doubles incoming damage\n- new decorative blocks",
  "guide.vampirism.changelog.v1_8.accessories.text": "§lVampire accessories§r\nVampires can now equip accessories (ring, amulet and obi belt) which give buffs (and debuffs) and can even modify certain skills.\nThere are many different effects and combinations of effects with different rarities and you can try to collect the perfect set of ring, amulet and obi belt.\nIn total there are much more than 100.000 possible combinations, even though many are similar.\nAccessories §c§lcannot be unequipped§r\n and are destroyed if another is equipped in the same slots\nUpon respawning (after death) accessories take a random amount of damage and eventually break.\nCertain accessories can for example change the dark blood projectile to a short range 360° attack",
  "guide.vampirism.changelog.v1_8.accessories.image": "The accessories can be equipped in the vampirism menu",
  "guide.vampirism.changelog.v1_8.vampire_armor.text": "§lVampire armor§r\n- Vampires have natural armor when not wearing armor\n- The amount of armor scales between iron and diamond from level 1 to level 14\n- This natural armor does not stack with additionally worn armor\n- If wearing heavy armor (anything stronger than leather) your vampire specific speed and attack speed buff will be cut by half\n- Armor enchantments can be applied to stylish vampire clothing that can be equipped in the armor slots\n- After respawning the natural armor will take some time to fully regenerate",
  "guide.vampirism.changelog.v1_8.vampire_immortality.text": "§lVampire immortality§r\n- Vampires do not immediately die from certain damage sources, instead they go into a down-but-not-out (DBNO) state where they can still be hit, but are ignored by mobs\n- After some regeneration phase, they can choose to resurrect. Alternatively, they can always decide to die and respawn instead\n- After resurrecting vampires are weakened and instantly die when they are killed again in the next few minutes\n- While DBNO vampire can be immediately finished using vampire killing weapons like stake, holy water or fire",
  "guide.vampirism.changelog.v1_8.raids.text": "§lFaction raids§r\nFaction raids can now be triggered by walking into a village with a faction Bad Omen effect. The Bad Omen effect can be obtained by killing hunter or vampire with a faction banner on their back. An increased Bad Omen effect level will result in a stronger attack force and a higher reward. Additionally there can be random weak raids while in a village."
}