{
  "name": "Supernatural Visitors",
  "category": "world",
  "icon": "bewitchment:spectral_dust",
  "pages": [
	{
	  "type": "text",
	  "text": "The physical world is often visited by beings of a metaphysical nature, either to act as guardians and protectors, or to cause mischief, and in some cases, with malevolent purposes. Regardless of their nature, Cold Iron is the de-facto tool to use against them."
	},
	{
	  "type": "empty",
	  "draw_filler": false
	},
	{
	  "type": "text",
	  "title": "Black Dog",
	  "text": "Black dogs resemble a massive shadowy canid, and are known to haunt the countryside, tormenting the people who live there. If attacked, Black Dogs may turn invisible, with only the glow of their eyes visible."
	},
	{
	  "type": "entity",
	  "entity": "bewitchment:black_dog",
	  "scale": 0.5
	},
	{
	  "type": "text",
	  "title": "Druden",
	  "text": "Often confused with dryads, druden can be seen as the darker version of them. These hags stalk dark forests and attack humans who enter their realm. They are known to partake in the Wild Hunt as well."
	},
	{
	  "type": "entity",
	  "entity": "bewitchment:druden",
	  "scale": 0.8
	},
	{
	  "type": "text",
	  "title": "Ghosts",
	  "text": "Ghosts are the souls of the dead, either rising on their own to finish things they were not able to finish in life, to warn others of danger, or in some cases, intentionally conjured by a witch. They may also haunt certain ancient structures, or possibly even locations where they were killed when they were living, in order to torment those who caused their unfair death."
	},
	{
	  "type": "entity",
	  "entity": "bewitchment:ghost",
	  "scale": 0.7
	},
	{
	  "type": "text",
	  "title": "Shadow Person",
	  "text": "A humanoid demon vaguely resembling a shadow, they seem to haunt the halls of once abandoned strongholds, and are sometimes called into this world through certain rites. All encounters with them end with malice."
	},
	{
	  "type": "entity",
	  "entity": "bewitchment:shadow_person",
	  "scale": 0.8
	},
	{
	  "type": "text",
	  "title": "Cambions",
	  "text": "Cambions are the offspring of a demon and a mortal human, left abandoned in the physical world. They try to meld in with villagers, but seem somewhat ostracized by them."
	},
	{
	  "type": "entity",
	  "entity": "bewitchment:cambion",
	  "scale": 0.8
	}
  ]
}
