{
  "name": "Activator Module",
  "category": "modules",
  "icon": "modularrouters:activator_module",
  "pages": [
    {
      "type": "text",
      "text": "This powerful module acts like a $(italic)fake player/$ which can use an item in the router's buffer, against nearby blocks or entities. There are three modes, which can be selected via the controls on the right of the GUI. Each mode is detailed in the following pages."
    },
    {
      "type": "text",
      "title": "Right-click",
      "text": "This mode performs a right-click with the item in the router's buffer, just as if a player had done so. The logic used is the same as for player clicks, e.g. right-clicking a $(item)Flint and Steel/$ on a door will open the door, not start a fire.$(p)The targeted block (if any) depends on the router's facing, module direction, and also the Look Above/Below/Level module setting."
    },
    {
      "type": "text",
      "title": "Right-click Entity",
      "text": "This mode performs a right-click with the item in the router's buffer on a nearby $(thing)entity/$. You could use this to milk a cow for example, or shear a sheep.$(p)This can result in items being dropped on the ground, e.g. if a cow is clicked with a stack of more than one bucket in the router's buffer."
    },
    {
      "type": "text",
      "title": "Attack Entity",
      "text": "This mode performs a left-click with the item in the router's buffer on a nearby $(thing)entity/$, attacking it. This mode costs $(l:upgrades/energy)Forge Energy/$ by default, unlike other modules.$(p)Note: while $(l:upgrades/speed)Speed Upgrades/$ can be useful here, weapon cooldowns do apply, so excessive Speed Upgrades will just end up wasting energy and weapon durability."
    },
    {
      "type": "text",
      "text": "The Activator has a range of about 4 blocks, similar to what an actual player has. The module can also be configured to look $(thing)Above/$ or $(thing)Below/$ (default is $(thing)Level/$).$(p)$(thing)Above/$ is particularly handy for planting things on top of a solid block beside or above the router, while $(thing)Below/$ is useful when you want to target the ground directly adjacent to the router, rather than a more distant block."
    },
    {
      "type": "crafting",
      "recipe": "modularrouters:activator_module"
    }
  ]
}
