{
    "name": "The Info Menu",
    "icon": "apotheosis:textures/gui/book/question_mark.png",
    "category": "apotheosis:enchanting/table",
	"flag": "apotheosis:enchanting",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "The enchanting table has a helpful screen to let you learn about what enchantments are available.$(p)To access it, place an item in the enchanting table, and click the question mark in the top right."
        },
		{
			"type": "patchouli:text",
			"text": "The purpose of this chapter is to introduce this screen, and help you navigate it.$(p)If you have a full understanding of it, you'll never be confused by enchanting again."
		},
		{
            "type": "patchouli:image",
			"title": "The Slot Selector",
			"images": [
				"apotheosis:textures/gui/book/slot_selector.png"
			],
			"text": "This lets you select which enchanting slot to inspect."
        },
		{
			"type": "patchouli:text",
			"text": "The currently selected slot will be highlighted, and slots that are not available will be grayed out.$(p)Hovering the slot will show you the level, the $(4)Min Power$() and the $(9)Max Power$()."
		},
		{
            "type": "patchouli:image",
			"title": "Enchantments Window",
			"images": [
				"apotheosis:textures/gui/book/enchantments_window.png"
			],
			"text": "This shows you what enchantments are available."
        },
		{
			"type": "patchouli:text",
			"text": "Given the current item, and the currently selected power level, a certain array of enchantments are available.$(p)This window shows you each enchantment, their level, rarity, and chance of being selected.$(p)It will also show what enchantments are exclusive with each other."
		},
		{
            "type": "patchouli:image",
			"title": "The Power Slider",
			"images": [
				"apotheosis:textures/gui/book/power_slider.png"
			],
			"text": "This lets you change the simulated power level."
        },
		{
			"type": "patchouli:text",
			"text": "When you select a slot, the Power Slider automatically selects the power level directly in the middle of the power range.$(p)The slider can only go down to the $(4)Min Power$() and up to the $(9)Max Power$() for the current slot."
		},
		{
            "type": "patchouli:image",
			"title": "Rarity Weights",
			"images": [
				"apotheosis:textures/gui/book/weights.png"
			],
			"text": "This shows the weight of each rarity."
        },
		{
			"type": "patchouli:text",
			"text": "Every enchantment has a rarity, and each rarity has a weight.$(p)The chance of selecting an enchantment is its individual weight divided by the total pool (of the weights of all available enchantments).$(p)$(arcana) can change the rarity weights."
		}
	]
}