{
    "name": "Enchanting Stats",
    "icon": "minecraft:bookshelf",
    "category": "apotheosis:enchanting/table",
	"flag": "apotheosis:enchanting",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "With Apotheosis, enchanting is dependent on more than just levels.$(p)There are currently five new enchanting stats.$(p)Blocks that provide enchanting stats will have them on their tooltip."
        },
		{
			"type": "patchouli:text",
			"title": "Eterna",
			"text": "$(eterna) is the primary stat of enchanting.$(p)Each point of $(eterna) increases the maximum enchanting level by two.$(p)Some blocks can only provide $(eterna) up to a certain maximum value."
		},
		{
			"type": "patchouli:text",
			"title": "Quanta",
			"anchor": "quanta",
			"text": "$(quanta) is a secondary stat. It controls enchanting variance.$(p)During enchanting, you have a $(bpower), which is the level you spent to enchant with, and then a $(fpower), after all modifications.$(p)$(quanta) is one of the factors in the modification process."
		},
		{
			"type": "patchouli:text",
			"text": "A value is selected, between $(4)1 - Quanta$() and $(9)1 + Quanta$().$(p)Your $(fpower) is equal to that value multiplied by your $(bpower).$(p)Higher $(quanta) values increase the power range, which means your enchantments are less consistent in their $(fpower)."
		},
		{
			"type": "patchouli:text",
			"title": "Arcana",
			"text": "$(arcana) is a secondary stat. It controls the rarity weights, and at certain thresholds will guarantee you get additional enchantments.$(p)At 25% $(arcana), you will always receive at least two enchantments. At 75%, you will always receive three."
		},
		{
			"type": "patchouli:text",
			"text": "By default, the rarities have the following weights:$(p)Common: 10$(br)Uncommon: 5$(br)Rare: 3$(br)Very Rare: 1$(p)Every 10% of $(arcana) changes the weights, eventually becoming fully inverted.$(p)Hovering the $(arcana) Bar will show the current weights."
		},
		{
			"type": "patchouli:text",
			"title": "Rectification",
			"anchor": "rectification",
			"text": "Rectification is a tertiary stat. It directly impacts the lower bound of $(quanta) modifications.$(p)Recall that your $(4)Min Power$() is equal to $(4)1 - Quanta$().$(p)With Rectification (R), your $(4)Min Power$() is equal to $(4)1 - (1 - R) * Quanta$()."
		},
		{
			"type": "patchouli:text",
			"text": "If that doesn't make a ton of sense, don't worry about it.$(p)Just know that higher Rectification values are always a good thing.$(p)You can also have negative Rectification, which is always bad."
		},
		{
			"type": "patchouli:text",
			"title": "Clues",
			"text": "Clues are another tertiary stat.$(p)Each clue allows you to see one additional item in the preview window.$(p)When you can see every available enchantment, the text will change slightly."
		},
		{
			"type": "patchouli:text",
			"text": "You can also drop to zero clues, and be able to see nothing."
		}
	]
}