{
  "name": "The Multiverse",
  "icon": "",
  "category": "arcane_lessons",
  "priority": true,
  "pages": [
    {
      "type": "text",
      "text": "$(marked)The Multiverse$()... one of the few 'places' in which the traditional concepts of space and time do not exist, or at least in a way that we cannot understand, as with many things. The Multiverse is basically like a galaxy, but for universes."
    },
    {
      "type": "text",
      "text": "$(marked)Spheres$() are located in the multiverse, which are areas in which certain elements dominate, influencing fundamental values of single universes in them. $(br)The spheres vary in stability, meaning that some spheres may submerge into some, creating spheres with more than one element, while some spheres may just stay in place."
    },
    {
      "type": "text",
      "text": "The stability of these spheres can vaguely be sorted in layers: the $(marked)Elemental Layer $(), $(marked)the Sub-Elemental Layer$(), $(marked)the Middle Worlds$(), $(marked)the Chaos Layer$() and the $(marked)Layer of Darkness$(). These spheres are descendingly sorted by stability.$(br)Humanity can be found in the Middle Worlds, in a Water-Earth-Air Sphere."
    },
    {
      "type": "text",
      "title": "The Blind Idiot God",
      "text": "$(marked)The Blind Idiot God$() is known to be the creator of the multiverse...or something. He exists in the spaces between the universes, yet he cannot be found in the multiverse. All existence is his dream and once this dream is over, it is gone. He is kept asleep by the $(marked)Multiversal Dragons$(), singing the cosmic ballad. Knowing this ballad allows to manipulate the subconscious thoughts of the Blind Idiot God, giving the ability to alter reality."
    },
    {
      "type": "text",
      "text": "The part of the multiverse that is existence, also know as the Wake, is surrounded by the rest of the Blind Idiot God's subconsciousness, the Mind. Between those two places, the Inner Threshold may be found, the place where the Gate-and-Key, yet another god, resides. Outside of the Mind, and beyond the Outer Threshold and the Mirror, Nothingness, or Beyond, may be found."
    },
    {
      "type": "text",
      "title": "The Multiversal Dragons",
      "text": "$(marked)The Multiversal Dragons$() are the Blind Idiot God's singers. They keep him asleep and manipulate his thoughts by singing their cosmic ballad. Parts of this ballad were once taught to mortals, the $(marked)Dragonsingers$(), who where supposed to keep evil forces at bay. Their descendants are still connected to the Multiversal Dragons, granting them great affinity to primal aspects, as they know parts of the ballad."
    },
    {
      "type": "text",
      "text": "Although every mortal can learn a tiny sliver of the cosmic ballad, descendants of Dragonsingers are deeper connected to those, making them the only people to perceive the Multiversal Dragons..."
    }
  ]
}