{
	"name": "Experience Handling",
	"category": "assemblylinemachines:blocks",
	"icon": "minecraft:experience_bottle",
	"pages":[
		{
			"type": "text",
			"text": "If you lose your life while adventuring, you will very likely lose any and all $(2)Experience$() you were carrying. What a shame.$(p)Those days are over, thanks to new innovations in handling your precious levels."
		},
		{
			"type": "spotlight",
			"item": "assemblylinemachines:liquid_experience_bucket",
			"title": "Liquid Experience",
			"link_recipe": true,
			"text": "$(2)Liquid Experience$() is the raw essence of levels. This may be singlehandedly one of the most useful liquids you can get in the game, due to the versatility of it.$(p)But first, there is the matter of $(9)acquiring it.$()"
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/experience_hopper",
			"text": "The $(2)Experience Hopper$() will pick up XP Balls in an area in front of it, and deposit it into a tank behind it automatically."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/experience_siphon",
			"text": "The $(2)Experience Siphon$() will remove Levels from any Player which steps on it, convert, and place Liquid Experience into a tank below it."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/experience_mill",
			"text": "The $(2)Experience Mill$() is what you can use all of this Liquid Experience at as a very versatile block. It does not require power to function."
		},
		{
			"type": "text",
			"text": "The options for this block are as follows:$(li)Enchantment Mode, which will apply a random enchantment to a tool or item,$(li)Anvil Mode, which can combine items to fill durability or combine enchantments,$(li)Book Mode, which will take a catalyst item and normal book and craft an Enchanted Book as a result!$(br)There is also a unique upgrade required to boost the power of the machine."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/upgrades/experience_mill_upgrade_level",
			"title": "Exp. Mill Level Upgrade",
			"text": "This will boost the resulting enchantments in Enchantment Mode in the Experience Mill, as well as the max level resulting from Book Mode."
		}
	]
}