{
	"name": "Generators and Energy",
	"category": "assemblylinemachines:blocks",
	"icon": "assemblylinemachines:combustion_generator",
	"pages":[
		{
			"type": "text",
			"text": "This section will outline current generators available, as well as energy storage."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/crankmill",
			"text": "This will harness the power of a Gearbox and convert kinetic energy to electrical energy. For more information, view the $(l:age3)Electrical Age Walkthrough."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/coal_generator",
			"text": "This device will convert all flammables into electric energy. Every piece of fuel will burn for 60 seconds, but the amount of energy produced/tick will depend on the fuel used."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/basic_battery_cell",
			"text": "This device can store up to 2.5MFE, supporting distribution on all sides except the front.$(p)It can also automatically push or pull energy from surrounding blocks, up to 2KFE/t."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/geothermal_generator",
			"recipe2": "assemblylinemachines:crafting/combustion_generator"
		},
		{
			"type": "text",
			"text": "These two generators are cut from the same cloth. Both can take in a fluid, but which fluid is where they are different.$(p)The Combustion Generator can take in the Oil byproducts, Diesel and Gasoline.$(p)The Geothermal Generator can take in Lava."
		},
		{
			"type": "text",
			"text": "To get Diesel and Gasoline, Oil is pumped into the Refinery with the Separation Attachment. This will produce Gasoline and Diesel at a 5:3 ratio. For more info, please view the $(l:age3)Electrical Age Walkthrough.$()$(p)Both of these generators can also accept the Active Cooling Upgrade."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/upgrades/generator_upgrade_coolant",
			"title": "Active Cooling Upgrade",
			"text": "This adds a secondary fluid tank to these generators, for coolant, in exchange for the total amount of power/bucket of fuel being increased.$(p)Water offers a x2 multiplier, while Condensed Void offers a x4 multiplier."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/naphtha_turbine",
			"text": "This serves as an augment to the Coal Generator, which can greatly increase the power output. Smoldering Stone is obtained in the Refinery, combining Cobblestone and Naphtha with Addition Attachment."
		},
		{
			"type": "text",
			"text": "Place the Turbine on the Coal Generator, and place a bucket of Naphtha nearby (make sure it's contained!).$(p)When the Naphtha Fire spreads to the Turbine, and the Coal Generator starts a new operation, the Naphtha Fire will be extinguished, and will give the Coal Generator's next operation a x4 multiplier.$(p)Naphtha can be found rarely with the Pump by Dowsing in the Nether."
		}
	]
}