{
	"name": "Item Processing",
	"category": "assemblylinemachines:blocks",
	"icon": "assemblylinemachines:autocrafting_table",
	"pages":[
		{
			"type": "text",
			"text": "This section will outline the blocks available to you to aid in item processing."
		},
		{
			"type": "crafting",
			"title": "Autocrafting Table",
			"recipe": "assemblylinemachines:crafting/ingot_to_block/crafting_table",
			"recipe2": "assemblylinemachines:crafting/autocrafting_table"
		},
		{
			"type": "text",
			"text": "This block can store up to 10 recipes (with upgrades), which can all process recursively.$(p)Items can be placed into the crafting grid appropriately, where a ghost recipe will be filled. Once an appropriate recipe is entered, press the checkmark button to finalize it."
		},
		{
			"type": "text",
			"text": "Items inputted are placed into the SIX gray processing slots. These slots can be modified. The slots circled in color are for intermediate crafting results.$(p)Every recipe can be set to either output to the RED output slot, or output to one or all of the colored intermediate slots below.$(p)Items in the intermediate slots can be removed but items cannot be put into them manually."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/upgrades/autocrafting_upgrade_recipes",
			"title": "Capacity Upgrade",
			"text": "This upgrade will add additional recipe space as follows:$(li)1 Upgrade, Max 4 Recipes$(li)2 Upgrades, Max 6 Recipes$(li)3 Upgrades, Max 10 Recipes"
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/upgrades/autocrafting_upgrade_sustained",
			"title": "Sustained Upgrade",
			"text": "This upgrade will allow the machine to run without power. Downside? No other upgrades can be installed. The machine will also be slower."
		},
		{
			"type": "text",
			"text": "The Autocrafting Table can also support the general Speed Upgrade for the block!$(p)For recipes where the items are not used, such as Buckets in the Cake recipe, the empty container will be returned to the intermediate inventory."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/bottomless_storage_unit",
			"text": "This block, simply, can hold up to the 64-bit max value of a single item.$(p)$(7)$(o)That's 9.223 quintillion items!$(br)That's 9 trillion millions!$(br)Fill one of these, I dare you."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/vacuum_hopper",
			"text": "This block can be connected to a container. The Vacuum Hopper will pick up items in a 3x3 area in front of the block and place into the container."
		}
		
	]
}