{
	"name": "Mob Farming",
	"category": "assemblylinemachines:blocks",
	"icon": "assemblylinemachines:interactor",
	"pages":[
		{
			"type": "text",
			"text": "There are lots of options for monster and animal processing for you! Read on for further information."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/interactor",
			"text": "The Interactor will perform one of four duties, extremely useful for automation."
		},
		{
			"type": "text",
			"text": "The modes for the Interactor are as follows:$(li)Break Mode will remove the block in front of the unit, using a tool within the machine. The result will be dropped into the world.$(li)Interact Mode will right-click the block in front of it. Any items added to the \"inventory\" after each operation will be expelled into the world after each right-click."
		},
		{
			"type": "text",
			"text": "$(li)Place Mode will place a block in front of the unit, either randomly or orderly from the internal capacity.$(li)Attack Mode will hit entities in a small area in front of it, either with an empty fist or a weapon located in the internal capacity of the Interactor."
		},
		{
			"type": "spotlight",
			"item": "assemblylinemachines:mob_crystal",
			"anchor": "mobcrystal",
			"link_recipe": true,
			"text": "The Inert Mob Crystal will be used to configure the $(item)Powered Spawner.$()To obtain:$(li)Use a Smooth Stone with Gravel and Sand in the Purifier to get a $(item)Polished Rock.$()$(li)Alloy Smelt the Polished Rock and a Netherrite Scrap to get the crystal."
		},
		{
			"type": "text",
			"text": "Next, you need to kill an entity with a $(item)Mystium Sword$() while the Inert Mob Crystal is in your inventory, and if you are lucky, the crystal will activate.$(p)$(3)The Mystium Sword's secondary ability needs to be activated! For more info, view the $(l:items/mystium_tools)Mystium Tools Page.$()"
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/powered_spawner",
			"text": "Place the Activated Mob Crystal in the Powered Spawner, add power, and it will start summoning mobs!"
		},
		{
			"type": "text",
			"text": "The Powered Spawner is compatible with the $(item)Additional Output Upgrade, $()which will allow it to spawn more mobs per operation!$(p)It is also compatible with the regular $(item)Speed Upgrade,$() which will make it spawn quicker."
		}
		
	]
}