{
	"name": "The Quarry",
	"category": "assemblylinemachines:blocks",
	"icon": "assemblylinemachines:quarry",
	"pages":[
		{
			"type": "text",
			"text": "The Quarry is a multiblock which will hollow out a great hole in the Earth, collecting resources and allowing further processing!"
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/quarry",
			"text": "Along with the Quarry, you will also need a storage container, as well as power."
		},
		{
			"type": "text",
			"text": "Placing down the Quarry, you will be prompted with a terminal. This will outline the current issue preventing mining.$(p) The quarry will mine in the square area as selected by your RANGE, either to the left or right of the Quarry, as selected. The Quarry will always be in the corner of the pit dug."
		},
		{
			"type": "image",
			"images":[
				"assemblylinemachines:textures/gui/patchouli/quarry_mine_zone.png"
			],
			"border": true,
			"title": "Quarry Area",
			"text": "$(7)$(o)This demonstrates the area of a 5-block range, right-oriented Quarry pit."
		},
		{
			"type": "text",
			"text": "The Quarry will operate and place the output into the chest above, until the entire chunk is mined. Then, you are free to re-place it and start again!$(p)By default, the Quarry will replace collected blocks with Dirt.$(p)The Quarry also has a handful of Addons. These are placed next to the Quarry in any direction. They will attach, and add to the Quarry's performance, at additional power cost."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/quarry_addon_fortune",
			"text": "The Fortune Addon will increase drops from Ores like Lapis, Coal, or Redstone. $(p)Every one of these blocks around will add one level of Fortune to the mining process."
			
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/quarry_addon_speed",
			"text": "The Speed Addon will make the Quarry operate quicker. $(p)Every one of these blocks around will double the mining speed."
			
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/quarry_void_addon",
			"text": "The Void Addon will make the Quarry leave no block present, instead of Dirt. $(p)Unlike the other upgrades, this one does not increase power usage."
		}
	]
}