{
	"name": "Standard Machines",
	"category": "assemblylinemachines:blocks",
	"icon": "assemblylinemachines:electric_fluid_mixer",
	"pages":[
		{
			"type": "text",
			"text": "This section will outline all basic processing electrical machines, accessible to you at the start of the $(l:age3)Electrical Age.$()$(p)Many of these machines can support upgrades! More information on these are available on the $(l:items/upgrades)Upgrades Page!"
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/electric_purifier",
			"text": "This will purify an item with two purifying catalyst items added in. For more information, view the guide on the $(l:age3)Electrical Age.$()"
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/electric_grinder",
			"text": "This device performs the operation of the Grinding recipes from Age 1 and 2, but with electricity!$(p)Unlike the Simple Grinder, this one does not need any blade."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/electric_furnace",
			"text": "This will perform basic Minecraft smelting recipes, but with energy and power!"
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/electric_fluid_mixer",
			"text": "This performs all Fluid Bath and Mixer recipes from Age 1 and 2.$(p)Unlike the Simple Fluid Mixer, this one has an internal capacity for fluid."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/lumber_mill",
			"text": "This will break down logs into more of their corresponding planks, six to be precise. It also has a chance to output some Sawdust as a byproduct!"
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/pneumatic_compressor",
			"anchor": "pneumaticcompressor",
			"text": "This machine will press a variety of things into a variety of other things, depending on what type of $(l:items/molds)Mold$() you have within. Required for making late-game Rods and Plates."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/alloy_smelter",
			"text": "Combines two metals into one alloy metal. For more information, view the guide on the $(l:age3)Electrical Age."
		}
	]
}