{
	"name": "Target Chamber",
	"icon": "qmd:target_chamber_controller",
	"category": "qmd:particle_chambers",
	"sortnum": 1,
	"pages": [
		{
			"type": "text",
			"text": "Target Chambers are where you smash particle beams into a fixed target of material to induce nuclear reactions."
		},
		{
			"title": "Construction",
			"type": "text",
			"text": "Target Chambers are a Cubes of Particle Chamber Casings or Glass. They can be any odd size from 3 to 9 across. They must have only one Particle Chamber Beam Port in input mode but can have from 0 to 3 Beam Ports in output mode. They must have Particle Chamber Energy Port and can have the option of Particle Chamber ports for piping items in and out."
		},
		{
			"title": "Construction",
			"type": "text",
			"text": "In the centre there must be a Particle Chamber Block connected to any Beam Ports via a line of Particle Chamber Beams."
		},
		{
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/empty_target_chamber.png"
            ],
            "text": "Empty 5x5x5 Target chamber without outputs."
        },
		{
			"title": "Detectors",
			"type": "text",
			"text": "Detectors can be place in Target Chambers this increases the efficiency of the chamber which speeds up the process of converting items and can make reactions more efficient. For them to work they need to be place within a certain distance from the Particle Chamber Block shown on their tool tip. Detectors add to the power usage of the target chamber. Note power is used only when the chamber is running."
		},
		{
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/detector_target_chamber.png"
            ],
            "text": "5x5x5 Target chamber with one output Beam Port, one Particle Chamber Port and detectors in it."
        },
		{
			"title": "Outputs",
			"type": "text",
			"text": "There can be 0 to 3 output beams depending on how the Target Chamber is constructed. The Position the outputs is in relation to the input. This determines which beam comes out of which Beam Port. The beams come out 1 to 3 clockwise from the top and correspond top to bottom in the Gui of the Target Chamber. But this can be switched by shift right clicking one of the 2 side beam ports with the multitool. $(bold)The middle output beam will always come out the back$()."
		},
		{
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/outputs_target_chamber.png"
            ],
            "text": "7x7x7 Target Chamber with 3 outputs."
        },
		{
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/target_chamber_gui.png"
            ],
            "text": "Here is an example discussed on the opposite page."
        },
		{
			"title": "Operation",
			"type": "text",
			"text": "A 100 pu/t 10.711 GeV proton beam is being smashed into a Lead Ingot this produces a beam of Protons and Antiprotons each at 92 pu/t 2.065 GeV. It is converting the Lead Ingot into a Lead Spallation Waste. The focus of the output beams is the same as the input beam. To calculate how much the pu/t and energy of the output beams we need to look at the recipe in JEI."
		},
		{
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/target_chamber_jei.png"
            ]
            
        },
		{
			"type": "text",
			"text": "We can see that 1 pu of protons and 1 pu of antiprotons is made. The cross-section of the reaction is 10% and the energy released is -6.58 GeV. To calculate the energy of the beams outputted we do E=(E₀+Q)/n where E₀ is the input particle energy, Q is the energy released and n is the total amount of particles outputted in the recipe."
		},
		{
			"type": "text",
			"text": " In this example we have 1 proton and 1 antiproton so the amount of particles outputted is n=2. Using the formula we get (10.711 GeV + -6.58 GeV)/2 = 2.0655 GeV which is approximately the 2.065 GeV we see."
		},
		{
			"type": "text",
			"text": "To calculate the amount of pu/t each beam has, we use aₒ=aᵢaΣ where aᵢ is the amount of particles inputted, a is the amount said in the recipe and Σ=min(ση,1). σ is the recipe's Cross-Section and η is the chamber's efficiency. In our case for the antiproton beam we have a=1 so 100*1*(0.1*9.25)=92.5 which rounded down is 92 pu/t. "
		},
		{
			"type": "text",
			"text": " $(bold)Note: that Σ is capped at one$(). This is a very important fact when making particle multipliers it means that you can only get more pu/t out than you put in if you have a recipe that outputs more than one particle unit i.e a>1. Our example does not, so we can't make more than protons than we put in."
		}
	]
}