{
	"category": "essentials:witchcraft",
	"name": "Hydroponics Trough",
	"icon": "crossroads:hydroponics_trough",
	"sortnum": 0,
	"priority": false,
	"advancement": "crossroads:progress/path/witchcraft",
	"read_by_default": "true",
	"pages": [
		{
			"type": "patchouli:spotlight",
			"title": "Hydroponics Trough",
			"item": "crossroads:hydroponics_trough",
			"text": "The <item>Hydroponics Trough/$ is a way to automate farming of basically any plant type (or mushroom) other than trees. It is usually less efficient than a dedicated farm purpose-built for the specific plant, but the same <item>hydroponics trough/$ setup can be used for any plant.$(br2)"
		},
		{
			"type": "patchouli:text",
			"text": "It consumes Fertilizer Solution (which is made in a <item>$(l:essentials:witchcraft/formulation_vat)formulation vat/$).$(br2)A single seed of the plant of interest goes in the input slot (it will not be consumed), and the <item>hydroponics trough/$ will consume fertilizer solution to produce the plant.$(br2)Items can only be removed from the output by automation "
		},
		{
			"type": "patchouli:text",
			"text": "while the <item>hydroponics trough/$ has a redstone signal, which opens the <item>hydroponics trough/$. While opened by a redstone signal, any fertilizer solution in the <item>hydroponics trough/$ will be vented, wasting it instantly. As a full tank of fertilizer solution can be expensive, an efficient design will open the <item>hydroponics trough/$ as rarely as possible, and will have as little fertilizer solution "
		},
		{
			"type": "patchouli:text",
			"text": "in the machine as possible when it is opened.$(br2)For most plants (any non-nether, non-underwater, non-fungus plant), they require light. The <item>hydroponics trough/$ will only produce items while it has light level 9 or higher. Artificial light (ex. torchlight) is fine.$(br2)<thing>$(l:essentials/circuits)Circuits/$ measure the fullness of "
		},
		{
			"type": "patchouli:text",
			"text": "the item output slots, as a value from 0 to 15.$(br2)"
		}
	]
}