{
  "name": "The Slime and Its Master",
  "icon": "elementaristics:textures/gui/icons/slimehand.png",
  "category": "vis_vitalis",
  "advancement": "elementaristics:progress_slime",
  "pages": [
    {
      "type": "text",
      "text": "$(l:vitalis/entry_protoplasm)Protoplasmic Slimes$() are, other than being nice slime pets, also able to perform simple tasks. In order to begin creating tasks for a slime, one must first acquire a $(l:shaping/entry_thaumagral)Thaumagral$() of any kind, and press the $(l)$(k:elementaristics_master)$() key. The menu that will appear can be hidden by pressing $(k:elementaristics_master) again. The task list can be cleared by pressing the key while sneaking."
    },
    {
      "type": "text",
      "text": "To create a list of tasks, simply cycle through the available tasks with the $(l)$(k:elementaristics_up)$() or the $(l)$(k:elementaristics_down)$() key and set them. The way a task is set is described on the following pages for each task.$(br2)Each task is also visually represented with particles when the Thaumagral is held; as example, Navigation tasks will connect to each other in orange particles, which turn grey when the distance exceeds the slime's following range."
    },
    {
      "type": "text",
      "title": "Navigate to",
      "text": "This task will command the slime to move towards a certain point. It is set by interacting with the block at the position in question, while having the according mode set. Navigation tasks are represented by orange connected particles, unless the distance is too long."
    },
    {
      "type": "text",
      "title": "Wait",
      "text": "Commands the slime to wait for a certain time in seconds. The time is set by using the Thaumagral while sneaking, which will increase the timer by one second. Once the timer is high enough, the task can be added by using the Thaumagral normally, with the according mode set. Waiting tasks are represented in a very light purple that will dye the previous task."
    },
    {
      "type": "text",
      "title": "Collect",
      "text": "Collecting tasks are set by choosing a block that is an inventory, and interacting with it while sneaking. The slime will take an item stack out of the set block, if possible, otherwise it will keep trying. An item can be held in the off-hand while setting the task to determine what item and which $(t:The amount may be set to an entire stack if the Thaumagral is used while sneaking. This is toggled by doing the same again.)$(marked)$(o)amounts$() should be taken. The task is represented by bright green particles close to the set block."
    },
    {
      "type": "text",
      "title": "Store",
      "text": "This task is set similarly to the Collect task, but it will instead of taking an item from the linked inventory transfer the slime's held item stack into the inventory. If the task is set with a stack, the slime will only transfer the specified amount, and only if the slime holds the specified item."
    },
    {
      "type": "text",
      "text": "Finally, the created task list can be applied to a tamed Protoplasmic Slime by using the Thaumagral on it. The slime's tasks can also be reset by using the Thaumagral while sneaking. One may hit the slime with a Thaumagral to copy its tasks onto the tool, considered that the slimes does have tasks.$(br)Protoplasmic Slimes will stop their tasks if they are forced to sit, but will otherwise not follow their owner. "
    }
  ]
}