{
  "name": "Meditation",
  "category": "vis_vitalis",
  "icon": "minecraft:bed",
  "advancement": "elementaristics:progress_ascension_4",
  "pages": [
    {
      "type": "text",
      "text": "Meditation is a highly beneficial exercise, which can improve both the physical and the mental health of a person. $(br)However, to fully reach the potential of meditation, one might have to break boundaries, as in slaying the $(marked)Silver Thread$()."
    },
    {
      "type": "text",
      "text": "To perform meditation, one must simply sleep in a Bed, at any given time. This will normally cause a boost in health and Magan regeneration. $(br)However, meditation might also move deeper sentiments, given the right influences... This influence being $(marked)intoxication$(), with the best way of achieving it being $(l:alchemy/entry_tincture)Arcane Tincture$(). $(br)These extremely amplified emotions have different effects."
    },
    {
      "type": "text",
      "text": "$(l)Contentment$()$(br)This emotion will, like almost every other emotion, increase the Magan regeneration. It will also increase the jump height, and the walk and mining speed. $(br2)$(l)Dread$()$(br)Dread causes a slightly higher Magan regeneration than Contentment. However, it provokes bad luck and weakness, though it grants slight protection."
    },
    {
      "type": "text",
      "text": "$(l)Ecstasy$()$(br)This emotion fuels the cultist with desire, even thriving in their body's health, though the weakest desire brings no benefits to Magan regeneration at all. For this, a greater power of ecstasy might be required. $(br2)$(l)Fear$()$(br)Fear will set the cultist in a constant state of insecurity, increasing their capabilities in fleeing, but never helping with Magan regeneration."
    },
    {
      "type": "text",
      "text": "$(l)Laughter$()$(br)While not being an emotion in the traditional sense, this sentiment is completely unstoppable, until it ceases on its own. It will immensely increase the regeneration of Magan.$(br2)$(l)Silence$()$(br)Not really being the opposite of laughter, but not really being anything in general, this emotion will prevent all Magan regeneration, but will increase strength and resistance."
    },
    {
      "type": "text",
      "text": "The probability of one of these being applied may be manipulated with certain means, like special $(marked)perfumes$(). However, one can only obtain emotions by meditation when intoxicated, and this counts always."
    }
  ]
}