{
  "category": "hexalia:rituals",
  "name": "Rite of the Verdant Heart",
  "icon": "hexforged:elderwood",
  "sortnum": 9,
  "pages": [
    {
      "type": "patchouli:spotlight",
      "item": "hexforged:elderwood",
      "title": "The Verdant Heart",
      "text": "The Elderwood Heart is a rare and sacred remnant of ancient times. Long ago, Elderwood Guardians roamed the groves, protecting their sacred grounds and blessing travelers who brought them offerings of flowers.$(br)Now, only a few of these hearts remain, hidden deep within the Willows."
    },
    {
      "type": "patchouli:image",
      "images": ["hexforged:textures/gui/elderwood0.png"],
      "title": " ",
      "text": "When used in ritual, the Verdant Heart radiates a powerful aura of natural magic."
    },
    {
      "type": "patchouli:text",
      "title": "The Ritual",
      "text": "Construct a ritual pillar by placing 1 Infused Dirt block in the ground, stacking 2 Willow Logs on top, and placing the Elderwood Heart at the top.$(br)Surround the pillar with 4 Salted Ritual Braziers, positioned three blocks away. Place any type of flower inside each brazier.$(br)With this setup complete, use a Hex Focus on the Elderwood Heart to begin the ritual.$(br)Once activated, right-click the Elderwood Heart with a potion of your choice to infuse its magical aura with the potion's effects."
    },
    {
      "type": "patchouli:image",
      "images": ["hexforged:textures/gui/elderwood1.png"],
      "title": " ",
      "text": " ."
    },
    {
      "type": "patchouli:text",
      "title": "Notes",
      "text": "Once activated, you can right-click the Elderwood Heart with a Hex Focus to deactivate it.$(br)The magical aura's remaining duration is represented by green circular particles — the dimmer they appear, the less time remains.$(br)You can extend the aura's duration by growing crops nearby. The heart will absorb nearby fully-grown crops to replenish its energy if needed."
    },
    {
      "type": "patchouli:image",
      "images": ["hexforged:textures/gui/elderwood2.png"],
      "title": " ",
      "text": " ."
    }
  ]
}
