{
    "type": "manual_content",
    "lang": "en_US",
    "category": "machines",
    "content": [
        {
            "content_type": "heading",
            "text": "Machines",
            "level": 1
        },
        {
            "content_type": "text",
            "text": "The Ancient Warfare Machines are a way to automate most functions in Minecraft, and all of them use Torque as energy to perform its task. The Machines can also be worked on by an appropriate NPC worker. All Machines use a side of the block specific inventory system, since most Machines have multiple inventories, and the side of the block determines which inventory items are going to be located. These Sides can be customized by clicking on the button “Sides” located on the bottom left corner of most Machine GUIs. By default, the “Top” inventory is set to the bottom of the block, the “Middle” inventory is set to the front of the block, and the “Bottom” inventory is set to the top of the block. \nAncient Warfare strives to be compatible with as many mods as possible, and is currently directly compatible with Biomes O’ Plenty’s trees, fruits, and grass (for tilling) , Forestry’s trees, Harvestcrafts fruits, Immersive Engineering’s hemp, Natura’s crops, trees, and fruits, Ore Berries’ fruits, Ore Shrubs’ fruits, Rustic’s trees and fruits, and Random Thing’s fertilized dirt. If you have a mod that AW does not support, please do contact the AW Dev team!"
        },
        {
            "content_type": "image",
            "path": "/images/Sides_GUI1.jpg",
            "width": 764,
            "height": 421
        },
        {
            "content_type": "text",
            "text": "\n\n\n "
        },
        {
            "content_type": "item",
            "name": "ancientwarfareautomation:crop_farm"
        },
        {
            "content_type": "heading",
            "text": "Crop Farm",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Crop Farm plants and harvests all vanilla crops, sugarcane, mushrooms, and cactus, as long as the area within the bounds is properly set up for the particular crops to be planted. The area of the blocks to be tilled / planted / harvested may be adjusted in the ‘Bounds’ adjustment GUI.  Harvested resources will be placed into the upper inventory area.  Seeds to be planted should be inserted into the middle inventory area.  The lower area is reserved for Bonemeal, which will be used to speed the growth of any crops after tilling/planting has been done.  Can use bounds, enchanted tools, and quality tools upgrades."
        },
        {
            "content_type": "text",
            "text": "\n\n\n "
        },
        {
            "content_type": "item",
            "name": "ancientwarfareautomation:fruit_farm"
        },
        {
            "content_type": "heading",
            "text": "Fruit Farm",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Fruit Farm plants and harvests cocoa beans in vanilla, and many modded fruits, such as Harvestcraft’s fruits, as long as the area within the bounds is properly set up for the particular fruits to be planted and harvested. The area of the blocks to be harvested may be adjusted in the ‘Bounds’ adjustment GUI.  Harvested resources will be placed into the upper inventory area.  Seeds to be planted should be inserted into the middle inventory area.  The lower area is reserved for Bonemeal, which will be used to speed the growth of any crops.  Can use bounds, enchanted tools, and quality tools upgrades."
        },
        {
            "content_type": "text",
            "text": "\n\n\n "
        },
        {
            "content_type": "item",
            "name": "ancientwarfareautomation:tree_farm"
        },
        {
            "content_type": "heading",
            "text": "Tree Farm",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Tree Farm plants saplings and harvests logs from grown trees. The blocks to be planted and harvested may be adjusted in the ‘Bounds’ adjustment GUI. Harvested resources will be placed into the upper inventory area.  Saplings to be planted should be inserted into the middle inventory area.  The lower area is reserved for Bonemeal, which will be used to speed the growth of any saplings after planting has been done. Can use bounds, enchanted tools, and quality tools upgrades. The player can customize where the tree farm will plant saplings by clicking the Red squares in the Bounds GUI, turning them Black, and preventing the tree farm from planting there."
        },
        {
            "content_type": "image",
            "path": "/images/Tree_Farm_Bounds1.jpg",
            "width": 453,
            "height": 426
        },
        {
            "content_type": "text",
            "text": "\n "
        },
        {
            "content_type": "item",
            "name": "ancientwarfareautomation:animal_farm"
        },
        {
            "content_type": "heading",
            "text": "Animal Farm",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Animal Farm allows for the automated feeding and harvesting of livestock. The maximum number of allowed adult animals per type is configurable via the “Other” button in the main GUI.  Harvested items are placed into the top inventory area.  Feed items for the animals may be placed into the middle inventory area. The lower inventory can be used for buckets for milking cows, and shears for shearing sheep. Animals will only be fed if there are two adult and breed-ready animals available. Can use bounds, enchanted tools, and quality tools upgrades."
        },
        {
            "content_type": "text",
            "text": "\n\n\n "
        },
        {
            "content_type": "item",
            "name": "ancientwarfareautomation:fish_farm"
        },
        {
            "content_type": "heading",
            "text": "Fish Farm",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Fish Farm provides an automated means for catching fish (all vanilla types) as well as ink.  More water in and below the bounds of the fish farm will result in faster production.  Can enable/disable the catching of fish and/or ink through the “Other” GUI.  Can use bounds, enchanted tools, and quality tools upgrades."
        },
        {
            "content_type": "item",
            "name": "ancientwarfareautomation:quarry"
        },
        {
            "content_type": "heading",
            "text": "Quarry",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Quarry harvests blocks.  By default the Quarry can harvest any block harvestable with a stone pickaxe.  Upgrades are available to harvest harder blocks.  The upper inventory area is where harvested resources will be placed.  The Quarry will remove water source blocks, but will not harvest below lava. The Quarry has a “Height” GUI that can be used to customize the height of the quarry’s bounds, which by default is the Y-height of the quarry.  Can use bounds, enchanted tools, and quality tools upgrades. "
        },
        {
            "content_type": "item",
            "name": "ancientwarfareautomation:auto_crafting"
        },
        {
            "content_type": "heading",
            "text": "Auto Crafting Table",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Auto Crafting Table is a worksite devoted to the automation of crafting.  The Auto Crafting Table has three inventory areas – raw goods storage, recipe layout, and crafting output storage. For every work unit of power input, one item will be crafted and put into the output area.To use the Auto Crafting Table begin by laying out your intended recipe in the recipe grid.  Items in the layout grid will not be used up while crafting, only items from the raw materials inventory area will be used when crafting.  After your recipe is laid out as intended, the item to be produced should show in the output area.  Place any resources needed for crafting the recipe into the raw goods area. The input inventory is the large two rows inventory and is accessible from the Top (Up) side of the Table, while the output inventory is the smaller single row inventory directly below the crafting grid, and is accessible from the Bottom (Down) side of the table."
        },
        {
            "content_type": "item",
            "name": "ancientwarfareautomation:mailbox"
        },
        {
            "content_type": "heading",
            "text": "Mailbox",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Mailboxes serve as a late to end-game item-teleportation system.  Item travel time is determined by distance (20 ticks/block, configurable/60 seconds cross dimension, configurable).  Mailboxes can be flagged for either the ‘public’ network, or a ‘private’ network for each player.  Mailboxes do not require any power input or interaction other than adding items to send and remove items received. Public mailboxes can be interacted with by anyone regardless of team or the owner of the mailbox.  Public mailboxes can send to, and receive from, any other public mailbox.  Everyone can see the full list of public mailbox names, and add/remove names from this list. Private mailboxes can only be interacted with by their owner.  Private mailboxes can only send to and receive from other private mailboxes of the same owner.  Only the owner of a private network can add or remove mailbox names or assign a box a particular private name."
        },
        {
            "content_type": "item",
            "items": [
                {
                    "name": "ancientwarfareautomation:chunk_loader_simple"
                },
                {
                    "name": "ancientwarfareautomation:chunk_loader_deluxe"
                }
            ]
        },
        {
            "content_type": "heading",
            "text": "Chunkloaders",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Chunkloaders force Minecraft to keep specific world chunks loaded and ticking.  This removes the requirement of a player being nearby for the world to be active, but only for those chunks under the effect of the Chunkloader.  This allows for worksites to continue functioning, NPCs to continue doing their thing, and overall for the game to run like normal for affected chunks. The ‘Simple Chunk Loader’ loads a 3x3 chunk area centered on the chunk it is placed in.  The ‘Deluxe Chunk Loader’ has a GUI where you may configure which chunks around it are to be loaded (the top of the GUI denotes north, the chunkloader is in the center).  It may load any chunks in a 5x5 area, up to 25 total chunks."
        },
        {
            "content_type": "item",
            "items": [
                {
                    "name": "ancientwarfareautomation:worksite_upgrade",
                    "data": 0
                },
                {
                    "name": "ancientwarfareautomation:worksite_upgrade",
                    "data": 1
                },
                {
                    "name": "ancientwarfareautomation:worksite_upgrade",
                    "data": 2
                },
                {
                    "name": "ancientwarfareautomation:worksite_upgrade",
                    "data": 3
                },
                {
                    "name": "ancientwarfareautomation:worksite_upgrade",
                    "data": 4
                },
                {
                    "name": "ancientwarfareautomation:worksite_upgrade",
                    "data": 5
                }
            ]
        },
        {
            "content_type": "item",
            "items": [
                {
                    "name": "ancientwarfareautomation:worksite_upgrade",
                    "data": 6
                },
                {
                    "name": "ancientwarfareautomation:worksite_upgrade",
                    "data": 7
                },
                {
                    "name": "ancientwarfareautomation:worksite_upgrade",
                    "data": 8
                },
                {
                    "name": "ancientwarfareautomation:worksite_upgrade",
                    "data": 9
                },
                {
                    "name": "ancientwarfareautomation:worksite_upgrade",
                    "data": 10
                }
            ]
        },
        {
            "content_type": "heading",
            "text": "Bounds Upgrades, Tool Upgrades, Worksite Chunkloaders, and Enchanted Tools upgrade",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The various Machine Upgrades provide bonuses to Machines, and can be placed into most machines by shift right-clicking on the Machines control block. Bounds Upgrades for most machines come in two sizes, Medium, which increases the max bounds to 9x9, and Large, which increases the max bounds to 16x16. All farm type machines can take Bounds Upgrades, which is adjustable in the Bounds screen. The Quarry has its own Bounds Upgrades, which also come in two sizes, Quarry Medium, which increases the max bounds to 32x32, and Quarry Large, which increases the max bounds to 64x64. \nTool Quality Upgrades come in three tiers, Basic, Intermediate, and Advanced, which increase the efficiency of the machine in increasing amounts. When placed in quarries, Basic gives the ability to harvest at an Iron pickaxe level, the Intermediate gives the ability to harvest at a Diamond pickaxe level, and the Advanced gives the ability to harvest any breakable block.  to 25 total chunks. \n There are also Chunkloader upgrades for Machines, which load all chunks that the Machine control block or its bounds intersect, this will allow that Machine to function as normal without any players nearby. Similarly, the Quarry Chunkloader does the same thing for the Quarry. This can be useful for large Quarries. \n The Enchanted Tools Upgrades come in two levels, Lightly Enchanted and Heavily Enchanted, which increase efficiency of the machines increasing amounts (smaller than the Quality Upgrades). The Lightly Enchanted upgrade gives the equivalent of “Looting I” and “Fortune I” for harvesting blocks or killing animals. The Heavily Enchanted upgrade gives the equivalent of “Looting II” and “Fortune II” for harvesting blocks or killing animals."
        }
    ]
}
