{
  "itemGroup.ars_elemental": "Ars Elemental",
  "ars_elemental.perk.summon_power": "Summon Power",
  "ars_elemental.perk.summon_power.desc": "Increases the damage of summoned creatures.",
  "item.ars_elemental.spell_horn": "Enchanter's Horn",
  "item.ars_elemental.fire_focus": "Focus of Fire",
  "item.ars_elemental.water_focus": "Focus of Water",
  "item.ars_elemental.air_focus": "Focus of Air",
  "item.ars_elemental.earth_focus": "Focus of Earth",
  "item.ars_elemental.lesser_fire_focus": "Lesser Focus of Fire",
  "item.ars_elemental.lesser_water_focus": "Lesser Focus of Water",
  "item.ars_elemental.lesser_air_focus": "Lesser Focus of Air",
  "item.ars_elemental.lesser_earth_focus": "Lesser Focus of Earth",
  "item.ars_elemental.necrotic_focus": "Focus of Necromancy",
  "item.ars_elemental.base_bangle": "Enchanter's Bangle",
  "item.ars_elemental.fire_bangle": "Fire Bangle",
  "item.ars_elemental.water_bangle": "Water Bangle",
  "item.ars_elemental.air_bangle": "Air Bangle",
  "item.ars_elemental.earth_bangle": "Earth Bangle",
  "item.ars_elemental.summon_bangle": "Summoner's Bangle",
  "item.ars_elemental.anima_bangle": "Anima Bangle",
  "item.ars_elemental.fire_caster_tome": "Caster Tome of Fire",
  "item.ars_elemental.water_caster_tome": "Caster Tome of Water",
  "item.ars_elemental.air_caster_tome": "Caster Tome of Air",
  "item.ars_elemental.earth_caster_tome": "Caster Tome of Earth",
  "item.ars_elemental.anima_caster_tome": "Caster Tome of Anima",
  "item.ars_elemental.manipulation_caster_tome": "Caster Tome of Manipulation",
  "tooltip.ars_elemental.caster_tome": "Mimics the abilities of a school focus.",
  "item.ars_elemental.siren_shards": "Siren Token",
  "item.ars_elemental.siren_charm": "Siren Charm",
  "item.ars_elemental.firenando_charm": "Flarecannon Charm",
  "item.ars_elemental.curio_bag": "Trinkets Pouch",
  "item.ars_elemental.caster_bag": "Spellcaster Bag",
  "item.ars_elemental.debug": "Focus of Debug",
  "item.ars_elemental.mark_of_mastery": "Mark of Mastery",
  "item.ars_elemental.anima_essence": "Anima Essence",
  "item.ars_elemental.flashpine_pod": "Flashpine",
  "item.ars_elemental.thread_shock": "Shocking",
  "item.ars_elemental.thread_spore": "Spores",
  "item.ars_elemental.thread_summon": "Summoning",
  "item.ars_elemental.arc_prism_lens": "Arc Prism Lens",
  "item.ars_elemental.homing_prism_lens": "Homing Prism Lens",
  "item.ars_elemental.rainbow_prism_lens": "Rainbow Prism Lens",
  "item.ars_elemental.acceleration_prism_lens": "Acceleration Prism Lens",
  "item.ars_elemental.deceleration_prism_lens": "Deceleration Prism Lens",
  "item.ars_elemental.piercing_prism_lens": "Piercing Prism Lens",
  "block.ars_elemental.water_upstream": "Bubble Current Elevator",
  "block.ars_elemental.magma_upstream": "Magmatic Current Elevator",
  "block.ars_elemental.air_upstream": "Slipstream Current Elevator",
  "block.ars_elemental.everfull_urn": "Urn of Endless Waters",
  "block.ars_elemental.mermaid_rock": "Siren Shrine",
  "block.ars_elemental.spell_mirror": "Spell Mirror",
  "block.ars_elemental.advanced_prism": "Advanced Spell Prism",
  "block.ars_elemental.yellow_archwood": "Flashing Archwood Wood",
  "block.ars_elemental.yellow_archwood_log": "Flashing Archwood Log",
  "block.ars_elemental.stripped_yellow_archwood": "Stripped Flashing Archwood Wood",
  "block.ars_elemental.stripped_yellow_archwood_log": "Stripped Flashing Archwood Log",
  "block.ars_elemental.yellow_archwood_sapling": "Flashing Archwood Sapling",
  "block.ars_elemental.yellow_archwood_leaves": "Flashing Archwood Leaves",
  "block.ars_elemental.spore_blossom_up": "Spore Blossom (ground)",
  "block.ars_elemental.fire_turret": "Fire Infused Turret",
  "block.ars_elemental.water_turret": "Water Infused Turret",
  "block.ars_elemental.air_turret": "Air Infused Turret",
  "block.ars_elemental.earth_turret": "Earth Infused Turret",
  "block.ars_elemental.manipulation_turret": "Manipulation Infused Turret",
  "entity.ars_elemental.homing_projectile": "Homing Projectile",
  "entity.ars_elemental.lerp": "Interpolated Source Effect",
  "entity.ars_elemental.summon_skelehorse": "Summoned Skeletal Steed",
  "entity.ars_elemental.summon_camel": "Summoned Camel",
  "entity.ars_elemental.summon_direwolf": "Summoned Direwolf",
  "entity.ars_elemental.summon_vhex": "Summoned Vhex",
  "entity.ars_elemental.summon_wskeleton": "Summoned Revenant",
  "entity.ars_elemental.summon_dolphin": "Summoned Dolphin",
  "entity.ars_elemental.summon_strider": "Summoned Strider",
  "entity.ars_elemental.linger_magnet": "Gravity Well",
  "entity.ars_elemental.siren_entity": "Siren",
  "entity.ars_elemental.siren_familiar": "Siren Familiar",
  "entity.ars_elemental.firenando_entity": "Flarecannon",
  "entity.ars_elemental.firenando_familiar": "Flarecannon Familiar",
  "entity.ars_elemental.fire_mage": "Rogue Fire Mage",
  "entity.ars_elemental.water_mage": "Rogue Water Mage",
  "entity.ars_elemental.air_mage": "Rogue Air Mage",
  "entity.ars_elemental.earth_mage": "Rogue Earth Mage",
  "entity.ars_elemental.flashing_weald_walker": "Flashing Weald Walker",
  "entity.ars_elemental.dripstone_spike": "Earth Spike",
  "entity.ars_elemental.ice_spike": "Ice Spike",
  "key.ars_elemental.open_pouch": "[Elemental] Open trinkets pouch",
  "curios.modifiers.an_focus": "While in spell focus slot:",
  "curios.modifiers.bangle": "While in bangle slot:",
  "curios.identifier.bundle": "Bundle",
  "curios.identifier.bangle": "Bangle",
  "effect.ars_elemental.enderference": "Enderference",
  "effect.ars_elemental.enderference.description": "Makes the target unable to teleport or be teleported.",
  "effect.ars_elemental.watery_grave": "Watery Grave",
  "effect.ars_elemental.watery_grave.description": "Makes the target sink and run out of air quicker.",
  "effect.ars_elemental.mana_shield": "Mana Shield",
  "effect.ars_elemental.mana_shield.description": "Use mana to mitigate damage taken and add a chance to not suffer from negative effects.",
  "effect.ars_elemental.static_charged": "Static Charged",
  "effect.ars_elemental.static_charged.description": "Calls a lightning to hit the afflicted when the duration ends.",
  "effect.ars_elemental.hellfire": "Magic Burn",
  "effect.ars_elemental.hellfire.description": "The magic flames burns even nether creatures making them vulnerable to fire. It slighly increase healing at the cost of losing the invulnerability window when that happens.",
  "effect.ars_elemental.life_link": "Life Linked",
  "effect.ars_elemental.life_link.description": "Caster will split incoming damage with the target and the target will split incoming healing with the caster. Using Cut will dispel the effect on both sides.",
  "effect.ars_elemental.enthralled": "Enthralled",
  "effect.ars_elemental.enthralled.description": "Enthralled mobs won't attack the caster but defend them.",
  "effect.ars_elemental.hymn_of_order": "Hymn of Order",
  "effect.ars_elemental.hymn_of_order.description": "Unobtainable potion, for Admin use. Sets the punished player's mana to 1 and disables spellcasting, greatly reducing their chances to create chaos in the server.",
  "effect.ars_elemental.venom": "Envenomed",
  "effect.ars_elemental.venom.description": "The target is poisoned with a deadly venom and takes more damage from poison spores.",
  "enchantment.ars_elemental.mirror_shield": "Spell Reflection",
  "enchantment.ars_elemental.mirror_shield.desc": "Shield have a chance to reflect projectile spells",
  "enchantment.ars_elemental.soulbound": "Soulbound",
  "enchantment.ars_elemental.soulbound.description": "Preserve items on death.",
  "ars_nouveau.page.elemental_tweaks": "Elemental Tweaks",
  "ars_elemental.page.elemental_tweaks": "As long as Ars Elemental is installed, these tweaks will be active:$(br)Enchanter's Shield can trigger reactive on block.$(br)Summoned Lightnings won't destroy items.$(br)Crush can process items if augmented with Sensitive.$(br)Cold Snap deals more damage to mobs that are freezing.$(br)Ignite melts ice blocks into water.",
  "ars_nouveau.page.flashing_archwood": "Flashing Archwood Trees",
  "ars_elemental.page1.flashing_archwood": "This golden tree has an affinity with the sky. Just like the other archwood trees it can be found anywhere and in their biome. It can be used to make ritual tablets or as a dim light source. The corresponding Weald Walker launches enemies in the air and wind shear them.",
  "ars_elemental.page2.flashing_archwood": "A fruit with a shocking flavour used to brew Static Charge Potions, causing a lightning to fall on the entity when the duration ends or allowing Discharge to hit. The energy stored in the fruit may cause whoever eats it to glow, get night vision, be shocked or charged with static energy.",
  "ars_elemental.page1.spell_horn": "The Enchanter's Horn can be used to cast spells on you and nearby entities. Hold the Horn to increase the range, at max charge it will also give a Spell Damage effect to the player. It MUST be inscribed with a spell that does NOT have another method, using a Scribing Table.",
  "ars_elemental.page.curio_bag": "All those trinkets can easily clutter your inventory, but you never know when they will be useful. Using some magebloom fiber you can make a pouch to store and carry around curios, potion flasks, charms and other small items. You can also open it with $(k:ars_elemental.open_pouch) while in the hotbar or in a curio slot.",
  "ars_elemental.page.caster_bag": "The trinket pouch can only hold rather small things, but with a stronger fiber it seems possible to hold different kind of magical items. The Spellcaster bag can hold any caster tool and the mod's magic armor, arrow and shield. You can also open it with $(k:ars_elemental.open_pouch) while in the hotbar or in a curio slot.",
  "ars_elemental.page1.fire_focus": "This spell focus is attuned to the school of Fire. While equipped, the glyphs of this school will be amplified and discounted. The lesser focus, as a drawback, will weaken glyphs of the other elemental schools. The major focus will also grant Spell Damage II while the wearer is on fire or in lava.",
  "ars_elemental.page2.fire_focus": "This focus empowers Ignite to inflict Magic Burn. This effect allows flare to inflict damage and spread even on fire resistant mobs, it also increases incoming heals but the target will become vulnerable again after healing. Summon Steed will be changed to summon a rideable Strider. Ignite + Evaporate combo will sublimate Ice.",
  "ars_elemental.page1.water_focus": "This spell focus is attuned to the school of Water. While equipped, the glyphs of this school will be amplified and discounted. The lesser focus, as a drawback, will weaken glyphs of the other elemental schools. The major focus will also grant Mana Regen I while the wearer is wet or Mana Regen II and Dolphin Grace while swimming.",
  "ars_elemental.page2.water_focus": "This focus empowers Freeze, adding Freezing seconds to the target. If used after Conjure Water, the conjured water will become ice. Summon Steed will be changed to summon a rideable Dolphin, time your jumps out of the water to build up speed. All Drowning damage against water creatures will be converted to magic.",
  "ars_elemental.page1.air_focus": "This spell focus is attuned to the school of Air. While equipped, the glyphs of this school will be amplified and discounted. The lesser focus, as a drawback, will weaken glyphs of the other elemental schools. The major focus will also grant Mana Regen I while the wearer stands over Y 200 or is under the shocked effect.",
  "ars_elemental.page2.air_focus": "This focus empowers Launch, changing it to apply Levitate when augmented with ExtendTime. It also empower Cut, giving chances to drop an head or skull if it deals the killing blow.",
  "ars_elemental.page1.earth_focus": "This spell focus is attuned to the school of Earth. While equipped, the glyphs of this school will be amplified and discounted. The lesser focus, as a drawback, will weaken glyphs of the other elemental schools. The major focus also grants Mana Regen I while the wearer stand under Y 0.",
  "ars_elemental.page2.earth_focus": "This focus empowers Poison Spores and Grow, dealing damage to undead with a chance of spawning a spore blossom, and Gravity, when augmented with Sensitive, changing it to create a gravity field that pull entities towards its center (filter-compatible), also offers knockback resistance and boosts natural and instant healing by 1.5.",
  "ars_elemental.page1.necrotic_focus": "This school of magic branched out from Conjuration and Abjuration mages that tried to understand life, death and what's between. The essence tied to this school cycles between life and death, experiments suggest that it will make horses cycle between flesh, skeleton and zombie forms, but will it be the same horse as before?",
  "ars_elemental.page2.necrotic_focus": "By imbuing the Focus of Summoning with evil energies, you can corrupt its powers towards Necromancy. Glyphs of the Anima school will get two free ExtendTime, Heal gets two amplify and Charm has way more chance to affect undead mobs. Summon Steed will change in Summon Skeletal Steed, which is able to walk and breathe underwater.",
  "ars_elemental.page3.necrotic_focus": "Summoned Wolves, Undead and Vexes seems unchanged at first, but if they die while the summoner wear this focus they will rise from death once, filled with blood lust. These undead summons will cast Homing spells when you do and heal you every time they kill an enemy.",
  "ars_elemental.page.water_upstream": "This block generates an upstream current that will make surrounding entities in water float upwards as if inside a bubble column, even if they are not in source blocks. Sneaking will allow to descend.",
  "ars_elemental.page.magma_upstream": "This block generates an upstream current that will make surrounding entities in lava float upwards and gain a short Fire Resistance effect. Sneaking will allow to descend",
  "ars_elemental.page.air_upstream": "This block generates an upstream current that will make surrounding entities levitate. Sneaking will give Slowfall and allow to descend. Consumes Source when at least an entity is affected.",
  "ars_elemental.page.everfull_urn": "This magic urn converts Source into water. Link a cauldron or an Apothecary to the urn using a dominion wand and it will be refilled for a cheap amount of source.",
  "ars_elemental.page1.fire_golem": "The Flarecannon can be used as a wandering sentry, like the weald walkers. It will shoot flare homing projectiles at enemies and patrol around the area assigned using the dominion wand. Soul Sand and Magma blocks can be used to change appearance. If defeated, it can be reactivated with blaze powder or magma cream. Friends call it Firenando.",
  "ars_elemental.page1.mermaid": "Sirens are found in warmer seas, jumping out of the water or following boats. You can befriend a wild mermaid by giving them a sea pickle, they will jump and leave behind few tokens. The siren charm can be used to summon a Siren and if used on Prismarine it will transform in a Siren Shrine. Tamed sirens can change colors if you give them kelp or corals.",
  "ars_elemental.page2.mermaid": "The Shrine will slowly generate fishing loot items over time, asking for source after each cycle. The number of items and chance of getting a treasure will increase if many different water animals and plants are near the Shrine. You should build an aquarium or pond around the Shrine, to let your sirens have fun. [Note: it will take some time to update the score].",
  "ars_elemental.page1.advanced_prism": "Upgrade of the Spell Prism that can be adjusted to aim to a specific block. Use the dominion wand to link the prism to a block. This prism also allows lenses, but can't be pushed by pistons. Some lens will require a bit of source whenever a spell is redirected.",
  "ars_elemental.page2.advanced_prism": "A Prism Lens can be applied to this advanced prisms to customize how the prism redirects projectiles. Arc and Homing lenses change the projectile to be an arc or homing projectile. Rainbow lens randomize the color of the projectile, while Acceleration and Deceleration lenses allow to adjust the speed.",
  "ars_elemental.page.spell_mirror": "Mirror similar to a Spell Prism that can be placed on walls, floor and ceiling. If a spell projectile hits the mirror, it will be reflected by with a mirrored angle.",
  "ars_nouveau.page.elemental_turrets": "Elemental Infused Turrets",
  "ars_elemental.page1.elemental_turrets": "Enchanted Turrets can be imbued with the power of an elemental focus to gift them a fractions of its abilities. Spells shot by these turrets will trigger the combos of the corresponding focus and will be discounted by 65 %% if the spell contains a glyph of the matching elemental school.",
  "ars_elemental.page.base_bangle": "This magic accessory has a chance to boost the damage of your spells. Its magic is unstable but perhaps attuning it to a school can stabilize its abilities.",
  "ars_elemental.page1.air_bangle": "This bangle will boost the damage of your Air spells. Your arms sparks with the element, giving a passive boost to speed and attack knockback.",
  "ars_elemental.page1.fire_bangle": "This bangle will boost the damage of your Fire spells. Your arms are engulfed in the element, setting on fire enemies hit and granting a passive boost to speed while in hot biomes.",
  "ars_elemental.page1.earth_bangle": "This bangle will boost the damage of your Earth spells. Plants blossom on your arms, inflicting snare to enemies hit and granting the wearer immunity to cactus and berry bushes and knockback resistance.",
  "ars_elemental.page1.water_bangle": "This bangle will boost the damage of your Water spells. Your arms chills the air around, freezing enemies on every hit. It will also grant the wearer a passive boost to speed in water and rain.",
  "ars_elemental.page1.summon_bangle": "This bangle will boost the damage of your Summoning spells. Your summons follows your arms movement, targeting whatever your hit with increased damage.",
  "ars_elemental.page1.anima_bangle": "This bangle will boost the damage of your Anima spells. You can feel a cycle of life and death in your arms, randomly healing or withering the enemies hit and giving you a small health boost.",
  "ars_elemental.page.book_protection": "This book upgrade will protect your spellbook from all kinds of damage, may it be a cactus or a pool of lava. Can't guarantee on the void. The gold inlays will become netherite-black but you can toggle it off in the client configs.",
  "ars_elemental.perk_desc.thread_shock": "Damaging effects cause the target to be shocked for a short duration before the effect resolves. Inflicts Static Charged at tier 3.",
  "ars_elemental.perk_desc.thread_spore": "Damaging effects cause the target to be poisoned or hungry for a short duration before the effect resolves.",
  "ars_elemental.perk_desc.thread_summon": "Reduce Summon Sickness by 10%% for each tier and slightly increase damage dealt by summoned creatures.",
  "item.ars_elemental.ritual_squirrels": "Fast Squirrels",
  "ars_elemental.ritual_desc.ritual_squirrels": "Gives a long speed boost to Starbuncles in the area. Refresh buff every 30 seconds in a 15 cubes radius. Radius can be augmented to 30 with a gold block",
  "item.ars_elemental.ritual_tesla_coil": "Zapping",
  "ars_elemental.ritual_desc.ritual_tesla_coil": "Calls lightning on entities that approach the ritual area of effect. Will target players if augmented with Air Essence. [11x7x11 cube centered on the brazier].",
  "item.ars_elemental.ritual_repulsion": "Repulsion",
  "ars_elemental.ritual_desc.ritual_repulsion": "Repel all mobs in a 15 block radius. Can be augmented with a bone to repel only undead mobs. Won't work on player and bosses.",
  "item.ars_elemental.ritual_attraction": "Attraction",
  "ars_elemental.ritual_desc.ritual_attraction": "Make the brazier act as a magnet for entities in a 8 blocks radius. Won't work on players and bosses.",
  "item.ars_elemental.ritual_detection": "Detection",
  "ars_elemental.ritual_desc.ritual_detection": "Makes all monsters in a 128 blocks radius glow for 10 minutes.",
  "ars_elemental.enchantment_desc.mirror_shield": "Can only be applied on the Enchanter's Shield. Gives a chance of reflecting spell projectile while blocking with the shield. 25% per level.",
  "ars_elemental.enchantment_desc.soulbound": "Prevent the item enchanted from being lost on death.",
  "item.ars_elemental.siren_familiar": "Bound Script: Siren",
  "ars_elemental.familiar_name.siren_familiar": "Siren",
  "ars_elemental.familiar_desc.siren_familiar": "A Siren Familiar will increase the damage of Water spells by 2. It will also give Dolphin Grace II to the summoner while in water. Obtained by performing the Ritual of Binding near a Siren.",
  "item.ars_elemental.firenando_familiar": "Bound Script: Flarecannon",
  "ars_elemental.familiar_name.firenando_familiar": "Flarecannon",
  "ars_elemental.familiar_desc.firenando_familiar": "A Flarecannon Familiar increases the damage of Fire spells by 2 and reduce projectile-based spells cost by 20%%. You can feed it a Magma Cream to get a short Fire Resistance buff. Obtained by performing the Ritual of Binding near a Flarecannon.",
  "ars_elemental.glyph_name.glyph_discharge": "Discharge",
  "ars_elemental.glyph_desc.glyph_discharge": "Discharge an entity affected by static charge or shocked, damaging it and shocking surrounding enemies. If the damage was triggered by static charge, it will be empowered. If the main target had energy-based armors, some of the energy in it will be absorbed to boost damage.",
  "ars_elemental.glyph_name.glyph_spark": "Spark",
  "ars_elemental.glyph_desc.glyph_spark": "Damages the target with a spark of static energy and shocks it. Deals more damage to wet entities",
  "ars_elemental.glyph_name.glyph_bubble_shield": "Mana Bubble",
  "ars_elemental.glyph_desc.glyph_bubble_shield": "Creates a protective coating that consumes mana to reduce incoming damage. The shield might also prevent debuff to affect the entity and will dissipate if the mana exhausts while defending. The bubble will also shield from magic fire.",
  "ars_elemental.glyph_name.glyph_watery_grave": "Watery Grave",
  "ars_elemental.glyph_desc.glyph_watery_grave": "Dooms a creature to drown. Reduces the target air supply and causes drowning damage when depleted. Similar to gravity the target will sunken down if in water, can be augmented with ExtendTime.",
  "ars_elemental.glyph_name.glyph_conjure_terrain": "Conjure Terrain",
  "ars_elemental.glyph_desc.glyph_conjure_terrain": "Places Dirt or other terrain blocks. Can be augmented with AoE and Pierce to place more blocks, one Amplify to place cobblestone, two for cobbled deepslate, or one of the following combinations: Followed by ConjureWater, it will place Mud. If augmented with Amplify(s) and followed by Smelt, it will place Stone or Deepslate. If followed by Crush it will place Sand or, if amplified, Sandstone.",
  "ars_elemental.glyph_name.glyph_poison_spores": "Poison Spores",
  "ars_elemental.glyph_desc.glyph_poison_spores": "A fog of poison spores erupts from the target, damaging it and causing poison and hunger to spread to nearby entities. It can only damage mobs poisoned or afflicted by hunger.",
  "ars_elemental.glyph_name.glyph_phantom_grasp": "Phantom Grasp",
  "ars_elemental.glyph_desc.glyph_phantom_grasp": "Heals a small amount of health to undead. When used on living beings, the spell will deal an equal amount of magic and exhaustion damage, depleting their saturation or hunger.",
  "ars_elemental.glyph_name.glyph_spike": "Spike",
  "ars_elemental.glyph_desc.glyph_spike": "Creates a spike of dripstone that will damage entities that touch it. Can be augmented with AoE and Pierce to make it wider or taller, with ExtendTime to make it last longer or with Amplify to make it deal more damage.",
  "ars_elemental.glyph_name.glyph_envenom": "Envenom",
  "ars_elemental.glyph_desc.glyph_envenom": "Poisons the target, dealing damage over time. If the target is already poisoned, the poison will become a more deadly venom. An envenomed target takes more damage from poison spores. ",
  "ars_elemental.glyph_name.glyph_homing_projectile": "Homing Projectile",
  "ars_elemental.glyph_desc.glyph_homing_projectile": "This projectile seek the nearest entity and follow it, will behave as a classic projectile while there are no valid targets. Players will only be targeted if augmented by Sensitive.",
  "ars_elemental.glyph_name.glyph_propagator_homing": "Propagate Homing",
  "ars_elemental.glyph_desc.glyph_propagator_homing": "Convert the remainder of the spell into an Homing Projectile and shoot it from where it lands.",
  "ars_elemental.glyph_name.glyph_arc_projectile": "Arc Projectile",
  "ars_elemental.glyph_desc.glyph_arc_projectile": "This projectile is affected by gravity. Every Pierce applied will make it bounce one time when it hit the ground.",
  "ars_elemental.glyph_name.glyph_propagator_arc": "Propagate Arc",
  "ars_elemental.glyph_desc.glyph_propagator_arc": "Convert the remainder of the spell into an Arc Projectile and shoot it from where it lands.",
  "ars_elemental.glyph_name.glyph_aquatic_filter": "Filter: Aquatic",
  "ars_elemental.glyph_desc.glyph_aquatic_filter": "Stops the spell from resolving unless it targets an aquatic creature.",
  "ars_elemental.glyph_name.glyph_not_aquatic_filter": "Filter: Not Aquatic",
  "ars_elemental.glyph_desc.glyph_not_aquatic_filter": "Stops the spell from resolving if it targets an aquatic creature.",
  "ars_elemental.glyph_name.glyph_aerial_filter": "Filter: Aerial",
  "ars_elemental.glyph_desc.glyph_aerial_filter": "Stops the spell from resolving unless it targets an aerial creature.",
  "ars_elemental.glyph_name.glyph_not_aerial_filter": "Filter: Not Aerial",
  "ars_elemental.glyph_desc.glyph_not_aerial_filter": "Stops the spell from resolving if it targets an aerial creature.",
  "ars_elemental.glyph_name.glyph_fiery_filter": "Filter: Fireproof",
  "ars_elemental.glyph_desc.glyph_fiery_filter": "Stops the spell from resolving unless it targets a fire immune or fiery creature.",
  "ars_elemental.glyph_name.glyph_not_fiery_filter": "Filter: Flammable",
  "ars_elemental.glyph_desc.glyph_not_fiery_filter": "Stops the spell from resolving if it targets a fire immune or fiery creature.",
  "ars_elemental.glyph_name.glyph_insect_filter": "Filter: Insect",
  "ars_elemental.glyph_desc.glyph_insect_filter": "Stops the spell from resolving unless it targets an arthropod creature.",
  "ars_elemental.glyph_name.glyph_not_insect_filter": "Filter: Not Insect",
  "ars_elemental.glyph_desc.glyph_not_insect_filter": "Stops the spell from resolving if it targets an arthropod creature.",
  "ars_elemental.glyph_name.glyph_undead_filter": "Filter: Undead",
  "ars_elemental.glyph_desc.glyph_undead_filter": "Stops the spell from resolving unless it targets an undead creature.",
  "ars_elemental.glyph_name.glyph_not_undead_filter": "Filter: Not Undead",
  "ars_elemental.glyph_desc.glyph_not_undead_filter": "Stops the spell from resolving if it targets an undead creature.",
  "ars_elemental.glyph_name.glyph_summon_filter": "Filter: Summon",
  "ars_elemental.glyph_desc.glyph_summon_filter": "Stops the spell from resolving unless it targets a summoned creature.",
  "ars_elemental.glyph_name.glyph_not_summon_filter": "Filter: Not Summon",
  "ars_elemental.glyph_desc.glyph_not_summon_filter": "Stops the spell from resolving if it targets a summoned creature.",
  "ars_nouveau.school.necromancy": "Anima",
  "ars_elemental.glyph_name.glyph_life_link": "Life Link",
  "ars_elemental.glyph_desc.glyph_life_link": "You create a link between your life force and the target's. Any damage dealt to you will be shared with the target and any healing of the target will be shared with you. Cut can sever the life link, ending the effect on both sides.",
  "ars_elemental.glyph_name.glyph_charm": "Charm",
  "ars_elemental.glyph_desc.glyph_charm": "Try to dominate the mind of enemy, making them fight for you as a temporary ally, a tamable mob, to tame it, or a wild animal, to make it fall in love. Each Amplify and damage dealt raises the chance of successfully charming the target, as stronger mobs will have higher resistance to your control.",
  "death.attack.hellflare": "%1$s was burned by magic flames",
  "death.attack.hellflare.item": "%1$s was burned by %2$s with the magic flames of %3$s",
  "death.attack.poison": "%2$s's poison spores blossomed inside %1$s",
  "death.attack.poison.item": "%1$s was poisoned by %2$s using %3$s",
  "death.attack.spark": "%1$s experienced a short circuit",
  "death.attack.spark.item": "%1$s was electrocuted to death by %2$s using %3$s",
  "item.ars_elemental.fire_hat": "Pyromancer's Hat",
  "item.ars_elemental.fire_robes": "Pyromancer's Robes",
  "item.ars_elemental.fire_leggings": "Pyromancer's Leggings",
  "item.ars_elemental.fire_boots": "Pyromancer's Boots",
  "item.ars_elemental.aqua_hat": "Aquamancer's Hat",
  "item.ars_elemental.aqua_robes": "Aquamancer's Robes",
  "item.ars_elemental.aqua_leggings": "Aquamancer's Leggings",
  "item.ars_elemental.aqua_boots": "Aquamancer's Boots",
  "item.ars_elemental.earth_hat": "Geomancer's Hat",
  "item.ars_elemental.earth_robes": "Geomancer's Robes",
  "item.ars_elemental.earth_leggings": "Geomancer's Leggings",
  "item.ars_elemental.earth_boots": "Geomancer's Boots",
  "item.ars_elemental.air_hat": "Aethermancer's Hat",
  "item.ars_elemental.air_robes": "Aethermancer's Robes",
  "item.ars_elemental.air_leggings": "Aethermancer's Leggings",
  "item.ars_elemental.air_boots": "Aethermancer's Boots",
  "ars_elemental.armor_set.shift_info": "Hold %s for set info",
  "ars_elemental.lens.shift_info": "Hold %s for lens info",
  "ars_elemental.lens.arc": "Convert the redirected projectile in an Arc Projectile.",
  "ars_elemental.lens.homing": "Convert the redirected projectile in an Homing Projectile. The targeting filters of the original projectile won't be inherited.",
  "ars_elemental.lens.rgb": "Makes the redirected projectile cycle colors.",
  "ars_elemental.lens.acceleration": "Increase the speed of the redirected projectile.",
  "ars_elemental.lens.deceleration": "Decrease the speed of the redirected projectile.",
  "ars_elemental.lens.pierce": "Makes the redirected projectile pierce through more blocks/entities if source is supplied to the prism.",
  "ars_elemental.page.armor_set.wip": "Note: Since the Armor Rework requires a lot of assets work, the light and heavy elemental armors variants won't be ready for 1.19, so the 'medium' elemental armors can be crafted will all three types. Upgrading will keep enchants and threads, but requires the base armor to be at tier 3.",
  "ars_elemental.armor_set.fire": "Pyromancer's Set",
  "ars_elemental.armor_set.fire.desc": "Absorb some fire-related damage and convert into mana, instantly clears fire.",
  "ars_elemental.armor_set.aqua": "Aquamancer's Set",
  "ars_elemental.armor_set.aqua.desc": "Absorb some water-related damage and convert into mana, refill air if about to drown.",
  "ars_elemental.armor_set.earth": "Geomancer's Set",
  "ars_elemental.armor_set.earth.desc": "Absorb some earth-related damage and convert into mana, gives food deep underground if about to starve.",
  "ars_elemental.armor_set.air": "Aethermancer's Set",
  "ars_elemental.armor_set.air.desc": "Absorb some air-related damage and convert into mana, highly reduce fall damage.",
  "ars_elemental.page.armor_set.fire": "Attuned to the School of Fire, each piece of this armor will amplify fire glyphs, make them cheaper, and reduce damage related to fire, like lava, dragon breath and magma.$(br)When all the pieces are equipped, the damage reduced is converted into mana and fire is immediately put out.",
  "ars_elemental.page.armor_set.aqua": "Attuned to the School of Water, each piece of this armor will amplify water glyphs, make them cheaper and reduce damage related to water, like drowning, freezing and lightning.$(br)When all the pieces are equipped, the damage reduced is converted into mana and refill air if about to drown.",
  "ars_elemental.page.armor_set.air": "Attuned to the School of Air, each piece of this armor will amplify air glyphs, make them cheaper and reduce damage related to air, like falling, hitting walls while flying and lightning.$(br)When all the pieces are equipped, the damage reduced is converted into mana, falling won't be a problem anymore!.",
  "ars_elemental.page.armor_set.earth": "Attuned to the School of Earth, each piece of this armor will amplify earth glyphs, make them cheaper and reduce damage related to earth, like starving, berry bushes, cactus and crushing.$(br)When all the pieces are equipped, the damage reduced is converted into mana and gives food deep underground if about to starve.",
  "ars_elemental.thread_of": "Thread of %s",
  "ars_elemental.tablet_of": "Tablet of %s",
  "tooltip.siren_shards": "Obtained by giving a sea pickle to a siren.",
  "tooltip.ars_elemental.lens": "Can be applied on Advanced Spell Prisms.",
  "tooltip.ars_nouveau.blessed": "Protection of the 4 elements",
  "ars_elemental.focus.shift_info": "Hold %s for more focus info",
  "tooltip.ars_elemental.focus_element": "Focus attuned to a specific element, empowers some glyphs with new effects.",
  "tooltip.ars_elemental.focus_boost": "Amplifies and discount glyphs of the %s school.",
  "tooltip.ars_elemental.focus_malus": "Dampens glyphs of the other elemental schools.",
  "tooltip.ars_elemental.focus_element_mana.air": "Grants Mana Regen I while the wearer is high in the sky.",
  "tooltip.ars_elemental.focus_element_mana.fire": "Grants Spell Damage II while the wearer is on fire or in lava.",
  "tooltip.ars_elemental.focus_element_mana.water": "Grants Mana Regen I while the wearer is wet, Mana Regen II and Dolphin Grace while swimming.",
  "tooltip.ars_elemental.focus_element_mana.earth": "Grants Mana Regen I while the wearer is deep underground.",
  "tooltip.ars_elemental.focus_anima": "Entities summoned will raise from death once as a more powerful version. These revenant will mirror your homing spells and heal you when they kill an enemy.",
  "tooltip.ars_elemental.bags": "Can be opened with %s while in the hotbar or in a curio slot.",
  "item.minecraft.splash_potion.effect.enderference_potion_strong": "Splash Potion of Enderference",
  "item.minecraft.splash_potion.effect.enderference_potion": "Splash Potion of Enderference",
  "item.minecraft.splash_potion.effect.enderference_potion_long": "Splash Potion of Enderference",
  "item.minecraft.potion.effect.enderference_potion_strong": "Potion of Enderference",
  "item.minecraft.potion.effect.enderference_potion": "Potion of Enderference",
  "item.minecraft.potion.effect.enderference_potion_long": "Potion of Enderference",
  "item.minecraft.lingering_potion.effect.enderference_potion_strong": "Lingering Potion of Enderference",
  "item.minecraft.lingering_potion.effect.enderference_potion": "Lingering Potion of Enderference",
  "item.minecraft.lingering_potion.effect.enderference_potion_long": "Lingering Potion of Enderference",
  "item.minecraft.tipped_arrow.effect.enderference_potion_strong": "Arrow of Enderference",
  "item.minecraft.tipped_arrow.effect.enderference_potion": "Arrow of Enderference",
  "item.minecraft.tipped_arrow.effect.enderference_potion_long": "Arrow of Enderference",
  "item.minecraft.splash_potion.effect.shock_potion_potion_strong": "Splash Potion of Static Charge",
  "item.minecraft.splash_potion.effect.shock_potion": "Splash Potion of Static Charge",
  "item.minecraft.splash_potion.effect.shock_potion_long": "Splash Potion of Static Charge",
  "item.minecraft.potion.effect.shock_potion_strong": "Potion of Static Charge",
  "item.minecraft.potion.effect.shock_potion": "Potion of Static Charge",
  "item.minecraft.potion.effect.shock_potion_long": "Potion of Static Charge",
  "item.minecraft.lingering_potion.effect.shock_potion_strong": "Lingering Potion of Static Charge",
  "item.minecraft.lingering_potion.effect.shock_potion": "Lingering Potion of Static Charge",
  "item.minecraft.lingering_potion.effect.shock_potion_long": "Lingering Potion of Static Charge",
  "item.minecraft.tipped_arrow.effect.shock_potion_strong": "Arrow of Static Charge",
  "item.minecraft.tipped_arrow.effect.shock_potion": "Arrow of Static Charge",
  "item.minecraft.tipped_arrow.effect.shock_potion_long": "Arrow of Static Charge",
  "ars_nouveau.connections.fail.urn": "This block is not compatible with the urn.",
  "ars_elemental.adv.title.siren_charm": "Not a Manatee",
  "ars_elemental.adv.desc.siren_charm": "Acquire a Siren Charm",
  "ars_elemental.adv.title.firenando_charm": "They call me Firenando Mc Cannon",
  "ars_elemental.adv.desc.firenando_charm": "Acquire a Flarecannon Charm",
  "ars_elemental.adv.title.lesser_air_focus": "The way of Air",
  "ars_elemental.adv.desc.lesser_air_focus": "Acquire a lesser focus of Air",
  "ars_elemental.adv.title.air_focus": "Master of Air",
  "ars_elemental.adv.desc.air_focus": "Acquire a major focus of Air",
  "ars_elemental.adv.title.lesser_fire_focus": "The way of Fire",
  "ars_elemental.adv.desc.lesser_fire_focus": "Acquire a lesser focus of Fire",
  "ars_elemental.adv.title.fire_focus": "Master of Fire",
  "ars_elemental.adv.desc.fire_focus": "Acquire a major focus of Fire",
  "ars_elemental.adv.title.lesser_earth_focus": "The way of Earth",
  "ars_elemental.adv.desc.lesser_earth_focus": "Acquire a lesser focus of Earth",
  "ars_elemental.adv.title.earth_focus": "Master of Earth",
  "ars_elemental.adv.desc.earth_focus": "Acquire a major focus of Earth",
  "ars_elemental.adv.title.lesser_water_focus": "The way of Water",
  "ars_elemental.adv.desc.lesser_water_focus": "Acquire a lesser focus of Water",
  "ars_elemental.adv.title.water_focus": "Master of Water",
  "ars_elemental.adv.desc.water_focus": "Acquire a major focus of Water",
  "ars_elemental.adv.title.curio_bag": "Never ask a mage what's in their bag",
  "ars_elemental.adv.title.necrotic_focus": "A corrupted summoning",
  "ars_elemental.adv.desc.necrotic_focus": "Acquire a Necromancy focus",
  "ars_elemental.adv.desc.curio_bag": "Acquire a Trinkets Pouch",
  "ars_elemental.adv.title.caster_bag": "Your portable arsenal",
  "ars_elemental.adv.desc.caster_bag": "Acquire a Spellcaster Bag",
  "ars_elemental.adv.title.spore_blossom": "A Blooming Death",
  "ars_elemental.adv.desc.spore_blossom": "Obtain a Spore Blossom by killing an undead with Grow or Poison Spores",
  "ars_elemental.adv.title.mark_of_mastery": "Elemental Maestro",
  "ars_elemental.adv.desc.mark_of_mastery": "Combine the essences with the tribute and obtain the Mark of Mastery",
  "ars_elemental.adv.title.summon_dolphin": "Your personal submarine",
  "ars_elemental.adv.desc.summon_dolphin": "Summon a dolphin using Summon Steed wearing a water focus",
  "ars_elemental.adv.title.summon_strider": "It's Striding Time",
  "ars_elemental.adv.desc.summon_strider": "Summon a strider using Summon Steed wearing a fire focus",
  "ars_elemental.adv.title.summon_skeleton_horse": "The Harbinger",
  "ars_elemental.adv.desc.summon_skeleton_horse": "Summon a skeleton horse using Summon Steed wearing a necromancy focus",
  "ars_elemental.adv.title.everfull_urn": "Filled with tears of Nostalgia",
  "ars_elemental.adv.desc.everfull_urn": "Acquire an Urn of Endless Waters",
  "ars_elemental.adv.title.levitation": "It's Shulkèr, not Shulkeér",
  "ars_elemental.adv.desc.levitation": "Use Launch + Extend Time while wearing an air focus to make a mob levitate",
  "ars_elemental.adv.title.mirror_shield": "Feeling like a Prism",
  "ars_elemental.adv.desc.mirror_shield": "Reflect a spell projectile using a spell reflection shield",
  "ars_elemental.adv.title.x": "",
  "ars_elemental.adv.desc.x": ""
}
