{
  "name": "Curses",
  "icon": "arsomega:curse_altar",
  "category": "arsomega:demon_realm",
  "advancement": "arsomega:better_forgotten",
  "pages": [
    {
      "type": "text",
      "text": "Note: some of the mod features described in this section might change later, the curse system is still WIP."
    },
    {
      "type": "spotlight",
      "item": "arsomega:curse_altar",
      "text": "The curse altar is found in a large temple structure in the demon realm. It is required for creating curses.",
      "link_recipe": "true"
    },
    {
      "type": "text",
      "text": "Creating a curse can be done in 3 simple steps. First, the curse recipe is put together. This is done by adding any valid curse ingredient to the cauldron. You can only add up to 5 different ingredients, and up to 10 total ingredients to a curse. During this step, you can also add an enchanted mirror shard to make the curse much stronger, but make it affect the creator (you) as well."
    },
    {
      "type": "text",
      "text": "The second step is to finalize the curse, making it impossible to add new ingredients but allowing you to cast it. This can be done by using a demonic gem on the cauldron."
    },
    {
      "type": "text",
      "text": "The third step is to actually apply the curse. Curses can be applied telepathically, by using a needle with the target's blood. However, this makes it INCREDIBLY weak. Instead, it's much more effective to apply the curse on a food item and trick the target into consuming it. Traditionally an apple is used, but any food item will work."
    },
    {
      "type": "text",
      "text": "The following pages will list various ingredients, as well as their effects on a curse."
    },
    {
      "type": "spotlight",
      "item": "minecraft:spider_eye",
      "text": "Will add 2 damage to the curse. Max 2."
    },
    {
      "type": "spotlight",
      "item": "minecraft:fermented_spider_eye",
      "text": "Will add 3 damage to the curse, and make it apply a bit of poison."
    },
    {
      "type": "spotlight",
      "item": "minecraft:bone",
      "text": "Will add 3 damage to the curse."
    },
    {
      "type": "spotlight",
      "item": "minecraft:rotten_flesh",
      "text": "Will add 3 damage to the curse."
    },
    {
      "type": "spotlight",
      "item": "arsomega:poison_flower",
      "text": "Will add a lot of poison to the curse. Max 5."
    },
    {
      "type": "spotlight",
      "item": "minecraft:wither_rose",
      "text": "Will add wither to the curse. "
    },
    {
      "type": "spotlight",
      "item": "minecraft:glistering_melon_slice",
      "text": "Will add weak regeneration to the curse."
    },
    {
      "type": "spotlight",
      "item": "arsomega:life_essence",
      "text": "Will add regeneration to the curse."
    },
    {
      "type": "spotlight",
      "item": "minecraft:gunpowder",
      "text": "Will weakly increase the effect of all harming items on the curse. Stacks with other such items."
    },
    {
      "type": "spotlight",
      "item": "minecraft:ghast_tear",
      "text": "Will strongly increase the effect of all harming items on the curse. Stacks with other such items."
    },
    {
      "type": "spotlight",
      "item": "minecraft:coal",
      "text": "Will slightly DECREASE the effect of all harming items on the curse. Stacks with other such items."
    },
    {
      "type": "spotlight",
      "item": "arsomega:gorgon_gem",
      "text": "Will temporarily petrify the curse's target."
    },
    {
      "type": "spotlight",
      "item": "arsomega:sigil_binding_active",
      "text": "Will temporarily petrify the curse's target. Can be combined with at least 5 gorgon gems to become permanent. "
    }
  ]
}