{  "name": "Familiar, Answered Queries",  "icon": "minecraft:redstone",  "category": "thermal:guides",  "sortnum": -3,  "read_by_default": true,  "pages": [    {      "type": "text",      "text": "Q: Where is Dynamics/pipes?$(br)A: Read $(l:thermal:storage_and_transport/dynamics)this$(/l).$(br2)Q: Where are upgrade kits?$(br)A: Read $(l:thermal:technology/augments/integral_components)this$(/l).$(br2)Q: How can I increase the speed of my machines? $(br)A: Read $(l:thermal:technology/augments/integral_components)this$(/l) and $(l:thermal:technology/augments/machine_speed)this$(/l).$(br2)Q: Do these augments stack?$(br)A: Read $(l:thermal:technology/augments/introduction)this$(/l)."    },    {      "type": "text",      "text": "Q: How can I change fluxbore/saw mode? $(br)A: You need to install $(l:thermal:technology/augments/area_radius)radius augments$(/l) in order to adjust the mining radius.$(br2)Q: How do I charge/augment my tools?$(br)A: Read $(l:thermal:technology/tinker_bench)this$(/l).$(br2)Q: Why is my dynamo slowly losing RF?$(br)A: The RF buffer in dynamos is only meant to determine how much to throttle the dynamo. Read $(l:thermal:technology/dynamos/introduction)this$(/l) for more information."    },    {      "type": "text",      "text": "Q: Where are the basic tools/weapons/armor from Thermal, like the diamond excavator and electrum bow? $(br)A: These were not added to 1.16 because they were considered somewhat bloat-y. They may come back in the future, either in a limited capacity or as a separate mod.$(br2)Q: Can x mod get support (recipes, etc)?$(br)A: You can request compatibility in our $(l:thermal:links/discord)discord server$(/l)."    },    {      "type": "text",      "text": "Q: What happened to platinum, steel, mana-infused, etc?$(br)A: For various reasons, these were considered unnecessary to include in Thermal Foundation. If some come back, it will be in a separate compatibility mod.$(br2)Q: What happened to gelid cryotheum, resonant ender, etc?$(br)A: Some will be coming back eventually, but not until Forge resolves some of its issues with fluids."    },    {      "type": "text",      "text": "Q: How can I modify oregen? $(br)A: The config has options to en/disable oregen, but adjustments to details such as spawn height have not yet been implemented.$(br2)Q: How do I change configs?$(br)A: Configs are now created on a per-save basis; find them in the serverconfigs folder in the save file. You can also set default configs by copying the files from the serverconfigs folder into the defaultconfigs folder and editing them."    },    {      "type": "text",      "text": "Q: Where and how can I report a bug? $(br)A: You can ask in our $(l:thermal:links/discord)discord server$(/l). Before reporting, ensure that your mods are up to date and you do not have Optifine installed.$(br2)Q: How can I change recipes?$(br)A: Thermal mods are all data-driven, so you can use datapacks to modify recipes, as shown $(l:thermal:guides/modpack/recipes)here$(/l). Alternatively, the Thermal mods have CraftTweaker support."    }  ]}