{
  "name": "Conveyor Upgrades",
  "icon": "industrialforegoing:conveyor_extraction_upgrade",
  "category": "industrialforegoing:transport",
  "sortnum": 1,
  "read_by_default": true,
  "pages": [
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_extraction_upgrade",
      "title": "Extraction",
      "text": "Extracts items and fluids from inventories. It can extract items from player inventories too. $(br2)Items and fluids that need to be extracted can be filtered in the gui."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_insertion_upgrade",
      "title": "Insertion",
      "text": "Inserts items and fluids to inventories. It has 2 modes, insert items that touch the conveyor or insert items that directly touch the upgrade. $(br2)Items and fluids that need to be inserted can be filtered in the gui."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_detection_upgrade",
      "title": "Detection",
      "text": "Detects items and entities that are on top of the conveyor. $(br2)Items and entities that need to be detected can be filtered in the gui. Entities can be filtered using a MIB with the entity inside."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_bouncing_upgrade",
      "title": "Bouncing",
      "text": "Launches items and entites that are on top of the conveyor. The vertical and horizontal strength can be changed in the GUI.$(br2)Items and entities that need to be launched can be filtered in the gui. Entities can be filtered using a MIB with the entity inside."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_dropping_upgrade",
      "title": "Dropping",
      "text": "Drops items and entites that are on top of the conveyor directly below it. $(br2)Items and entities that need to be dropped can be filtered in the gui. Entities can be filtered using a MIB with the entity inside."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_blinking_upgrade",
      "title": "Blinking",
      "text": "Teleports items and entites that are on top of the conveyor. The vertical and horizontal distance can be changed in the GUI.$(br2)Items and entities that need to be launched can be filtered in the gui. Entities can be filtered using a MIB with the entity inside."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_splitting_upgrade",
      "title": "Splitting",
      "text": "Splits items and entites that are on top of the conveyor with the ratio defined in the GUI. It needs upgrades in all the sides that need be distributed."
    }
  ]
}
