{
  "sodium.option_impact.low": "Bajo",
  "sodium.option_impact.medium": "Medio",
  "sodium.option_impact.high": "Alto",
  "sodium.option_impact.extreme": "Extremo",
  "sodium.option_impact.varies": "Varía",
  "sodium.options.pages.quality": "Calidad",
  "sodium.options.pages.performance": "Rendimiento",
  "sodium.options.pages.advanced": "Avanzado",
  "sodium.options.view_distance.tooltip": "La distancia de renderizado controla la distancia a la que se renderizará el terreno. Las distancias más cortas significan que se renderizará menos terreno, lo que mejora la velocidad de fotogramas.",
  "sodium.options.simulation_distance.tooltip": "La distancia de simulación controla la distancia a la que se cargarán y marcarán el terreno y las entidades. Las distancias más cortas pueden reducir la carga del servidor interno y pueden mejorar la velocidad de fotogramas.",
  "sodium.options.brightness.tooltip": "Controla el brillo (gamma) del juego.",
  "sodium.options.gui_scale.tooltip": "Establece el factor de escala máximo que se utilizará para la interfaz de usuario. Si se utiliza 'auto', siempre se utilizará el factor de escala más grande.",
  "sodium.options.fullscreen.tooltip": "Si se activa, el juego se mostrará en pantalla completa (si es compatible).",
  "sodium.options.v_sync.tooltip": "Si se activa, la velocidad de fotogramas del juego se sincronizará con la frecuencia de refresco del monitor, lo que hará que la experiencia sea más fluida a expensas de la latencia de entrada general. Este ajuste puede reducir el rendimiento si tu sistema es demasiado lento.",
  "sodium.options.fps_limit.tooltip": "Limita el número máximo de fotogramas por segundo. Esto puede ayudar a reducir el uso de la batería y la carga general del sistema cuando se realiza una multitarea. Si V-Sync está activado, esta opción se ignorará a menos que sea inferior a la frecuencia de refresco de tu pantalla.",
  "sodium.options.view_bobbing.tooltip": "Si está activada, la vista del jugador se balanceará y oscilará cuando se mueva. Los jugadores que experimenten mareos al jugar pueden beneficiarse de desactivar esta opción.",
  "sodium.options.attack_indicator.tooltip": "Controla dónde se muestra el indicador de ataque en la pantalla.",
  "sodium.options.autosave_indicator.tooltip": "Si se activa, se mostrará un indicador cuando el juego esté guardando el mundo en el disco.",
  "sodium.options.graphics_quality.tooltip": "La calidad gráfica por defecto controla algunas opciones heredadas y es necesaria para la compatibilidad de los mods. Si las opciones de abajo se dejan en \"Default\", utilizarán esta configuración.",
  "sodium.options.clouds_quality.tooltip": "Controla la calidad de las nubes renderizadas en el cielo.",
  "sodium.options.weather_quality.tooltip": "Controla la calidad de los efectos de lluvia y nieve.",
  "sodium.options.leaves_quality.name": "Calidad de las Hojas",
  "sodium.options.leaves_quality.tooltip": "Controla la calidad de las hojas.",
  "sodium.options.particle_quality.name": "Calidad de las Partículas",
  "sodium.options.particle_quality.tooltip": "Controla el número máximo de partículas que pueden estar presentes en la pantalla en un momento dado.",
  "sodium.options.smooth_lighting.tooltip": "Controla si los bloques serán iluminados y sombreados suavemente. Esto aumenta ligeramente el tiempo necesario para reconstruir un trozo, pero no afecta a la velocidad de fotogramas.",
  "sodium.options.biome_blend.value": "%s bloque(s)",
  "sodium.options.biome_blend.tooltip": "Controla el rango que los biomas serán muestreados para la coloración de los bloques. Los valores más altos aumentan en gran medida la cantidad de tiempo que se necesita para construir trozos para disminuir las mejoras en la calidad.",
  "sodium.options.entity_distance.tooltip": "Controla la distancia a la que se pueden renderizar las entidades desde el jugador. Los valores más altos aumentan la distancia de renderizado a expensas de la velocidad de fotogramas.",
  "sodium.options.entity_shadows.tooltip": "Si está activada, las sombras básicas se mostrarán debajo de los monstruos y otras entidades.",
  "sodium.options.vignette.name": "Viñeta",
  "sodium.options.vignette.tooltip": "Si se habilita, se renderizará un efecto de viñeta en la vista del jugador. Es muy poco probable que esto suponga una diferencia en la tasa de fotogramas, a menos que la tasa de llenado sea limitada.",
  "sodium.options.mipmap_levels.tooltip": "Controla el número de mipmaps que se utilizarán para las texturas del modelo de bloques. Los valores más altos proporcionan un mejor renderizado de los bloques en la distancia, pero pueden afectar negativamente al rendimiento con muchas texturas animadas.",
  "sodium.options.use_block_face_culling.name": "Usar eliminación selectiva de caras de bloques",
  "sodium.options.use_block_face_culling.tooltip": "Si se activa, sólo se enviarán a renderizar las caras de los bloques que estén orientadas hacia la cámara. Esto puede eliminar un gran número de caras de bloques muy pronto en el proceso de renderizado, ahorrando ancho de banda de memoria y tiempo en la GPU. Algunos paquetes de recursos pueden tener problemas con esta opción, así que prueba a desactivarla si ves agujeros en los bloques.",
  "sodium.options.use_fog_occlusion.name": "Usar Oclusión de Niebla",
  "sodium.options.use_fog_occlusion.tooltip": "Si se activa, los trozos que se determinan como totalmente ocultos por los efectos de niebla no se renderizarán, lo que ayuda a mejorar el rendimiento. La mejora puede ser más dramática cuando los efectos de niebla son más pesados (como cuando se está bajo el agua), pero puede causar artefactos visuales indeseables entre el cielo y la niebla en algunos escenarios.",
  "sodium.options.use_entity_culling.name": "Usar Eliminación de Entidades",
  "sodium.options.use_entity_culling.tooltip": "Si se activa, las entidades que se determinen que no están en ningún trozo visible se omitirán durante el renderizado. Esto puede ayudar a mejorar el rendimiento al evitar la renderización de las entidades situadas bajo tierra o detrás de las paredes.",
  "sodium.options.use_particle_culling.name": "Utilice la Eliminación de Partículas",
  "sodium.options.use_particle_culling.tooltip": "Si se activa, sólo se renderizarán las partículas que se determinen como visibles. Esto puede proporcionar una mejora significativa en la velocidad de fotogramas cuando hay muchas partículas cerca.",
  "sodium.options.animate_only_visible_textures.name": "Animar Sólo las Texturas Visibles",
  "sodium.options.animate_only_visible_textures.tooltip": "Si se activa, sólo se actualizarán las texturas animadas que sean visibles. Esto puede proporcionar un aumento significativo de la velocidad de fotogramas en algunos equipos, especialmente con paquetes de recursos más pesados. Si tienes problemas con algunas texturas que no se animan, prueba a desactivar esta opción.",
  "sodium.options.cpu_render_ahead_limit.name": "Límite de Procesamiento Anticipado de CPU",
  "sodium.options.cpu_render_ahead_limit.tooltip": "Especifica el número máximo de fotogramas que la CPU puede esperar a que la GPU termine de renderizar. Los valores muy bajos o altos pueden crear inestabilidad en la tasa de fotogramas.",
  "sodium.options.cpu_render_ahead_limit.value": "%s fotograma(s)",
  "sodium.options.allow_direct_memory_access.name": "Permitir Aacceso Directo a la Memoria",
  "sodium.options.allow_direct_memory_access.tooltip": "Si se activa, se permitirá que algunas rutas de código críticas utilicen el acceso directo a la memoria para mejorar el rendimiento. Esto suele reducir en gran medida la sobrecarga de la CPU para el renderizado de trozos y entidades, pero puede dificultar el diagnóstico de algunos fallos y caídas. Sólo deberías desactivar esto si te lo han pedido o si sabes lo que estás haciendo.",
  "sodium.options.enable_memory_tracing.name": "Habilitar Seguimiento de Memoria",
  "sodium.options.enable_memory_tracing.tooltip": "Función de depuración. Si está activada, se recogerán los rastros de pila junto con las asignaciones de memoria para ayudar a mejorar la información de diagnóstico cuando se detecten fugas de memoria.",
  "sodium.options.performance_impact_string": "Impacto en el Rendimiento: %s",
  "sodium.options.use_persistent_mapping.name": "Utilizar el Mapeo Persistente",
  "sodium.options.use_persistent_mapping.tooltip": "Si se activa, una pequeña cantidad de memoria será mapeada de forma persistente para acelerar las actualizaciones de chunk y el renderizado de entidades.\n\nRequiere OpenGL 4.4 o ARB_buffer_storage.",
  "sodium.options.chunk_memory_allocator.name": "Asignador de Memoria de Chunks",
  "sodium.options.chunk_memory_allocator.tooltip": "Selecciona el asignador de memoria que se utilizará para el renderizado de los trozos.\n- ASYNC: Opción más rápida, funciona bien con la mayoría de los controladores gráficos modernos.\n- SWAP: Opción de reserva para los controladores gráficos más antiguos. Puede aumentar significativamente el uso de la memoria.",
  "sodium.options.chunk_memory_allocator.async": "Async",
  "sodium.options.chunk_memory_allocator.swap": "Intercambiar",
  "sodium.options.chunk_update_threads.name": "Subprocesos de Actualización de Chunks",
  "sodium.options.chunk_update_threads.tooltip": "Especifica el número de hilos que se van a utilizar para la construcción de los trozos. El uso de más hilos puede acelerar la carga de trozos y la velocidad de actualización, pero puede afectar negativamente a los tiempos de fotogramas.",
  "sodium.options.always_defer_chunk_updates.name": "Aplazar Siempre las Actualizaciones de Chunks",
  "sodium.options.always_defer_chunk_updates.tooltip": "Si se activa, el renderizado nunca esperará a que terminen las actualizaciones de los chunk, incluso si son importantes. Esto puede mejorar mucho la velocidad de fotogramas en algunos escenarios, pero puede crear un retraso visual significativo en el mundo.",
  "sodium.options.buttons.undo": "Deshacer",
  "sodium.options.buttons.apply": "Aplicar",
  "sodium.options.buttons.donate": "¡Compra café para JellySquid!"
}
