{
  "name": "Corpse Bloom",
  "icon": "srpcotesia:textures/book/bloom.png",
  "category": "vagrant",
  "priority": true,
  "pages": [
    {
      "type": "text",
      "text": "From varied sightings of active Vagrants in the [REDACTED] region, it was deduced that their appearance, and as a result, capabilities, varied greatly from instance to instance. Our repeated interviews with Subject #5, however, have shown that this is an expression of what I have coined as the 'Corpse Bloom', a system where Vagrants can 'evolve' through furthering parasite evolution."
    },
    {
      "type": "text",
      "text": "After restraining and heavy sedation, Subject #5 described a need spread Call of the Hive, and to kill, and I quote, 'as many hostiles as possible'. I hypothesized, and with further sessions with a sedated Subject #5 verified, that practices such as these are what allow them to evolve. It is likely that this mirrors the process by which Primitive versions become their Adapted version counterparts."
    },
    {
      "type": "image",
      "images": ["srpcotesia:textures/book/bloom_sketch.png"],
      "text": "A sketch Subject #5 produced when prompted about evolution."
    },
    {
      "type": "text",
      "text": "The internal structures of a Vagrant seem to always feature a special organ which seems to emulate the sketch, indicating that Vagrants are not only aware of their internals, but the path of their evolution as well. As for how much contribution a Vagrant needs to perform, it appears to increase as their stage, or $(1)Tier$() as I will henceforth call it, increases. It appears that Vagrants are aware of how much progress they have made, as well as how many deaths they need to cause."
    },
    {
      "type": "text",
      "text": "Subject #5, being likely the least developed of the sightings we have seen, was only able to dissolve Rupters and Buglins. A posthumous analysis of their 'heart' indicated that they were Tier 0, and as a result we deduced that Vagrants can only interact with parasite instances that resemble the physiology of any Tier at or below their current one."
    },
    {
      "type": "text",
      "text": "Some parasites, however, appear to belong to different Tiers than expected, such as other Nexus versions or the Host and Herd, which appear to ascend tiers as their stages increase."
    },
    {
      "type": "text",
      "flag": "srpcotesia:bloom_phase",
      "text": "One thing that appears to not vary between instances, however, is that Vagrant sightings have slowly increased in Tier over time, but only at very specific milestones in the progression of the parasites as a whole. Perhaps they cannot advance until such progression occurs?"
    }


  ]
}