{
  "name": "Infesting Creatures",
  "icon": "srparasites:textures/gui/potion_coth.png",
  "category": "vagrant",
  "pages": [
    {
      "type": "text",
      "text": "$(#630000)There doesn't seem to be any documentation on this, so I've opted to add some.$(br)I can evolve by infecting creatures with Call of The Hive, and while killing them is always an option, doing this should ideally be more lucrative."
    },
    {
      "type": "text",
      "flag": "!srpcotesia:cothrework",
      "text": "$(#630000)It's as simple as just going near the target, or colliding with them if necessary. The particles emitted by Call of the Hive are only visible to me, so I can use that to determine if I have succeeded. The process usually takes around 2 minutes to fully complete."
    },
    {
      "type": "text",
      "flag": "srpcotesia:cothrework",
      "text": "$(#630000)It isn't as simple as just contact though, as recently creatures have developed some sort of resistance. I have yet to find a reason as to why; It certainly can't be their immune system."
    },
    {
      "type": "text",
      "flag": "srpcotesia:cothrework",
      "text": "$(#630000)Regardless, I have found an easy solution while the higher ups work on a more permanent one: weaken said creature to a fraction of their health. I usually opt for around 50%, as reducing their health below 30% disrupts COTH and only produces an Incomplete Form, and no extra points."
    },
    {
      "type": "text",
      "flag": "srpcotesia:cothrework",
      "text": "$(#630000)Once I have damaged their resistance, they appear to emit several sparks and become vulnerable to infection. From there, the process should only take around 2 minutes to fully complete. The particles emitted by Call of the Hive are only visible to me, so I can use that to determine if it is infected."
    },
    {
      "type": "text",
      "text": "$(#630000)Infecting a creature that is vulnerable to Call of The Hive will generate more points than just killing them. I'll opt for this instead of killing for now, provided I cannot kill creatures faster than I can infect."
    }
  ]
}