{
  "name": "Factory",
  "icon": "srpcotesia:factory",
  "category": "vagrant",
  "pages": [
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:factory",
      "text": "The Factory is a Nexus-tier parasite that facilitates parasite production for Vagrants. Factories possess similar physiology to the Vagrants they are born from, a soft shell of flesh with an inner, more disorganized mound of assorted stem and muscular tissue.$(br)$(#630000)I can create one with $(k:srpcotesia.createfactory), as long as I have enough biomass."
    },
    {
      "type": "image",
      "images": ["srpcotesia:textures/book/factory.png"],
      "text": "A Tier 1 Factory. Note the resemblance to Moving Flesh."
    },
    {
      "type": "text",
      "text": "Factories, unlike most parasites, do not appear to do much on their own. In fact, Factories will simply sit idle until a Vagrant provides it with biomass, allowing any non-parasite to tread nearby as long as it isn't attacked. The Factory's pulsating does not change, although it does appear to make distressed sounds if an enemy is nearby."
    },
    {
      "type": "text",
      "text": "While they can change their Tier, it appears Factories will only do this if a Vagrant samples a genetic marker from a parasite, known as 'binding', in which case it will take on the Tier of said parasite. Factories do not evolve with time, and take on the Tier of their Vagrant on creation."
    },
    {
      "type": "text",
      "text": "$(#630000)Since this book doesn't seem to describe interactions in detail, I'll just write them here myself. $(br)Placing it is similar to a block (crouching while doing so will only dissolve it, or unbind it from whatever parasite I bound it to). Using $(k:use) on a Factory with an empty hand will insert biomass, and $(k:attack) will take out biomass."
    },
    {
      "type": "text",
      "text": "$(#630000)Crouching while doing the latter will pick up the placed Factory, while the former will just input 5 times as much biomass. I can use it on a parasite to dissolve it, or upgrade it if its bound to the resulting parasite. I can also force a Factory to copy another Factory's bound parasite this way.$(br)I can tell what parasites I made based on the particles they emit while I am holding a Factory. They resemble that of the Enchanting Table."
    },
    {
      "type": "text",
      "text": "When biomass is given to a Factory, however, its behavior changes depending on if it has stored a genetic marker for a parasite. If it has, it will begin attempting to build said parasite once it has enough, notably increasing its activity. Otherwise, it will stay inert.$(br)Parasites produced by Factories cannot be picked up by Dispatchers."
    },
    {
      "type": "text",
      "flag": "srpcotesia:persist",
      "text": "Parasites created by Factories tend to not wander far, staying in the general area they were left in."
    },
    {
      "type": "text",
      "text": "Factories that have markers stored will also passively absorb nearby parasites considered to be below their tier, possibly to turn them into something stronger. $(br)Much like a Stage IV Beckon, Factories will also passively upgrade nearby parasites, although this behavior appears to be restricted to a select few species. It is restricted further if the Factory has a genetic marker."
    },
    {
      "type": "text",
      "text": "Factories, being uniquely able to be held as if they were items by Vagrants, allow for some of their previously discussed interactions to be done by hand. Held Factories bound to Deterrent versions may also attract those species to the Vagrant's location."
    }
  ]
}