{
  "name": "Latch",
  "icon": "srpcotesia:textures/gui/latch_ui.png",
  "category": "vagrant",
  "flag": "srpcotesia:latch",
  "pages": [
    {
      "type": "text",
      "text": "The Latch is a Deterrent-Tier parasite often deployed by Vagrants of Tier 1 or higher.$(br)It is composed of a tough central mass of flesh covered in tooth-esque protruding spines, connected to its Vagrant via an ethereal tether akin to an umbilical cord.$(br)$(#630000)I can deploy one with $(k:srpcotesia.throwlatch)."
    },
    {
      "type": "image",
      "images": ["srpcotesia:textures/book/latch.png"],
      "text": "A Latch, depicted independent of its Vagrant. The Vagrant is restrained out of frame."
    },
    {
      "type": "text",
      "text": "When deployed, a Latch will be launched with considerable speed from the Vagrant's chest cavity, forcing them to unhide if they are hiding. This velocity appears to be greater if the Vagrant is crouching. As gleaned from our prior interviews with Subject #5, the mechanism for deploying a Latch appears to be the same method that a Vagrant can retract one."
    },
    {
      "type": "text",
      "text": "When the Latch comes into contact with a living creature, it will either attack or proceed to apply several potion effects depending on whether it is a parasite instance, and after attachment it will allow the Vagrant to drag its victim around, provided it isn't rooted to the ground."
    },
    {
      "type": "text",
      "text": "Parasites restrained by a Latch cannot be stored by Dispatchers. Despite their strength, it appears most parasites will not sever a Latch if attached to one, excluding a few exceptions (such as the Assimilated Enderman)."
    },
    {
      "type": "text",
      "text": "Latches tend to scale in durability and attack strength with their creators, broadening the amount of effects they can apply. Destroying an active Latch will cause the attached Vagrant to enter the Cooldown state for an extended period of time, during which another Latch cannot be deployed. Fire can also spread from Latch to Vagrant, and vice versa. $(br2)$(#630000)They forgot to mention it retracting on its own when I go far enough away from it. Perhaps that was implied."
    }
  ]
}