{
  "_comment": "This should never be visible, but just in case it is",
  "gui.enabled": "Enabled",
  "gui.disabled": "Disabled",
  "gui.unavailable": "Unavailable",
  "bs.sprint.mode.tap": "Tap",
  "bs.sprint.mode.hold": "Hold",
  "bs.sprint.hold": "Sprint",
  "bs.sprint.toggle": "Sprint toggle",
  "bs.sneak.toggle": "Sneak toggle",
  "bs.menu": "Mod configuration",
  "bs.doubleTapping": "Double tapping",
  "bs.runAllDirs": "Run in all directions",
  "bs.flyBoost": "Fly boost",
  "bs.flyOnGround": "Fly on ground",
  "bs.disableMod": "Disable mod",
  "bs.autoJump": "Auto-jump",
  "bs.sprint.hold.info": "[Tap] will start or stop sprinting when pressed.#[Hold] will sprint only while the key is held.",
  "bs.sprint.toggle.info": "Press once to start or stop sprinting.#Slowing down will not interrupt the sprint.",
  "bs.sneak.toggle.info": "Press once to start or stop sneaking.#When you open any GUI, you will stop sneaking until you close it.",
  "bs.menu.info": "Press to open this menu in-game.",
  "bs.doubleTapping.info": "Double-tap the forward key to start sprinting.",
  "bs.runAllDirs.info": "Sprint in all directions.#Cannot be used in multiplayer unless the server allows it.",
  "bs.flyBoost.info": "Hold sprint key to fly faster in creative or spectator mode.",
  "bs.flyOnGround.info": "Continue flying when touching ground in creative mode.",
  "bs.disableMod.info": "Disables all functionality of Better Sprinting.#This option can be used if a server doesn't allow the mod.",
  "bs.autoJump.info": "Vanilla feature that makes you automatically jump near obstacles.",
  "2x": "2x",
  "bs.game.integrity": "Better Sprinting is not working correctly, there may be a conflict with another mod.",
  "bs.game.disabled": "The server requested to disable the mod, all features will be deactivated.",
  "bs.game.reenabled": "The server has enabled the mod again, all features were reactivated.",
  "bs.command.info": "Use the commands to either disable/enable the mod for players, or change specific settings. These will persist after restarting the server, and will also immediately affect players that are already on the server.",
  "bs.command.disableMod": "Better Sprinting will be automatically disabled for all players.",
  "bs.command.enableMod": "Better Sprinting is now allowed on the server.",
  "bs.command.disableFlyBoost": "Fly boost is now disabled when the player is in survival mode.",
  "bs.command.enableFlyBoost": "Fly boost is now enabled when the player is in survival mode.",
  "bs.command.disableAllDirs": "Sprinting in all directions is now disabled.",
  "bs.command.enableAllDirs": "Sprinting in all directions is now enabled.",
  "key.categories.bettersprinting.hidden": "Better Sprinting"
}