{
  "category": "hexalia:rituals",
  "name": "Lunar Ritual",
  "icon": "hexalia:moon_crystal_block",
  "flag": "mod:lunar",
  "sortnum": 7,
  "pages": [
    {
      "type": "patchouli:text",
      "title": "Lunar Ritual",
      "text": "The Lunar Ritual is a sacred rite that channels the moon energy, influencing its celestial events.$(br)Each lunar ritual require a specific offering to align with the lunar event power.$(br)Each lunar event brings unique boons or dangers, making preparation for the event essential.$(br)$(l)Can only be preformed at night time."
    },
    {
      "type": "patchouli:text",
      "title": "Performing the Ritual",
      "text": "- Prepare a 5x5 surface of Moon Crystal Blocks.$(br)- Surround the setup with at least 12 blocks of water and place 4 Lunar Lilies nearby.$(br)- Place 2 lit Skull Candles and 2 lit Wither Skull Candles two blocks above the surface.$(br)- Position 8 Ritual Braziers on the surface, each containing a Moon Crystal and marked as Salted.$(br)- Place Glowstone block one block above the middle position of the surface and above it a Ritual Brazier with the offering item.$(br)- Right-click the Glowstone block with a Hex Focus and witness the moon’s energy take form."
    },
    {
      "type": "patchouli:image",
      "images": ["hexforged:textures/gui/moon_ritual_1.png"],
      "title": "Ritual setup 1",
      "text": "This structure can be semi-custom built, no need to copy this design."
    },
    {
      "type": "patchouli:image",
      "images": ["hexforged:textures/gui/moon_ritual_2.png"],
      "title": "Ritual setup 2",
      "text": " "
    },
    {
      "type": "patchouli:image",
      "images": ["hexforged:textures/gui/moon_ritual_3.png"],
      "title": "Ritual setup 3",
      "text": " "
    },
    {
      "type": "patchouli:image",
      "images": ["hexforged:textures/gui/moon_ritual_4.png"],
      "title": "Ritual Activated",
      "text": " "
    },
    {
      "type": "patchouli:text",
      "title": "Hero Moon",
      "text": "Bask in the glory of the Hero Moon, where valor is rewarded. Throughout the night, you'll be bestowed with the prestigious Hero of the Village effect, enhancing your interactions with grateful villagers."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Offering Required",
      "item": "minecraft:emerald",
      "text": "Emerald is used as the offering for the Hero Moon ritual."
    },
      {
      "type": "patchouli:text",
      "title": "Blood Moon",
      "text": "When the Blood Moon rises, prepare for fierce battles. Mobs that emerge during this lunar event have an extra edge, making them formidable adversaries for even the most seasoned adventurers."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Offering Required",
      "item": "minecraft:beef",
      "text": "Beef is used as the offering for the Blod Moon ritual."
    },
    {
      "type": "patchouli:text",
      "title": "Miner Moon",
      "text": "Unleash your inner miner during the Miner Moon. The gift of Haste accompanies this event, allowing you to excavate resources with unmatched speed and efficiency."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Offering Required",
      "item": "minecraft:iron_pickaxe",
      "text": "Iron Pickaxe is used as the offering for the Miner Moon ritual."
    },
    {
      "type": "patchouli:text",
      "title": "Crimson Moon",
      "text": "Experience an unprecedented overlap of dimensions as Nether mobs traverse the overworld during the Crimson Moon. The boundaries between realms blur, adding an exciting layer of unpredictability to the night."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Offering Required",
      "item": "minecraft:crimson_fungus",
      "text": "Crimson Fungus is used as the offering for the Crimson Moon ritual."
    },
    {
      "type": "patchouli:text",
      "title": "White Moon",
      "text": "Embrace serenity beneath the White Moon. Venture out with confidence as the tranquil aura of the night encourages exploration and discovery."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Offering Required",
      "item": "minecraft:glowstone_dust",
      "text": "Glowstone is used as the offering for the White Moon ritual."
    },
    {
      "type": "patchouli:text",
      "title": "Big Moon",
      "text": "Gaze upon the night sky to witness the moon's astonishing expansion. But beware, for the Big Moon brings alterations to gravity, testing your adaptability in a world with reduced gravity."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Offering Required",
      "item": "minecraft:phantom_membrane",
      "text": "Phantom Membrane is used as the offering for the Big Moon ritual."
    },
    {
      "type": "patchouli:text",
      "title": "Tiny Moon",
      "text": "Feel the gravitational pull intensify during the Tiny Moon. Navigate a world where gravity holds a stronger grip, challenging you to adapt and navigate the terrain like never before."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Offering Required",
      "item": "minecraft:anvil",
      "text": "Anvil is used as the offering for the Tiny Moon ritual."
    },
    {
      "type": "patchouli:text",
      "title": "Bad Omen Moon",
      "text": "As the night unfolds, be prepared to face heightened dangers. The Bad Omen Moon fills the air with tension, granting you the ominous Bad Omen effect throughout the night."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Offering Required",
      "item": "minecraft:black_banner",
      "text": "Ominous Banner is used as the offering for the Bad Omen Moon ritual."
    },
    {
      "type": "patchouli:text",
      "title": "Eclipse Moon",
      "text": "Behold the rare Eclipse Moon event, shrouding the world in darkness. Embrace the darkness effect that challenges your senses and strategy, offering a unique and immersive twist to the lunar cycle."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Offering Required",
      "item": "minecraft:crying_obsidian",
      "text": "Crying Obsidian is used as the offering for the Eclipse Moon ritual."
    },
    {
      "type": "patchouli:text",
      "title": "Random Moon",
      "text": "The night sky shifts unpredictably, triggering a random lunar event."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Offering Required",
      "item": "hexalia:storm_idol",
      "text": "Storm Idol is used as the offering for the Random Moon ritual."
    },
    {
      "type": "patchouli:text",
      "title": "Clear Moon",
      "text": "The sky returns to its natural state, dispelling all ongoing lunar events. Under the calm glow of the default moon, the world is free from any celestial influences."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Offering Required",
      "item": "hexalia:clear_idol",
      "text": "Clear Idol is used as the offering for the Clear Moon ritual."
    }
  
  ]
}
