{
    "name": "Redstone Aura Vaporizer",
    "icon": "naturesaura:aura_timer",
    "category": "devices",
    "advancement": "naturesaura:infused_materials",
    "pages": [
        {
            "type": "text",
            "text": "Some $(thing)redstone$() contraptions, especially more complicated ones, may require the construction of a device that activates in a certain $(thing)interval$() - a $(item)timer$(). To the unexperienced engineer, this may seem like a daunting task, but the $(item)Redstone Aura Vaporizer$() simplifies it quite a bit.$(br)The infused iron bowl in the center of the device can hold any type of $(l:practices/aura_bottle)Bottled Aura$(),"
        },
        {
            "type": "text",
            "text": "which will be vaporized at a precise speed. Each time a vaporization is finished, a $(thing)redstone signal$() is emitted for a brief moment, and the $(aura) flows back into the bowl.$(br)The type of $(aura) inserted, as well as the amount of bottles, determine the time between activations: A bottle of $(thing)sunlight$() lasts for a second, a bottle of $(thing)ghosts$() for a minute and a bottle of $(thing)darkness$() for an hour. This means that a redstone signal can be emitted as infrequently as once every sixty-four hours, if required."
        },
        {
            "type": "text",
            "text": "Inserting the bottles by hand should suffice in most situations, but if necessary, bottles can also be inserted and extracted through any kind of $(thing)automation$().$(br)The device's vaporization progress can easily be reset by supplying a $(thing)redstone signal$().$(br)Additionally, the total amount of time, as well as the remaining time for each vaporization, can be viewed by looking at the device with an $(l:items/eye)Environmental Eye$() equipped."
        },
        {
            "type": "crafting",
            "text": "Creating the $(item)Redstone Aura Vaporizer$()",
            "recipe": "naturesaura:aura_timer"
        }
    ]
}