{
  "name": "Cost and Fizzling",
  "icon": "minecraft:firework_star",
  "category": "scriptor:casting",
  "pages": [
    {
      "type": "patchouli:text",
      "text": [
        "Sometimes, a spell cannot be cast as is, for one reason or another. ",
        "If this happens, when attempting to cast, the spell will $(l)Fizzle$().",
        "$(br2)",
        "There are two main reasons a spell can fizzle:",
        "$(li)The spell is too costly, or",
        "$(li)A requirement of the spell has not been met"
      ]
    },
    {
      "type": "patchouli:text",
      "title": "Cost",
      "text": [
        "Every component a spell contains can modify the spells cost. ",
        "When a spell contains so many components that it exceeds the max cost of ",
        "your casting medium, the spell will fizzle.",
        "$(br2)",
        "If a spell fizzles due to its cost, it may be helpful to add cost-reducing components ",
        "or remove costly descriptors from the spell. ",
        "$(br)",
        "Components such as reagents or conditions can consume an item to reduce spell cost, while ",
        "components that increase spell strength and duration generally increase cost."
      ]
    },
    {
      "type": "patchouli:text",
      "title": "Conditions",
      "text": [
        "As mentioned in the previous section, some components introduce conditions to a spell. ",
        "$(br2)",
        "The first type are reagent components, which consume an item every time a spell is cast, ",
        "but greatly reduce cost. ",
        "These are helpful for preventing powerful spells from fizzling. "
      ]
    },
    {
      "type": "patchouli:text",
      "text": [
        "The second category is more broad. ",
        "Conditions that require you to be on full health, or will only target specific entities can ",
        "be very useful for reducing spell cost, but cause the spell to fizzle outright when not met."
      ]
    },
    {
      "type": "patchouli:text",
      "title": "???",
      "text": [
        "Legend tells of a word that can be added to any spell that reduces their cost for no price...",
        "$(br2)",
        "Should such a thing exist, one would wonder why it isn't in $(l)every$() spell?"
      ]
    }
  ]
}