{
    "name": "General Info",
    "icon": "qmd:accelerator_casing",
    "category": "qmd:accelerators",
    "sortnum": 0,
    "pages": [
        {
            "type": "text",
            "text": "At the core of QMD are the Accelerator Multiblocks. There are many different types: $(l:accelerators/linear_accelerator)Linear$(/l), $(l:accelerators/ring_accelerator)Synchratron$(/l), $(l:accelerators/Beam_diverter)Beam diverter$(/l) and $(l:accelerators/decelerator)Decelerator$(/l). All these do different things, but use the same basic principles and materials."
        },
        {
            "type": "text",
            "title": "Construction",
            "text": "All Accelerators are made out of Accelerator Casing and/or Accelerator Glass. They require an Energy Port for RF power and at least two Accelerator Coolant Vents, one set to input and the other to output. Switching the setting of the vent is done by right clicking with the NC multitool."
        },
        {
            "type": "text",
            "text": " Inside each accelerator is a connected line of Beam Blocks that the particles will travel through. Around this beam can be 3 different types of component structures: Radio Frequency (RF) Cavities, Quadrupole Magnets and Dipole Magnets. Around these component structures there are coolers to cool the whole accelerator."
        },
        {
            "anchor": "rf_cavity",
            "type": "multiblock",
            "name": "RF Cavities",
            "multiblock": {
                "mapping": {
                    "C": "qmd:accelerator_cavity",
                    "B": "qmd:accelerator_beam"
                },
                "pattern": [
                    [
                        "   ",
                        "CCC",
                        " 0 "
                    ],
                    [
                        " B ",
                        "CBC",
                        " B "
                    ],
                    [
                        "   ",
                        "CCC",
                        "   "
                    ]
                ]
            },
            "enable_visualize": false,
            "text": "RF Cavities are constructed from RF Cavity blocks of the same type around the Accelerator Beam as shown."
        },
        {
            "type": "text",
            "text": " RF cavities increase the accelerating voltage of the accelerator and thus the energy of the resulting particle out the end. The accelerating voltage of each Rf Cavity is determined by the type of cavity block the are made of."
        },
        {
            "anchor": "quadrupole",
            "type": "multiblock",
            "name": "Quadrupole Magnet",
            "multiblock": {
                "mapping": {
                    "M": "qmd:accelerator_magnet",
                    "B": "qmd:accelerator_beam"
                },
                "pattern": [
                    [
                        "0M "
                    ],
                    [
                        "MBM"
                    ],
                    [
                        " M "
                    ]
                ]
            },
            "enable_visualize": false,
            "text": "Quadrupole Magnets are constructed from 4 Accelerator Electromagnets of the same type around a Accelerator Beam as shown."
        },
        {
            "type": "text",
            "text": " Quadrupoles increase the focus of the particle beam. The focus is used to tell how far a beam can travel. If the beam travels to far in an accelerator it will not output. So more quadrupoles need to be added to compensate the loss in focus. The strength of a quadrupole is determined by the type of electromagnet used to create it."
        },
        {
            "anchor": "dipole",
            "type": "multiblock",
            "name": "Dipole Magnet",
            "multiblock": {
                "mapping": {
                    "M": "qmd:accelerator_magnet",
                    "Y": "qmd:accelerator_yoke",
                    "B": "qmd:accelerator_beam",
                    "0": "qmd:accelerator_yoke"
                },
                "pattern": [
                    [
                        "Y0Y",
                        "YMY",
                        "YYY"
                    ],
                    [
                        "YYY",
                        "YBB",
                        "YBY"
                    ],
                    [
                        "YYY",
                        "YMY",
                        "YYY"
                    ]
                ]
            },
            "enable_visualize": false,
            "text": "Corner dipole example with only 2 outputs."
        },
        {
            "type": "text",
            "text": "Dipole Magnets are created by placing an Accelerator Electromagnet of the same type above and below a beam and the filling the rest of the 3x3x3 space around that beam with Accelerator yokes. An example of corner dipole is shown on the previous page. Dipoles in $(l:accelerators/Beam_diverter)Beam diverter$(/l) can also be oriented with the magets horizontal to allow the beam to be outputet up and down. Dipoles can not be used in $(l:accelerators/linear_accelerator)Linear Accelerators$(/l)."
        },
        {
            "type": "text",
            "text": "The strength of each dipole is the strength of the electromagnet used to create it. Dipoles bend the path of beams so one must be placed in each corner."
        },
        {
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/dipoles.png"
            ],
            "text": "Dipoles in an empty $(l:accelerators/ring_accelerator)Synchratron Accelerator$(/l)."
        },
        {
            "type": "text",
            "title": "Coolers",
            "text": "Each RF cavity and electromagnet blocks produce heat while operating. To get rid of this heat coolers are placed inside the accelerator. They only work if their required rules are met. These rules are shown on the tool tips of each cooler."
        },
        {
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/coolers.png"
            ],
            "text": "Example of a $(l:accelerators/linear_accelerator)Linear Accelerator$(/l) with coolers."
        },
        {
            "type": "text",
            "title": "Cooling",
            "text": "Accelerators need to be cooled as they produce heat. If they overheat while operating, some of the overheating components will explode. To cool an accelerator you need to pipe in a cold coolant and pipe out a hot coolant. Each coolant has a different temperature this determines the minimum temperature your accelerator can reach. Example Liquid helium is 4 Kelvin (K), Liquid Nitrogen is 70 K."
        },
        {
            "type": "text",
            "text": "The valid coolants and their temperatures can be seen in JEI. To pipe coolant in and out of an accelerator you need at least 2 Accelerator Coolant Vents, one in input mode and one in output mode. The mode can be switched using the nuclearcraft multitool. Hovering over the coolant bar (right) of the accelerators gui will show you the amount of coolant stored, the maximum rate coolant will be used and the maximum rate hot coolant is produced."
        },
        {
            "type": "text",
            "text": " The Accelerators coolant tanks (both input and output) can be cleared by holding shift in the gui and pressing the button that appears."
        }
       
    ]
}
