{
	"name": "Syncrotron Accellertor",
	"icon": "qmd:ring_accelerator_controller",
	"category": "qmd:accelerators",
	"sortnum": 2,
	"pages": [
		{
			
			"type": "text",
			"text": "Synchrotron Accelerators accelerate particles put into them to much higher energies than $(l:accelerators/linear_accelerator)Linear Accelerators$(/l), but can not be the start of an accelerator system. This must be a linear accelerator with a ion source. $(bold)Synchrotrons have a minimum input particle energy$() this is usually 5 MeV but can be changed in the configs."
		},
		{
			"anchor": "construction",
			"title": "Construction",
			"type": "text",
			"text": "Synchrotron Accelerators are a square torus of Accelerator Casings or Glass that must be 5 wide. There must be a continuous ring of Accelerator Beams down the centre. Any Beam Port must be placed on the same level as the beam ring and there must be a beam block connecting it to the beam ring. $(bold)At each corner and beam port intersection there must be a dipole magnet$()."
		},
		{
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/empty_synch.png"
            ],
            "text": "Example of the beam block arrangement"
        },
		{
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/synch_dipoles.png"
            ],
            "text": "Same Synchrotron now with dipoles placed."
        },
		{
           "title": "Particle Energy",
			"type": "text",
			"text": "The resulting Particle Energy is more complicated to figure out than a $(l:accelerators/linear_accelerator)Linear Accelerator$(/l) the energy is limited by 2 factors whichever factor is smaller will be the maximum particle output energy Emax=min(Eₓ,Eᵣ). These factors are from the dipole field strength and the synchrotron radiation losses."
        },
		{
			"anchor": "max_dipole",
			"type": "text",
			"text": "The maximum energy (in MeV) from the dipole strength is Eₓ=1000(qB₂R)²/(2m) where q is the particles charge, B₂ is the dipole strength which is the sum of the strengths of the dipoles, R is the radius of the synchrotron and m is the mass of the particle in MeV/c^2. For heavy particles like the proton this is the major concern."
        },
		{
			"anchor": "max_radation",
			"type": "text",
			"text": "The maximum energy (in MeV) from the Radiation losses $(br)Eᵣ=1000m(3VR/|q|)⁰˙²⁵ where V is the accelerator's voltage (in kV). For light particles like the electron this is the major concern."
        },
		{
           "anchor": "synchrotron_Port",
		   "title": "Synchrotron Ports",
			"type": "text",
			"text": "Synchrotron accelerators can have one special port installed an Accelerator synchrotron Port. This port lets out synchrotron radiation (High energy photons). The same potion rules as beam ports apply to synchrotron ports. The amount of pu/t of photons produced is equal to the amount of pu/t of particles going through the Synchrotron and the focus is the same as the particles going through the synchrotron"
        },
		{
			"type": "text",
			"text": "The energy of the photons is (in MeV) is Eᵧ=E³/(2πR(1000m)³) where E is the energy (in MeV) of the particle outputted by the synchrotron. Therefore light particles like electrons are the best to use."
        },
		{
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/synch_port.png"
            ],
            "text": "Synchrotron Port set up."
        }
	]
}