{
  "name": "Study of the Allay",
  "icon": "reactive:soul_bottle",
  "category": "reactive:objects_of_study",
  "advancement": "reactive:see_allay_summon",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(1)I have succeeded! A spectre has appeared before me--! It looks... kind? Friendly, even? I was expecting something grand, imposing...$(p)Well, I suppose reality is not always as one expects."
    },
    {
      "type": "patchouli:text",
      "text": "$(1)The eerie blue glow it gives off tingles against my skin the same way that raw Soul Power does. While Symbols have proven ineffective, there must be some way to convince them to donate that Power."
    },
    {
      "type": "patchouli:text",
      "text": "$(1)Update 1:$(p)The creature accompanied me today throughout the town square -- it seems to have taken a liking to me. While it behaved timidly at first, seeing me interact with the townspeople seems to have gotten it to gather its courage."
    },
    {
      "type": "patchouli:text",
      "text": "$(1)Update 2:$(p)The creature has a penchant for picking up loose items. I unfortunately noticed this attribute after it brought me a piece of Litmus Paper I had been using to take a measurement. I find myself unable to chastise such a being, so I will repeat the reaction again."
    },
    {
      "type": "patchouli:text",
      "text": "$(1)Update 3:$(p)The creature said a word: 'Allay'. The words means to relieve, 'alleviate'. Is this the spirit's name, or was it requesting my help with something? I noticed it hovering near my reagent chest..."
    },
    {
      "type": "patchouli:text",
      "text": "$(1)Update 4:$(p)Allay reacts favorably to Amethyst Shards. Upon taking one, it began casting around, searching for something. It settled above my old jukebox and looked at me, as if waiting."
    },
    {
      "type": "patchouli:text",
      "text": "$(1)Update 5:$(p)The Allay Spirits duplicate under the effect of music if they are handed an Amethyst Crystal. I learned this by playing a primitive 'game' with the spirit in which we pass the crystal back and forth.$(p)I may be anthropomorphizing, but the Allay seemed thankful."
    },
    {
      "type": "patchouli:text",
      "text": "$(1)Update 6:$(p)I left one of my empty Quartz Bottles out in the open last night, and when I returned, it was being held by an Allay -- and, somehow, it had filled with Soul Power. Is this the gratitude of the spirits...?"
    }
  ]
}
