{
  "name": "Astral Synthesis",
  "icon": "minecraft:map",
  "category": "reactive:objects_of_study",
  "advancement": "reactive:harvest",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(o)I have been considering the problem presented by $(l:reactive:intro/curse)Curse$(/l). $(p)If it can assimilate all other Powers, surely Curse would spread through the world unopposed as soon as it was first created, destroying everything in its path?$(p)Perhaps that could still happen...?"
    },
    {
      "type": "patchouli:text",
      "text": "$(o)It was while turning these ideas over in my mind that I found an old $(item)Enchanted Book$(0) in my late master's study whose enchantment had long since faded. $(p)On one of the pages, there was this diagram:"
    },
    {
      "type": "patchouli:image",
      "images": ["reactive:textures/gui/astral_diagram.png"]
    },
    {
      "type": "patchouli:text",
      "text": "$(o)The center section is labelled 'BASE', and it appears to depict a standard hexagonal $(thing)Base Power$(0) interaction circle as the middle of some sort of diamond shape in three dimensions.$(p)Below, there is the word 'CURSE'; the lines depicting the Base Powers being drawn into it alchemically."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)Yet, at the top, there is another point labelled 'ASTRAL'. Seemingly a second ultimate power, the positive to Curse's negative... $(p)If such a Power exists, maybe it counteracted the effects of Curse when reality began.$(p)Synthesizing this Power remains a mystery."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)Merging Base Powers into Esoteric Powers seems like a good start, but each accounts only for two of six Base Powers.$(p)It's possible the Esoteric Powers might react with each other, but one would need to combine all three Esoteric Powers in the same Crucible to test this."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)There is a reason I've never attempted that combination. $(p)It is impossible. $(p)Assuming the Crucible even has enough capacity to support such an endeavor, there's no way to separate the excess $(thing)Base Powers$(0) before they react with each other."
    },
    {
      "type": "patchouli:empty"
    },
    {
      "type": "patchouli:text",
      "text": "$(o)...At least, that is what I'd like to conclude. But I have a deep suspicion that it is indeed possible, and that despite that, I will never be allowed to attempt it.$(p)Not due to its rigor, but something much more frustrating: I am no longer permitted to use my late master's workshop."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)While my master left his teachings, his records to me, his laboratory was technically the property of our King, who has sold it to help finance the upcoming war. I must refrain from stating my opinion on this decision in formal writing. $(p)Without my tools, I can do nothing but write."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)It frustrates me to no end to be so close to the resolution of such a mystery, only to have it taken from me, but there is nothing for it. $(p)In the coming months, such concerns will be the least of my worries, I am sure."
    },
    {
      "type": "patchouli:empty",
      "draw_filler": "false"
    },
    {
      "type": "patchouli:empty",
      "draw_filler": "false"
    },
    {
      "type": "patchouli:text",
      "text": "$(o)$(playername)... They will solve it. The matter will be put to rest, someday. $(p)I just need to have faith."
    }
  ]
}