{
  "name": "Notable Power Sources",
  "icon": "minecraft:gunpowder",
  "category": "reactive:objects_of_study",
  "priority": true,
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(o)I've collected some notes from the old man's study about different sources of Power. Use these if you want some pointers to help you progress."
    },
    {
      "type": "patchouli:spotlight",
      "item": "minecraft:ender_pearl",
      "text": "$(item)Ender Pearls$(0) seem a perfect source of the Warp Power, but given their unstable nature, I believe that the process will likely have some $(4)unintended side-effects if Warp is already present$(0). Hm... well, only one way to find out, I suppose!"
    },
    {
      "type": "patchouli:spotlight",
      "item": "minecraft:gunpowder",
      "text": "$(item)Gunpowder$(0) is Acidic, but something tells me that using an Ingredient so obviously Volatile may be Dangerous under the right conditions. For a safe alternative, use $(item)Nether Wart$(0) or some $(item)Crimson Flora$(0) from the Netherworld. $(br2)$(o)Personally, I like to use $(item)Spider Eyes$(0)."
    },
    {
      "type": "patchouli:spotlight",
      "item": "minecraft:soul_sand",
      "text": "$(item)Soul Sand$(0) should be a perfect source of Soul power -- it's right in the Name, after all! But, something seems... $(l:intro/curse)off$(/l) about the resulting substance. I recommend that Soul Sand is not used in any further Alchemical Experimentation. $(p)$(o)Actual sources coat the ruins of the seas and the darkest depths."
    },
    {
      "type": "reactive:dissolve",
      "reactant": "minecraft:enchanted_book",
      "text": "When seeking the Power of the Mind, a Book seems the optimal place to start. I wonder what kinds of books might yield Mind power?"
    },
    {
      "type": "patchouli:text",
      "text": "The ingredients for Vital Power are quite rare, but just yesterday, I discovered that some had entered my Crucible out of nowhere! I checked my supplies, but nothing was missing, so the $(thing)Exterminator$(0) who came through last night is unlikely the cause. $(br2)How could the power of Life Itself have appeared $(l:reactive:objects_of_study/sacrifice)without using items at all?$(0)"
    }
  ]
}
