{
  "rule.clavis.gear.mood_swings": "Mood Swings",
  "rule.clavis.gear.mood_swings.description": "After each click the pointer changes the direction of its movement",
  "rule.clavis.gear.nauseous_carousel": "Nauseous Carousel",
  "rule.clavis.gear.nauseous_carousel.description": "From time to time the game field slowly rotates in a random direction",
  "rule.clavis.gear.fake_pin": "Fake Pin",
  "rule.clavis.gear.fake_pin.description": "A fake pin appears and moves to a random position after each click. Clicking it deactivates all previously activated pins",
  "rule.clavis.gear.self_destruction": "Self Destruction Protocol",
  "rule.clavis.gear.self_destruction.description": "The pointer periodically overheats causing any click to take away an extra health point",
  "rule.clavis.gear.full_throttle": "Full Throttle",
  "rule.clavis.gear.full_throttle.description": "The pointer speeds up after each click and gradually slows back down over time",

  "rule.clavis.mirror.fake_meteor": "Fake Meteor",
  "rule.clavis.mirror.fake_meteor.description": "A fake meteor appears, moving to a random position after each click. Clicking it will restore all previously destroyed meteors",
  "rule.clavis.mirror.rotate": "Centrifuge",
  "rule.clavis.mirror.rotate.description": "The reflecting mirror periodically spins in a random direction",
  "rule.clavis.mirror.swap_mousepos": "Castling",
  "rule.clavis.mirror.swap_mousepos.description": "After each click, the real cursor swaps places with the reflected one",
  "rule.clavis.mirror.hot_meteor": "Hot Stuff",
  "rule.clavis.mirror.hot_meteor.description": "A random meteor on the field periodically heats up, and any click on it will remove an extra health point",
  "rule.clavis.mirror.shockwave": "Boom!",
  "rule.clavis.mirror.shockwave.description": "Each click creates a shockwave that pushes away all meteors near the reflected cursor",

  "ui.clavis.hold_shift": "Hold [Shift] for detailed description",

  "ui.clavis.difficulty.summary": "Game Difficulty",
  "ui.clavis.time.summary": "Game Time",
  "ui.clavis.quality.summary": "Loot Quality",

  "ui.clavis.difficulty.description": "Determined by the average value of loot that could appear in this container and affects the overall difficulty of the game. The difficulty level is also ranked in 3 tiers and determines the number of rules in the mini game.",
  "ui.clavis.time.description": "Determined by the amount of time from the start of the game until the present moment. Means nothing, but when it reaches 1 minute the whole world will explode!",
  "ui.clavis.quality.description": "Determines the quality and quantity of loot that will be generated after completing the mini game. Making mistakes during the playthrough reduces this value.",

  "item.clavis.lock_pick": "Lock Pick",
  "item.clavis.lock_pick.tooltip": "When used on a locked chest, it unlocks it while preserving the maximum quality of the loot inside, as if the mini-game had been completed without any mistakes. Consumed on use.",

  "sound.clavis.meteor_smash": "Meteor explosion",
  "sound.clavis.meteor_regenerate": "Meteor regeneration"
}