{
  "name": "On Spirits",
  "icon": "occultism:textures/gui/book/spirits.png",
  "category": "occultism:spirits",
  "sortnum": 0,
  "pages": [
    {
      "type": "text",
      "text": "Spirit, commonly known as demon, is a general term for a variety of supernatural entities usually residing in $(thing)The Other Place$(), a plane of existence entirely separate from our own. When in our world they can take a variety of forms, ranging from arbitrary shapes referred to as the $(thing)Chosen Form$() to the inhabiting of objects or living beings."},
    {
      "type": "text",
      "text": "There are four major \"ranks\" of spirits identified by summoners, but there are a myriad spirits below and in between these ranks, and some great entities of terrible power, referred to only as $(thing)Greater Spirits$(), that are beyond classification."},
    {
      "type": "text",
      "title": "Foliot",
      "text": "The lowest identified class of spirit. Equipped with some intelligence and a modicum of power they are most often used for manual labor or minor artifacts."},
    {
      "type": "text",
      "title": "Djinni",
      "text": "The most commonly summoned class. There is a great variety of Djinni, differing both in intelligence and power. Djinni can be used for a variety of task, ranging from higher artifacts over possession of living beings to carrying out tasks in their Chosen Form."},
    {
      "type": "text",
      "title": "Afrit",
      "text": "Even more powerful than Djinni, Afrit are used for the creation of major artifacts and the possession of powerful beings."},
    {
      "type": "text",
      "title": "Marid",
      "text": "The strongest identified class of spirits. Due to their power and vast intellect attempting a summoning is extremely dangerous and usually only carried out by the most experienced summoners, and even then usually in groups."},
    {
      "type": "text",
      "title": "Greater Spirit",
      "text": "Spirits of power so great it is beyond measure. No summons have been attempted in living memory, and records of summonings in ancient times are mostly considered apocryphal."},
    {
      "type": "empty",
      "draw_filler": false
    }
  ]
}