{
	"itemGroup.ars_elemental": "Elemental Spell Foci",
	"item.ars_elemental.fire_focus": "Focus of Fire",
	"item.ars_elemental.water_focus": "Focus of Water",
	"item.ars_elemental.air_focus": "Focus of Air",
	"item.ars_elemental.earth_focus": "Focus of Earth",
	"item.ars_elemental.necrotic_focus": "Focus of Necromancy",
	"item.ars_elemental.siren_charm": "Siren Charm - WIP",
	"item.ars_elemental.firenando_charm" : "Fire Golem Charm - WIP",
	"item.ars_elemental.curio_bag": "Trinkets Pouch",

	"block.ars_elemental.water_upstream": "Upstream Flow Generator",
	"block.ars_elemental.mermaid_rock": "Siren Shrine",

	"entity.ars_elemental.summon_skelehorse": "Summoned Skeletal Steed",
	"entity.ars_elemental.summon_direwolf": "Summoned Direwolf",
	"entity.ars_elemental.summon_vhex": "Summoned Vhex",
	"entity.ars_elemental.siren_entity": "Siren",
	"entity.ars_elemental.siren_familiar": "Siren Familiar",
	"entity.ars_elemental.firenando_entity": "Fire Golem",
	"entity.ars_elemental.firenando_familiar": "Fire Golem Familiar",

	"key.ars_elemental.open_pouch" : "[Elemental] Open trinkets pouch",
	"curios.modifiers.an_focus": "While in spell focus slot:",
	"curios.identifier.bundle": "Bundle",

	"effect.ars_elemental.watery_grave": "Watery Grave",
	"effect.ars_elemental.hellfire": "Hellfire Burn",
	"effect.ars_elemental.life_link": "Life Linked",
	"effect.ars_elemental.enthralled": "Enthralled",

	"ars_elemental.page1.fire_focus" : "This spell focus is attuned to the school of Fire. While equipped, the glyphs of this school will be amplified by two and discount the total cost of the spell by a fifth. It will also grant Mana Regen II while the wearer is on fire or in lava. As a drawback, glyphs of the other elemental schools might be weakened (values are configurable)",
	"ars_elemental.page2.fire_focus" : "This focus empowers Ignite to inflict Hellfire Burn. This effect reduces healing and allows flare to inflict damage and spread even on fire resistant mobs. Ignite + Evaporate combo will sublimate Ice.",
	"ars_elemental.page1.water_focus" : "This spell focus is attuned to the school of Water. While equipped, the glyphs of this school will be amplified by two and discount the total cost of the spell by a fifth. It will also grant Mana Regen I while the wearer is wet or Mana Regen II and Dolphin Grace while swimming. As a drawback, glyphs of the other elemental schools might be weakened (values are configurable)",
	"ars_elemental.page2.water_focus" : "This focus empowers Freeze, adding Freezing seconds to the target (it might take an additional Amplify to start damage). If used after Conjure Water, the conjured water will become ice. All Drowning damage against water creature will be converted to magic.",
	"ars_elemental.page1.air_focus" : "This spell focus is attuned to the school of Air. While equipped, the glyphs of this school will be amplified by two and discount the total cost of the spell by a fifth. It will also grant Mana Regen I while the wearer stand over Y 200 or is falling for long time. As a drawback, glyphs of the other elemental schools might be weakened (values are configurable)",
	"ars_elemental.page2.air_focus" : "This focus empowers Launch, changing it to apply Levitate when augmented with ExtendTime.",
	"ars_elemental.page1.earth_focus" : "This spell focus is attuned to the school of Earth. While equipped, the glyphs of this school will be amplified by two and discount the total cost of the spell by a fifth. It also grants Mana Regen I while the wearer stand under Y 0. As a drawback, glyphs of the other elemental schools might be weakened (values are configurable)",
	"ars_elemental.page2.earth_focus" : "Currently, it does not allow special glyph combo or empowering, but offer knockback resistance and boost natural and instant healing by 1.5.",
	"ars_elemental.page1.necrotic_focus" :"By imbuing the Focus of Summoning with evil energy, you can corrupt its powers towards Necromancy. Glyphs of the Anima school will get two free ExtendTime, Heal gets two amplify and Charm have way more chance to affect undead mobs. Summon Steed will change in Summon Skeletal Steed, which is able to walk and breath underwater.",
	"ars_elemental.page2.necrotic_focus": "Summoned Wolves and Vexes seems unchanged at first, but if they die while the summoner wear this focus they will rise from death once, filled with blood lust. These undead summons will cast Touch and Projectile spells when you do and heal you every time they kill an enemy.",
	"ars_elemental.page.curio_bag":"All those trinkets can easily clutter your inventory, but you never know when they will be useful. Using some magebloom fiber you can make a pouch to store and carry around curios, potion flasks, mirrors, charms and other small items. You can also open it with $(k:ars_elemental.open_pouch) while in the hotbar or in a curio slot.",
	"ars_elemental.page.water_upstream": "This block generates an upstream current that will make surrounding entities float upwards even if they are not in water source blocks.",

	"ars_elemental.page1.fire_golem": "Not yet implemented. The fire golem can be used as a wandering sentry, like the weald walkers. It will shoot flare homing projectiles at enemies and patrol around the area defined with the wand.",
	"ars_elemental.page1.mermaid": "Not yet implemented. The mermaid can be summoned by right-clicking on Prismarine to transform it in a Siren Shrine.",

	"item.ars_nouveau.familiar_siren" : "Bound Script: Siren - WIP",
	"ars_nouveau.familiar_name.siren": "Siren - WIP do not summon",
	"ars_nouveau.familiar_desc.siren": "WORK IN PROGRESS. A Siren Familiar will increase the damage of Water spells by 2. It will also give Dolphin Grace II to the summoner while in water. Obtained by performing the Ritual of Binding near a Siren.",
	"item.ars_nouveau.familiar_firenando": "Bound Script: Fire Golem - NYI",
	"ars_nouveau.familiar_name.firenando": "Fire Golem - WIP do not summon",
	"ars_nouveau.familiar_desc.firenando": "WORK IN PROGRESS. A Fire Golem Familiar will increase the damage of Fire spells by 2 and shoot homing flare spells at enemies. Obtained by performing the Ritual of Binding near a Fire Golem.",

	"item.ars_nouveau.glyph_watery_grave" : "Glyph of Watery Grave",
	"ars_nouveau.glyph_name.watery_grave" : "Watery Grave",
	"ars_nouveau.glyph_desc.watery_grave" : "This spell dooms a creature to drown. Reduces the target air supply and causes drowning damage when depleted. Similar to gravity the target will sunken down if in water, can be augmented with ExtendTime.",
	"item.ars_nouveau.glyph_conjure_dirt" : "Glyph of Conjure Terrain",
	"ars_nouveau.glyph_name.conjure_dirt" : "Conjure Terrain",
	"ars_nouveau.glyph_desc.conjure_dirt" : "Places Dirt or other terrain blocks. Can be augmented with AoE and Pierce to place more blocks, Amplify to place cobblestone or one of the following combinations (Note: if one of these triggers, the spell will end after the conjure terrain effect). If augmented with Amplify and followed by Smelt, it will place Stone. If followed by Crush it will place Sand or, if amplified, Sandstone.",

	"item.ars_nouveau.glyph_homing_projectile": "Glyph of Homing Projectile",
	"ars_nouveau.glyph_name.homing_projectile" : "Homing Projectile",
	"ars_nouveau.glyph_desc.homing_projectile" : "This projectile seek the nearest entity and follow it, will behave as a classic projectile while there are no valid targets. Players will only be targeted if augmented by Sensitive.",
	"item.ars_nouveau.glyph_curved_projectile" : "Glyph of Arc Projectile",
	"ars_nouveau.glyph_name.curved_projectile" : "Arc Projectile",
	"ars_nouveau.glyph_desc.curved_projectile" : "This projectile is affected by gravity. Every Pierce applied will make it bounce one time when it hit the ground.",


	"ars_nouveau.school.necromancy" : "Anima",
	"item.ars_nouveau.glyph_life_link" : "Glyph of Life Link",
	"ars_nouveau.glyph_name.life_link" : "Life Link",
	"ars_nouveau.glyph_desc.life_link" : "You create a link between your life force and the target's. Any damage dealt to you will be shared with the target and any healing of the target will be shared with you.",
	"item.ars_nouveau.glyph_charm" : "Glyph of Charm",
	"ars_nouveau.glyph_name.charm" : "Charm",
	"ars_nouveau.glyph_desc.charm" : "Try to dominate the mind of enemy, making them fight for you as a temporary ally, a tamable mob, to tame it, or a wild animal, to make it fall in love. Each Amplify and damage dealt raises the chance of successfully charming the target, as stronger mobs will have higher resistance to your control."

}
