{
  "name": "Вступление",
  "icon": "minecraft:paper",
  "category": "survive",
  "priority": true,
  "pages": [
    {
      "type": "text",
      "text": "Когда кто-либо осознает, что потерялся или сбился с пути, сохранение хладнокровия даётся куда труднее, ($(italic)хладнокровие – это способность принимать адекватные решения в экстремальных ситуациях$()) а иногда возникают ситуации, когда испытанием может обернуться не только поддержание здравомыслия, но и жизни."
    },
    {
      "type": "text",
      "text": "Если вы попали впросак, наша книга содержит множество советов и техник, способных существенно повысить ваши шансы на выживание. К примеру, работая с интерфейсом блоков из Pyrotech, зажмите $(sneak), чтобы отобразить количество предметов, или, не отпуская $(sneak), покрутите колёсико мыши – так вы сможете класть или забирать небольшое количество предметов."
    },
    {
      "type": "text",
      "text": "Другая техника, способная существенно повысить ваши шансы на выживание — это техника правильного разведения костра. $(p)$(item)Костёр$() — важнейшее звено искусного сосуществования с дикой природой, ведь $(item)костёр$() - фундаментальная основа, обязанная находиться в библиотеке каждого желающего постичь азы экстремального туризма."
    },
    {
      "type": "text",
      "text": "Когда вы ютитесь под покровом ночи, $(item)костёр$() станет прекрасным средством нагнетания атмосферы и ужаса во время погружения в увлекательные, но всё ещё довольно предсказуемые страшилки.$(br) Однако в вашем незавидном положении, нагнетание страха ради острых ощущений, возможно, не в приоритете."
    },
    {
      "type": "text",
      "text": "Вам, человеку, претерпевающему настоящий ужас выживания в дикой природе совсем не увлекательным и непредсказуемым образом, $(info_ru) $(item)костёр$() как нельзя лучше сгодится для готовки и станет неплохим источником света — света, способного совладать с Вашим страхом, неизбежно нагнетающим под покровом ночи, когда мрак и холод с ног до головы окутывает Вас."
    },
    {
      "type": "text",
      "text": "И разумеется, будучи важнейшим звеном и фундаментальной основой библиотеки каждого экстремала, наше руководство содержит азы правильного применения такой жизненно необходимой техники, как разведение костра."
    },
    {
      "type": "relations",
      "entries": [
        "survive/campfire"
      ]
    }
  ]
}