{
  "item.hexways.portal_staff": "Portal Staff",
  "hexcasting.spell.hexways:twowayportal": "Summon 2 Way Portal",
  "hexcasting.spell.hexways:onewayportal": "Summon 1 Way Portal",
  "hexcasting.spell.hexways:removeportal": "Remove Portal",
  "hexcasting.spell.hexways:rotateportal": "Rotate Portal",
  "hexcasting.spell.hexways:moveportalinput": "Move Portal",
  "hexcasting.spell.hexways:summonscry": "Summon Scry",
  "hexcasting.spell.hexways:getoutputinfo": "Get Output Info",
  "hexcasting.spell.hexways:resizeportal": "Resize Portal",
  "hexcasting.spell.hexways:setportalsides": "Set Sides Portal",
  "hexcasting.spell.hexways:rotatesideofportal": "Rotate Output :weedHexxy:",

  "portalhexaddon.entry.hexways": "Hex Ways",
  "portalhexaddon.page.hexways.onewayportal": "Accepts the arguments of 2-way portal, but constructs a portal restricted to unilateral traversal. The specialized use case brings a steeper cost of 32 charged amethyst.",
  "portalhexaddon.page.hexways.twowayportal": "Accepts a vector for the portal's input, one for output, a third for rotation, and a number for its initial radius. Costs 16 charged amethyst per unit of size.",
  "portalhexaddon.page.hexways.summonscry": "Works as a 1-way portal, but does not provide travel. Not as useful as a full-fledged portal, but is frugal in the cost of knowledge and amethyst. Costs about 4 shards per unit of size.",
  "portalhexaddon.page.hexways.moveportalinput": "Takes a portal entity and a location vector, and relocates its input to that location. Since portals are not one single entity, but a pair, the 'input' refers to the side passed to the spell. Costs 2 dust.",
  "portalhexaddon.page.hexways.removeportal": "Alas, if a portal provides the visage of too much for my eyes to handle, this spell may cut the string, banishing a portal pair. Costs no _media.",
  "portalhexaddon.page.hexways.portalambit": "Astoundingly, these portals... the range of my _Hexes may flow through them, albeit diminished. It seems my influence stretches outside to the other end of a portal, at half the remaining distance from me. As such, I may find the equation \"(32 - my location)/2\" to suffice for the added reach.",
  "portalhexaddon.page.hexways.setportalsides": "As, well, $(italic)familiar/$, I am with hexagons, sadly they don't fit every situation. But with this spell, I may alter the count of a portal's sides and roll, free of cost.",
  "portalhexaddon.page.hexways.resizeportal": "Passing a portal, height, and width, I may change the size of the portal, reverting it to a hexagonal shape, curiously. Costs shards equal to the average of the height and width.",
  "portalhexaddon.page.hexways.getoutputinfo": "This nifty pattern returns a portal's output portal, or its output location as a vector if there is no output portal. This could be useful combined with Portal Ambit. Costs no _media.",
  "portalhexaddon.page.hexways.getoutputinfocont": "After confusion, I concluded that this pattern works the best with Move Portal, due to getting the output portal, if it is a 2-way portal. Another use for this pattern may be for raycasts, since the casts don't pass through portals, but with this, I can emulate the raycast.",
  "portalhexaddon.page.hexways.rotateportal": "Ah, fickle rotation vectors. To my luck, I may use this spell to change the rotation of a given portal. Notably, it rotates its output as well, and at no cost.",
  "portalhexaddon.page.hexways.portalambittitle": "Portal Ambit",
  "portalhexaddon.page.hexways.pageintro": "I have come across a method by which I can imitate the phenomenon of wormholes (or perhaps, electron tunneling?), using media. This discovery was powered by the presence of another modification, \"Immersive Portals\". How exciting! I shall utilize this revelation posthaste.",
  "portalhexaddon.page.hexways.pageintrotitle": "Hex Portals?",

  "portalhexaddon.page.hexways.getoutputinfoconttitle": "Get Output Info, Cont."
}