{
  "hexportation.entry.conduit": "Conduits",

  "hexcasting.action.hexportation:make_conduit": "Create Conduit",
  "hexportation.page.make_conduit": "Takes the position & normal of the source storage and the position & normal of the sink storage and creates a media conduit.$(br)Costs 36 Charged Amethyst to weave the conduit no matter its length.",
  "hexcasting.action.hexportation:send_item": "Send",
  "hexportation.page.send_item": "Sends the specified amount of items through the conduit. Will take the first resources it finds.$(br)Free if used in a spell circle.",
  "hexcasting.action.hexportation:get_source_inv": "Source Data",
  "hexportation.page.get_source_inv": "Returns a list of Views that reperesent each slot in the conduit's source storage.",
  "hexcasting.action.hexportation:get_sink_inv": "Sink Data",
  "hexportation.page.get_sink_inv": "Returns a list of Views that reperesent each slot in the conduit's sink storage.",
  "hexcasting.action.hexportation:send_item_filt": "Metered Send",
  "hexportation.page.send_item_filt": "Will attempt to send the specified amount of resource from each slot respectively. Will not mishap if the list does not match the storage size.$(br)Free if used in a spell circle.",
  "hexcasting.action.hexportation:get_view_amount": "View Prfn. : Amount",
  "hexportation.page.get_view_amount": "Returns the amount of the resources in the specified view",
  "hexcasting.action.hexportation:get_view_capacity": "View Prfn. : Capacity",
  "hexportation.page.get_view_capacity": "Returns the capacity of the resources in the specified view",
  "hexcasting.action.hexportation:get_view_name": "View Prfn. : Name",
  "hexportation.page.get_view_name": "Returns the name of the resources in the specified view",
  "hexportation.page.fluid_units": "It should be noted that whilst a view iota that represents a fluid will display its amount/capacity in millibuckets for ease of comparison, the patterns to get each value will return the amount in droplets.$(br) Conversions between fluid units can be found elsewhere, but for simplicities sake, 1 Bucket = 81000 Droplets",
  "hexcasting.action.hexportation:slurp": "Slurp",
  "hexportation.page.slurp": "Will grab one item entity at the conduit's source and insert it into the target inventory. Can also grab a buckets worth of fluid in the same way.$(br)Free if used in a spell circle.",
  "hexcasting.action.hexportation:spit": "Spit",
  "hexportation.page.spit": "Will take the contents of the first filled slot of the source inventory and drop it at the conduit's target. Can also place a buckets worth of fluid in the same way.$(br)Free if used in a Spell Circle",
  "hexcasting.action.hexportation:transplace": "Transplace",
  "hexportation.page.transplace": "Will transport any and all entities standing within the source position of the conduit to the sink position of said conduit.$(br)Free if used in a spell circle, otherwise 1 shard per victim.",

  "hexcasting.mishap.invalid_value.class.conduit": "a conduit",
  "hexcasting.mishap.invalid_value.class.invalid_conduit": "a valid conduit",
  "hexcasting.mishap.invalid_value.class.view": "a view",

  "hexportation.energyname": "Energy"
}