{
	"name": "Celestial map",
	"icon": "minecraft:filled_map",
	"category": "7_about_the_mod",
	"pages": [
		{
			"type": "text",
			"text": "Any mod adding new dimension can be used to add planets to the $(item)Celestial map$(). You simply modify the latest to your liking through the $(item)celestialObjects-*.xml$() files.$(br2)The default file is largely commented to explain you how to read and modify it."
		},
		{
			"type": "text",
			"text": "You may have as many $(item)celestialObjects-*.xml$() files as you want. If none are present, the default one will be installed.$(br2)Remember to rename the default file to avoid confusion.$(br2)Different gameplays are possible, from a simple single planet to advanced maps with thousands of planets."
		},
		{
			"type": "text",
			"title": "XML 101",
			"text": "To get started, consider learning a bit about $(item)XML$(), a text format designed to store and transport data for both human and machine use.$(br)There's many tutorials available, we suggest the one from $(l:https://www.w3schools.com/xml)W3C schools$(/l).$(br2)XML files can be edited with any text editor, however, using an XML validating editor will save you a lot of pain from common syntax errors before even starting the game."
		},
		{
			"type": "text",
			"text": "You can check for $(item)XML Notepad$(), $(item)XMLCopy editor$() or $(item)emacs$(), among many more. Most development editors also include XML validation support, we recommend the free Community Edition of $(item)IntelliJ IDEA$().$(br2)Seasoned developpers can generate celestial map from scripting, or simply format it from XML into a web page: applications are endless..."
		},
		{
			"type": "text",
			"title": "Plain overworld",
			"text": "If you mostly play in the overworld, consider having it as a single giant planet as big as the space dimension with no moon nor sun. This gives you a very large world border but no planet transition per say.$(br2)While this feels simpler, keep in mind that you'll miss the more advanced game aspect of the mod with no other planets to explore."
		},
		{
			"type": "text",
			"text": "For this, change the $(item)celestialObjects-default.xml$() file to remove the end, sun and nether, then change overworld & space offset to 0;0, then set border size for space, hyperspace and overworld to 400000.$(br2)Never go further than 200k radius or you'll expose bugs from the base game. You should watch $(l:https://youtu.be/v6-IAntqg5w)AntVenom panel$(/l) to learn more about this."
		},
		{
			"type": "text",
			"title": "Advanced map",
			"text": "For a more 'space life of exploration' gameplay, consider choosing smaller planets (2000 to 6000 m diameter) while keeping them in medium sized spaces (20 km diameter) in a maximized hyperspace (400 km diameter).$(br2)This keeps your disk space usage reasonable (~50 GB) while maximizing the number of planets."
		},
		{
			"type": "text",
			"text": "In practice, you want to first position & size planets using a graphical representation on paper or something like GoogleSheet. Here is an example with the mod AdventOfAscension: $(l:https://docs.google.com/spreadsheets/d/11JG4dTQOPe95q5DGIgLOdS9PK6qNxMMJEamXtDwdFfQ)graphic template$().$(br2)From the graphic, you can easily implement planets coordinates so they don't overlap each others."
		},
		{
			"type": "text",
			"title": "Hints",
			"text": "The $(item)Celestial map$() only needs to be defined server side. Clients only needs to know about added dimensions at boot time. Client will receive the relevant part of the map, as needed.$(br2)Consider using a mod like $(item)JustEnoughDimensions$() to easily add many new dimensions."
		},
		{
			"type": "text",
			"text": "You can reload the $(item)Celestial map$() at any time with $(item)/wreload$(), however you'll need to restart the game when adding new Space or Hyperspace dimensions.$(br2)If the game crash at boot, check the debug.log file for details as you probably have overlapping areas between celestial objects."
		}
	],
	"sortnum": 1
}
