{
	"name": "Commands",
	"icon": "minecraft:command_block",
	"category": "7_about_the_mod",
	"pages": [
		{
			"type": "text",
			"text": "Unless otherwise stated, all commands require to be an $(item)OPerator$(). Use a permission plugin to give access to staff or players depending on your game style.$(br2)Most commands can be used from console or command blocks."
		},
		{
			"type": "text",
			"title": "Lost and found",
			"text": "The $(item)/wfind <partial ship name>$() command dump coordinates to all ships whose name partially match the given parameter.$(br2)The search is case sensitive, accross all dimensions, including offline ships and unloaded chunks."
		},
		{
			"type": "text",
			"title": "To infinity...",
			"text": "The $(item)/space (<player selector>) (<target dimension>)$() command sends selected players to the targetted dimension.$(br2)By default (no target set), player is sent to space (from a planet or hyperspace), or to the closest planet (from space).$(br2)Target can be a dimension id or keywords like 'overworld', 'nether', 'end', 'theend', 'space', 'hyper', 'hyperspace', or 'space'."
		},
		{
			"type": "text",
			"text": "$(br2)When entering a non-orbiting planet, player will be teleported to the center of that celestial object.$(br2)When required, altitude is adjusted to prevent suffocation and fall damage so that player would be inside the building top floor, or on top of the roof.$(br2)Use this command to make a space elevator with a command block."
		},
		{
			"type": "text",
			"title": "Go back to bed!",
			"text": "The $(item)/wbed (<player selector>)$() command teleports targetted online players to their bed location in their current dimension.$(br2)Teleporting other players requires sender to be console, command block or creative player.$(br2)In case no player could be found, you'll be teleported to your own bed."
		},
		{
			"type": "text",
			"title": "Reload configuration",
			"text": "The $(item)/wreload$() command reloads the mod's configuration files and refresh all players accordingly.$(br2)Use it notably to update dictionary tags, celestial map rendering or such without having to restart the server.$(br2)In most cases, reloading the celestial map won't crash the server, allowing you to quickly test your corrections."
		},
		{
			"type": "text",
			"title": "World generation",
			"text": "The $(item)/generate (<x> <y> <z>) <structure group> (<structure name>)$() command generates a new structure centered on the player.$(br2)Coordinates starting with ~ are relatives, same as vanilla commands.$(br2)When no name is provided, a random one is selected.$(br2)Console isn't supported."
		},
		{
			"type": "text",
			"text": "$(br2)Use an invalid structure group or name to get the list of supported values in your configuration.$(br2)Except for ship, structures will only generate in space.$(br2)You better be in creative to avoid suffocating in the generated structure."
		},
		{
			"type": "text",
			"title": "Pest control",
			"text": "The $(item)/wentity <radius> (<filter>) (<kill?>)$() command lists entities in the given area and, optionally, kill them.$(br2)Radius defines area among loaded chunks of the player's dimension. A positive number designates a radius in blocks around the player. An invalid radius like '-', 'world', 'global' or any negative number designates all loaded chunks in the current dimension."
		},
		{
			"type": "text",
			"text": "$(br2)Use the '*' filter to select all entity type, otherwise enter a case insensitive partial match.$(br)When a single entity type is listed, all individual entity coordinates are provided.$(br2)Use 'yes' or 'y' or '1' to confirm the kill command."
		},
		{
			"type": "text",
			"title": "Dump that loot!",
			"text": "The $(item)/wdump (<inventory type>) (<player selector>)$() command writes a loot table in console for the selected inventory type of the selected player.$(br2)Inventory type can be:$(li)container: any item container below or next to the player$(li)enderchest: player's enderchest$(li)hand: player's main hand$(li)player: player's inventory."
		},
		{
			"type": "text",
			"text": "$(br2)Use this to update your loot configuration files, to investigate possible corrupted blocks or cheaters."
		},
		{
			"type": "text",
			"title": "Invisible",
			"text": "The $(item)/invisible <player name>$() command toggles the vanilla invisibility flag for a given online player. Name is case sensitive.$(br2)Use this as a cheap and simple 'vanish' when you've no plugins."
		},
		{
			"type": "text",
			"title": "Render properties",
			"text": "The $(item)/wrender$() command dumps all render related properties for the block at the player feets or right below it.$(br2)Console isn't supported, obviously."
		}
	],
	"sortnum": 1
}
