{
  "name": "Witches' Altar",
  "category": "devices",
  "icon": "bewitchment:stone_witches_altar",
  "priority": true,
  "pages": [
	{
	  "type": "text",
	  "text": "Magic Energy, or ME,  exists in all forms of life, from the smallest seedling to the great Dragon at the End of Time. Other groups may call it “Vis” or “Lifepoints” or “Magan” or similar, but it is in essence the same raw force of life and nature. Flora must be placed near an Altar to produce ME, as ME flows freely through plants and fungi."
	},
	{
	  "type": "text",
	  "text": "While ME exists in animals as well, it cannot be harnessed from them, as their soul prevents it from leaving their body until said soul leaves them. However certain remains of animals (and humans), have resonate ME, not enough to be harnessed by an Altar, but enough to act as reagents in rituals."
	},
	{
	  "type": "text",
	  "title": "Altar",
	  "text": "The heart of any witch’s setup, the altar can harness the powers of local flora in a form that other devices can use, and most devices must be placed near the Altar to be usable. Altars can be made from many materials, from Stone to Nether Bricks and more, and can be finalized by placing a carpet of any color on top. An altar can also be enhanced with certain items. Information on the modifiers can be found in the following pages."
	},
	{
	  "type": "crafting",
	  "title": "Altar Crafting",
	  "recipe": "bewitchment:stone_witches_altar"
	},
	{
	  "type": "text",
	  "title": "Altar Modifiers",
	  "text": "Cups provide a small boost to both gain and multiplier. Includes goblets, bottles, and flower pots. Swords increase a multiplier. Includes the athame, boline, and other blades. Wands give a boost to max altar power. Includes torches, candles, and end rods. Pentacles increase gain. Includes skulls, gems, and pentacles."
	},
	{
	  "type": "multiblock",
	  "name": "How to Build",
	  "multiblock": {
		"mapping": {
		  "A": "bewitchment:stone_witches_altar[type=0]",
		  "0": "bewitchment:stone_witches_altar[type=0]"
		},
		"pattern": [
		  [
			"AA",
			"0A",
			"AA"
		  ]
		]
	  },
	  "text": "The blocks around the altar must $(i)not$() be other altar blocks"
	}
  ]
}
