{
  "block.hexerei.belladonna_flower": "Belladonna Plant",
  "block.hexerei.mandrake_flower": "Mandrake Plant",
  "tooltip.hexerei.coffer_shift": "Can be placed in the world.",
  "tooltip.hexerei.coffer_shift_2": "Can store items and be moved like a shulker box.",
  "tooltip.hexerei.coffer_shift_3": "Can be renamed.",
  "tooltip.hexerei.coffer_shift_4": "Punch the Coffer to pick up directly to your inventory.",
  "tooltip.hexerei.coffer_shift_5": "Can be dyed.",
  "tooltip.hexerei.crow_flute_wander_button_0": "Crows set to wander mode will fly around,",
  "tooltip.hexerei.crow_flute_wander_button_1": "if they travel too far from their perch they will fly back.",
  "tooltip.hexerei.crow_flute_pickpocket_button_2": "and drop the item after a while.",
  "book.hexerei.intro_page_6.passage_1": "  In the configs you can change the font from fancy to normal minecraft font if its hard to read or you are wanting more immersion.\n  You are also able to hover items and press %kkey.hexerei.book_hovering_recipe for recipes and %kkey.hexerei.book_hovering_uses for uses to open up the JEI page respectively",
  "book.hexerei.items_coffer_1.passage_2": "  The Coffer is a very useful storage device for witches, especially ones who have some crow friends.",
  "book.hexerei.items_coffer_4.passage_1": "  For ease of use coffers can be picked up with a simple punch. They will retain all of their data when moved by the player. They also will display their items while opened.\n\n  On the right side of the GUI of the coffer will show a button with a crow on it.",
  "book.hexerei.items_coffer_5.passage_1": "  While toggled the crow button will allow crows on gather mode to check items inside its coffers and look in the area for items matching the any of the contents of the coffer to deposit. \n\n  Crows also with a perch located on a coffer will pick up any item in the area and return it to that coffer.",
  "book.hexerei.items_herb_jar_1.passage_2": "  The Herb Jar is the drawer for witches. This device can hold up to 1024 items of only one item.\n  Crows also will find and place matching items into jars just like they do coffers if you have the button toggled within its GUI.",
  "book.hexerei.items_herb_jar_2.passage_1": "  To access the jar GUI simply right click on any of the faces except the front, to access from the front right click and crouch with a bare hand.\n Take items out of the jars by punching the face or take a full stack by crouch punching the face.",
  "book.hexerei.items_sage_burning_plate_1.passage_2": "  The Sage Burning Plate is for protection around the witches setup. Simply place one down fill it with a bundle of dried sage and light it to protect your area.\n  The default area of the spawn protection is a radius of 48. Though monsters will still wander in the radius.",
  "book.hexerei.items_book_of_shadows_1.passage_2": "  Yes the book is talking about itself, but you are going need this in the witching world.\n\n The cover of the book is dyed with the dye used in crafting. The corners of the book can also be dyed after crafting by placing it back into the grid with another dye.",
  "book.hexerei.items_drying_rack_1.passage_2": "  These are used for drying items that have a recipe to be dried. They are quite useful for obtaining early game leather by drying rotten flesh into leather. To place items into a drying rack simply right click with the item stack in hand.",
  "book.hexerei.items_pestle_and_mortar_1.passage_1": "Pestle And Mortar",
  "book.hexerei.items_pestle_and_mortar_3.passage_1": "  To add items to the mortar simply right click with the item in hand, it will only add one item at a time. Crouch and right click the mortar to pull out all items within as long as they are not already crafting. You can also simply right click to remove items that have completed their crafting process.",
  "book.hexerei.items_dipper_1.passage_2": "  The Dipper is an addon for the Mixing Cauldron for its main function of making candles by dipping string into the tallow below. Simply place on top of a Mixing Cauldron by crouching and right clicking the top of the cauldron with the Dipper.",
  "book.hexerei.items_dipper_3.passage_1": "  The Dipper has 3 separate slots each of which can hold a single item. If the fluid below matches a recipe for one of the items on the dipper it will begin dipping it in the fluid til the recipe completes to transform the item. This meaning the Dipper can not only make candles in tallow but be able to make any item",
  "book.hexerei.items_dipper_4.passage_1": " in any fluid as long as it matches a recipe. For example, you can color candles with blood by putting them on a dipper with enough blood below.",
  "book.hexerei.items_candle_1.passage_1": "Candle",
  "book.hexerei.items_candle_1.passage_2": "  Candles are great decoration options as you can mix and match different candles in the same block up to 4 candles. Each candle has a lit time of 35 minutes, this may vary as infused candles come out along with different kinds of candles.",
  "book.hexerei.items_candle_3.passage_1": "  You are able to light each separate candle from first placed to last placed, this may changed to where you use the flint and steel to light the candle you are looking at. Candles are able to float around an Altar as well as later will float around the player for rituals and spells.",
  "book.hexerei.items_candelabra_1.passage_2": "  Candelabras are a great decoration item as you can place them under a block or above a block to give them a different look. Works great with chains above!",
  "book.hexerei.items_crystal_ball_1.passage_2": "  The Crystal Ball is still a work in progress, right now it acts as just a decoration item. This will probably be used for either scrying to find players or positions, or for infusing certain items.",
  "book.hexerei.items_dowsing_rod_1.passage_2": "  The Dowsing Rod is one of the first items a witch should look for as it points them in the right direction of where they need to go. Crouch and right clicking will swap the mode between Swamp to Jungle. Right clicking will find a new position in the closest biome of the selected type.",
  "book.hexerei.items_blood_sigil_1.passage_2": "  The Blood Sigil is an attachment for the Mixing Cauldron and what is needed to acquire a Bottle of Blood to make your brooms. This will also be used in other sorts of recipes in the future. As well as other types of sigils to be added for different methods in the cauldron.",
  "book.hexerei.items_blood_bottle_1.passage_2": "  To acquire the blood you first need a Mixing Cauldron with a Blood Sigil inside, then simply jump in the cauldron 3 times to drain enough blood for one bottle to scoop it out. To scoop it out simply right click the cauldron with an empty bottle.",
  "book.hexerei.items_willow_broom_1.passage_2": "  A witches main tool of transportation, the broom. So far there are three types of brooms, this one being the slowest of them. These can be upgraded in 3 different slots, Misc, Satchel, and Brush. A brush is what powers the brooms flight and comes with every fresh broom made.",
  "book.hexerei.items_willow_broom_3.passage_1": "  To access the brooms inventory simply crouch and right click while the broom is in the world. While flying the broom, the brush gets damaged and can break. So, the witch must come prepared and craft some additional brushes to fuel the broom.",
  "book.hexerei.items_willow_broom_4.passage_1": "  The best way is to stash the extra brushes within the broom's satchel. Adding a small satchel will add 9 extra spaces to hold items within, and each tier above will hold an additional 9 spaces.",
  "book.hexerei.items_mahogany_broom_1.passage_2": "  The fastest of the three brooms. The mahogany broom as an item also has fire resistance so it cannot be lost in lava or burn to fire. Although, it can break when flying the broom into fire, unless the broom has a netherite tip attachment.",
  "book.hexerei.items_gold_rings_1.passage_2": "  The first broom attachment made, there will probably be some sort of effects to these little trinkets later but for now it is just a cosmetic addition to the broom. To use open up a broom's menu and place inside the Misc slot.",
  "book.hexerei.items_broom_keychain_1.passage_2": "  The cutest broom attachment as it makes a keychain trinket of the item imprinted onto it. To imprint an item onto the chain simply add both items into a crafting grid. To use open up a broom's menu and place inside the Misc slot.",
  "book.hexerei.items_broom_keychain_3.passage_1": "  The item is no longer consumed fully and you can retrieve it by placing the Broom Chain back into a crafting grid and it will pull the item out of it.\n  The chain will even swing around as the broom moves around to add extra aesthetics!",
  "book.hexerei.items_broom_netherite_tip_1.passage_2": "  This broom attachment is very useful for nether flight, as it allows the broom to fly completely through lava or any fires without getting damaged. Just like the rest of the misc attachments, this goes in the leftmost slot of the broom.",
  "book.hexerei.items_broom_waterproof_tip_1.passage_2": "  Have a base underwater but tired of falling off your broom and not being able to use it? Try the waterproof tip! This allows the player to stay on the broom while riding underwater. Just like the rest of the misc attachments, this goes in the leftmost slot of the broom.",
  "book.hexerei.items_small_satchel_1.passage_2": "  The Small Satchel is the first satchel for your brooms. This adds an additional 9 slots that can be used to store items. To add and access simply open your brooms menu and place the satchel into the middle slot of the broom.",
  "book.hexerei.items_medium_satchel_1.passage_2": "  The Medium Satchel is the second tier of satchels. This satchel adds an additional 18 slots that can be used to store items. To add and access simply open your brooms menu and place the satchel into the middle slot of the broom.",
  "book.hexerei.items_large_satchel_1.passage_2": "  The Large Satchel is the highest tier of satchels. The largest of the satchels adds an additional 27 slots that can be used to store items. To add and access simply open your brooms menu and place the satchel into the middle slot of the broom.",
  "book.hexerei.items_broom_brush_1.passage_2": "  The Broom Brush is the last attachment type for the broom. This is what fuels the broom to be able to fly, and while flying the brush takes durability damage. Once the brush runs out of durability it does break, so be sure you have extras when flying long distances.",
  "book.hexerei.items_wet_broom_brush_1.passage_2": "  To make a broom brush you must first craft the wet one within a cauldron, then throw this on a drying rack to get your broom brush ready for your broom.",
  "book.hexerei.items_herb_enhanced_broom_brush_1.passage_2": "  Just like the normal Broom Brush other than it has more durability so it lasts longer in flight. These can be enchanted with Mending and Unbreaking.",
  "book.hexerei.items_wet_herb_enhanced_broom_brush_1.passage_2": "  Just like the normal Wet Broom Brush this is made in a cauldron and must be dried before using.",
  "book.hexerei.items_crow_flute_1.passage_2": "  The Crow Flute is an essential item for controlling your crow companions! .",
  "book.hexerei.items_seed_mixture_1.passage_2": "  Looking for a way to tame the crows? Well, Crows love this mixture of seeds. These crows are quite useful so it does take a bit to get one on your side. Be sure to make a fair amount of seed mixture to tame your crows.",
  "book.hexerei.items_warhammer_1.passage_2": "  Wait a minute, this isn't a witchy item. Looks like this is more for someone like the god of thunder. Maybe a crow will like to use this item. If not its quite good for bashing things in the face.",
  "book.hexerei.items_sage_seed_1.passage_2": "  These seeds are found by breaking grass. These are the seeds needed to grow the sage crop.",
  "book.hexerei.items_animal_fat_1.passage_2": "  Animal Fat is one of the core items needed to make Tallow. Tallow is used to make candles with the Dipper attachment. Can be obtained by killing any Cow, Pig, or Sheep, and is effected by looting.",
  "book.hexerei.items_infused_fabric_1.passage_2": "  Infused Fabric is the fabric used to craft the base witch outfit. It will have more uses than just armor but as of right now its just armor.",
  "book.hexerei.items_witch_helmet_1.passage_2": "  These pieces will have additional effects once spells and the coven witches are added. Each piece of the witch outfit can be dyed to be customized to your liking. They can also be renamed to give the color changing effects.",
  "book.hexerei.items_witch_chestplate_1.passage_2": "  These pieces will have additional effects once spells and the coven witches are added. Each piece of the witch outfit can be dyed to be customized to your liking. They can also be renamed to give the color changing effects.",
  "book.hexerei.items_witch_boots_1.passage_2": "  These pieces will have additional effects once spells and the coven witches are added. Each piece of the witch outfit can be dyed to be customized to your liking. They can also be renamed to give the color changing effects.",
  "book.hexerei.items_mushroom_witch_hat_1.passage_2": "  This hat is being a little hint towards what types off witches and covens are to come in future updates.",
  "book.hexerei.items_mandrake_flower_1.passage_1": "Mandrake Plant",
  "book.hexerei.items_mandrake_flower_1.passage_2": "  One of the flowers of Hexerei, the Mandrake, can be harvested by simply right clicking it when it is fully grown just like a sweet berry bush. Can be harvested when fully grown by right clicking just like a sweet berry bush.",
  "book.hexerei.items_belladonna_flower_1.passage_1": "Belladonna Plant",
  "book.hexerei.items_belladonna_flower_1.passage_2": "  The most poisonous plant of Hexerei, the Belladonna, probably should not be consumed in any way unless prepared in the proper manor. These plants can be harvested by simply right clicking it when it is fully grown just like a sweet berry bush.",
  "book.hexerei.items_mindful_trance_blend_1.passage_2": "  This is a hint to what is to come for candles. This will be for infusing candles with special effects to give off in the area when they are lit. This will be coming shortly in the future.",
  "book.hexerei.entities_index_page_1.passage_2": "  This chapter will be all about entities and how you interact with them!",
  "book.hexerei.entities_index_page_2.passage_1": "Entity Index Page",
  "book.hexerei.entities_crow_page_1.passage_2": "  The Crow is the first familiar of many to come to Hexerei. They can be tamed by giving the crows their favorite snackies which is the seed mixture made in the pestle and mortar. You can either throw the seeds onto the ground and nearby",
  "book.hexerei.structures_index_page_1.passage_2": "  This chapter will be all about the structures added to the world and how you can find them!",
  "book.hexerei.structures_index_page_2.passage_1": "Structure Index Page",
  "book.hexerei.structures_witch_hut_page_1.passage_2": "  Throughout the swamp you may come across different variations of a Hexerei witch hut. These huts come along with witches and all of their tools, and will later have more uses in future updates!",
  "book.hexerei.structures_witch_hut_page_2.passage_1": "  A great place to start off a base for an aspiring witch!",
  "book.hexerei.structures_dark_coven_page_1.passage_2": "  As well as witch huts you can also find Dark Covens within swamps. These are the home of witches, and in future updates they will be replaced with custom coven witches which will have their own special fitting in Hexerei.",
  "book.hexerei.structures_dark_coven_page_2.passage_1": "  Until then, you can find various crafting tools, armor, and herbs within the covens.",
  "book.hexerei.crafting_type.crafting_table": "  To craft you need a 3x3 crafting space and the items shown below.",
  "book.hexerei.crafting_type.mixing_cauldron": "  To craft you need a Mixing Cauldron and the items shown below.",
  "book.hexerei.crafting_type.dipper": "  To craft you need a Mixing Cauldron with a Dipper on top with the item and fluid shown below.",
  "book.hexerei.crafting_type.herb_drying_rack": "  To craft you need a Drying Rack with the item shown below.",
  "book.hexerei.crafting_type.pestle_and_mortar": "  To craft you need a Pestle and Mortar with the items shown below.",
  "block.hexerei.waxed_infused_fabric_carpet": "(Waxed) Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_block": "(Waxed) Infused Fabric Block",
  "block.hexerei.infused_fabric_carpet_dyed_white": "White Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_white": "(Waxed) White Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_orange": "Orange Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_orange": "(Waxed) Orange Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_magenta": "Magenta Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_magenta": "(Waxed) Magenta Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_light_blue": "Light Blue Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_light_blue": "(Waxed) Light Blue Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_yellow": "Yellow Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_yellow": "(Waxed) Yellow Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_lime": "Lime Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_lime": "(Waxed) Lime Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_pink": "Pink Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_pink": "(Waxed) Pink Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_gray": "Gray Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_gray": "(Waxed) Gray Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_light_gray": "Light Gray Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_light_gray": "(Waxed) Light Gray Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_cyan": "Cyan Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_cyan": "(Waxed) Cyan Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_purple": "Purple Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_purple": "(Waxed) Purple Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_blue": "Blue Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_blue": "(Waxed) Blue Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_brown": "Brown Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_brown": "(Waxed) brown Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_green": "Green Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_green": "(Waxed) Green Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_red": "Red Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_red": "(Waxed) Red Infused Fabric Carpet",
  "block.hexerei.infused_fabric_carpet_dyed_black": "Black Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_carpet_dyed_black": "(Waxed) Black Infused Fabric Carpet",
  "block.hexerei.infused_fabric_block_dyed_white": "White Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_white": "(Waxed) White Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_orange": "Orange Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_orange": "(Waxed) Orange Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_magenta": "Magenta Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_magenta": "(Waxed) Magenta Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_light_blue": "Light Blue Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_light_blue": "(Waxed) Light Blue Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_yellow": "Yellow Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_yellow": "(Waxed) Yellow Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_lime": "Lime Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_lime": "(Waxed) Lime Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_pink": "Pink Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_pink": "(Waxed) Pink Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_gray": "Gray Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_gray": "(Waxed) Gray Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_light_gray": "Light Gray Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_light_gray": "(Waxed) Light Gray Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_cyan": "Cyan Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_cyan": "(Waxed) Cyan Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_purple": "Purple Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_purple": "(Waxed) Purple Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_blue": "Blue Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_blue": "(Waxed) Blue Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_brown": "Brown Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_brown": "(Waxed) brown Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_green": "Green Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_green": "(Waxed) Green Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_red": "Red Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_red": "(Waxed) Red Infused Fabric Block",
  "block.hexerei.infused_fabric_block_dyed_black": "Black Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_block_dyed_black": "(Waxed) Black Infused Fabric Block",
  "block.hexerei.waxed_infused_fabric_carpet_ornate": "(Waxed) Ornate Infused Fabric Carpet",
  "block.hexerei.waxed_infused_fabric_block_ornate": "(Waxed) Ornate Infused Fabric Block",
  "block.hexerei.potted_mandrake_flower": "Potted Mandrake Plant",
  "block.hexerei.potted_belladonna_flower": "Potted Belladonna Plant"
}