{
	"category": "essentials:beam",
	"name": "Splitting Beams",
	"icon": "crossroads:beam_siphon",
	"sortnum": 0,
	"priority": false,
	"read_by_default": "true",
	"pages": [
		{
			"type": "patchouli:spotlight",
			"title": "Splitting Beams",
			"item": "crossroads:beam_siphon",
			"text": "There are three different blocks that can split or redirect <thing>$(l:essentials:intro/beam)beams/$: The <item>Beam Splitter/$, the <item>Beam Siphon/$, and the <item>Beam Redirector/$.$(br2)"
		},
		{
			"type": "patchouli:text",
			"text": "The cheapest option is the <item>Beam Redirector/$, which is unable to split beams at all. It has two outputs and any received beams will be sent to one of the outputs. If it has a redstone signal, the input beam comes out the front (the end the arrows on the sides point to), otherwise it comes out the back.$(br2)The <item>Beam Redirector/$ is the cheap and "
		},
		{
			"type": "patchouli:text",
			"text": "simple way to control the direction beams go with redstone.$(br2)"
		},
		{
			"type": "patchouli:text",
			"text": "The <item>Beam Splitter/$ will split off a percentage of the incoming beam out the front (the end the arrows on the sides point to), and send the remainder out the back. The portion sent out the front is (redstone signal in)/15. It can accept a <thing>$(l:essentials/circuits)circuit/$ input for more precision. It is a good way of splitting a large incoming beam between two directions.$(br2)"
		},
		{
			"type": "patchouli:text",
			"text": "The <item>Beam Siphon/$ will send a set power from the incoming beam out the front (the end the arrows on the sides point to), and send the remainder out the back. The power of the beam siphoned off to the front is equal to the redstone signal received. It can accept a <thing>$(l:essentials/circuits)circuit/$ input for higher powers. It is a good way of supplying beams of a specific power to something, even if the input "
		},
		{
			"type": "patchouli:text",
			"text": "beam power is unknown.$(br2)"
		}
	]
}