{
  "hexweb.iota.response": "HTTPResponse{%s}",

  "hexweb.mishap.invalid_json_key": "The \"%s\" key is not present within the JsonIota!",
  "hexweb.mishap.cannot_json": "The %s iota has no direct Json translation!",
  "hexweb.mishap.too_early": "You tried accessing a HTTP response before it arrived!",
  "hexweb.mishap.blacklist_url": "This URL is blacklisted! Attempted: %s",
  "hexcasting.mishap.invalid_value.class.json": "a json object",
  "hexcasting.mishap.invalid_value.class.response": "a HTTP response",

  "hexweb.entry.json_patterns": "JSON Patterns",
  "hexweb.page.json_patterns.entry": "These patterns were taken from a series of notes scrawled on the walls of the room of a Douglas Crockford shortly before their disappearence.$(br)$(br)They describe ways of creating and manipulating a dictionary-like object which uses Strings for keys and a select range of iotas as values. I wonder what the practical applications are...",
  "hexcasting.action.hexweb:create_json": "Jason's Reflection",
  "hexweb.page.json_patterns.create_json": "Creates an empty JSON object.",
  "hexcasting.action.hexweb:parse_json": "Jason's Gambit",
  "hexweb.page.json_patterns.parse_json": "Turns the given String into a JSON object. If it cannot be parsed into a JSON object itself, a wrapper JSON object will be created.",
  "hexcasting.action.hexweb:has_element": "Jason's Purification",
  "hexweb.page.json_patterns.has_element": "Checks whether the given JSON iota has the given key.",
  "hexcasting.action.hexweb:get_element": "Jason's Purification II",
  "hexweb.page.json_patterns.get_element": "Gets the stored iota at the given key. Mishaps upon their being no iota.",
  "hexcasting.action.hexweb:set_element": "Jason's Exaltation",
  "hexweb.page.json_patterns.set_element": "Sets the given iota at the given key. Setting a Garbage iota removes the key.",

  "hexweb.entry.http_spells": "HTTP Spells",
  "hexweb.page.http_spells.entry": "While pondering the depths of one's mind, Sir Bernes-Lee caught a glimpse into another universe. With this view fresh in his mind, he quickly conjured a JSON object, imbued it with information, and sent it hurdling into the other universe.$(br)$(br)These are the patterns recovered after Berners-Lee was found dead having received enough information back to fry his mind.",
  "hexcasting.action.hexweb:request": "Request",
  "hexweb.page.http_spells.request": "Sends an HTTP request made of the given data, method, and headers to the provided URL.$(br2)The Response is truthy if a response is received.",
  "hexcasting.action.hexweb:get_response": "Get Response",
  "hexweb.page.http_spells.get_response": "Given a Response Iota, attempt to parse the results. Will Mishap if too early or an IOException is thrown."
}