{
  "name": "Regex Filter",
  "category": "filters",
  "icon": "modularrouters:regex_filter",
  "pages": [
    {
      "type": "text",
      "text": "This filter allows for matching of blocks and items with a regular expression, against the item's $(strong)registry name/$. Regular expressions are very powerful, but take some learning to unlock their full potential. However, basic regex usage isn't too difficult. There are many websites with tutorial information on regular expressions, e.g. $(l:https://regexone.com/)RegexOne/$."
    },
    {
      "type": "text",
      "title": "Registry Names",
      "text": "Because item filtering is done purely on the server, it can't know for sure what an item's displayed text is.  Therefore, all filtering matches are made against the item's internal $(thing)registry name/$. You can find this registry name by toggling on advanced tooltip display with $(thing)F3+H/$.$(p)Note that matching is done against only the part of the registry name $(italic)after/$ the colon."
    },
    {
      "type": "text",
      "text": "$(thing)To open the module GUI, $(thing)right-click/$ the filter, or $(thing)middle-click/$ / press $(bold)$(4)[$(k:modularrouters.configure)]/$ on a filter which is installed in a module.$(li)Type your regex into the textfield at the top, and hit $(thing)Return/$ or click the green $(bold)$(2)+/$ button. Your regex will be added to the list, assuming its syntax is valid. You can have up to 6 entries in one filter.$(li)Click the red $(bold)$(4)X/$ next to any regex to remove it from the list.$(li)Matches are case-insensitive."
    },
    {
      "type": "text",
      "title": "Example 1",
      "text": "A regex of 'ore' will match any items with 'ore' in their registry name (\"iron_ore\", \"gold_ore\", \"redstone_ore\"). Unfortunately, it will also match \"drill_core\", but you can avoid this by using a regex of $(1)_ore/$. To be even more specific, you could use $(1)_ore$/$, which also ensures that the string \"_ore\" is at the end of the item's registry name."
    },
    {
      "type": "text",
      "title": "Example 2",
      "text": "Configure a $(l:modules/player)Player Module/$ to extract from the player's main inventory, and put a regex filter containing $(1)_ore/$ in the module. This can be used to extract any ores from your inventory, regardless of where you are, into your ore processing system; very handy if you're mining far from your base and you want ores that you've mined to be sent home immediately."
    },
    {
      "type": "crafting",
      "recipe": "modularrouters:regex_filter"
    }
  ]
}
