{
  "name": "Aerial Interface",
  "icon": "pneumaticcraft:aerial_interface",
  "category": "machines",
  "advancement": "pneumaticcraft:advanced_pressure_tube",
  "pages": [
    {
      "type": "text",
      "text": "The $(item)Aerial Interface/$ is a very powerful device which can connect directly with a player's inventory. When sufficiently $(l:base_concepts/pressure)pressurized/$, it can be interacted with just like any other inventory. Instead of landing in the Interface, items get sent $(italic)directly/$ to the owning player. You could use a $(l:logistics/frames#requester)Logistics Requester Frame/$ on the Interface to keep yourself supplied with 64 torches, for example."
    },
    {
      "type": "text",
      "text": "By default, your main inventory is accessed through any side face of the Interface, and your armor slots are accessed via the top/bottom faces. However, this can be reconfigured via the $(bold)Side Configuration/$ GUI side-tab.$(p)You can connect any face to any of:$(li)Main inventory$(li)Armor slots$(li)Offhand slot$(li)Ender inventory (as accessed by vanilla $(item)Ender Chests/$)."
    },
    {
      "type": "text",
      "title": "Water Breathing",
      "text": "Obviously, because we have something that can link to a player, which is powered by $(l:base_concepts/pressure)air/$, there should be something that allows us to transfer this air when necessary - right? At a cost of 80mL/tick, you can breathe indefinitely under water.$(p)This is slightly more efficient than a $(l:armor/pneumatic_helmet)Pneumatic Helmet/$ with $(l:base_concepts/upgrades#scuba)SCUBA Upgrade/$, but does not provide the clear underwater vision."
    },
    {
      "type": "text",
      "title": "Interfacing Forge Energy",
      "text": "An $(item)Aerial Interface/$ accepts $(thing)Forge Energy/$ (compatible with RF power and the power from many other mods). The energy stored in its internal buffer (100,000) is used to charge any FE-chargeable item in the player's inventory (and armor slots)."
    },
    {
      "type": "text",
      "title": "Auto-Feeding",
      "text": "By inserting a $(l:base_concepts/upgrades#dispenser)Dispenser Upgrade/$ you can make the $(item)Aerial Interface/$ act like a remote auto-feeder. Only food items will be accepted by the Interface, and only when you're hungry enough to fully utilize the provided meal. Note that when an inventory offers a stack of >1, the Interface waits until you can consume that amount. To make sure the smallest amount of food can be utilized use slow inserters such as $(item)Hoppers/$."
    },
    {
      "type": "text",
      "title": "Experience Handling",
      "text": "The $(l:base_concepts/upgrades#dispenser)Dispenser Upgrade/$ also allows you to pump $(thing)XP fluids/$ into or out of the Interface. When multiple types of XP fluid exist, you can choose which one to use via the $(bold)Experience/$ tab in the GUI.  This tab also shows which mods' experience fluids have been detected and are available for use. $(l:base_concepts/memory_essence)Memory Essence/$ is always available to use."
    },
    {
      "type": "text",
      "title": "Experience Handling (cont.)",
      "text": "Note that the Interface doesn't have an internal liquid buffer; it uses your experience directly as a 'tank'. This means that when pumping XP in or out, you need a device that can transport liquids at a rate higher than the amount of liquid XP per XP point. This rate is 20mB/tick for all known XP fluids at the time of writing."
    },
    {
      "type": "text",
      "title": "Auto-Charging",
      "text": "By pointing a $(l:tubes/charging_module)Charging Module/$ at the $(item)Aerial Interface/$, you can charge any $(l:base_concepts/pressure)pressurizable/$ items in your inventory.$(p)Note that to charge any worn $(l:armor/overview)Pneumatic Armor/$ items, the Charging Module must be pointed at a side of the Interface which is connected to your armor slots."
    },
    {
      "type": "crafting",
      "text": "Creating an Aerial Interface",
      "recipe": "pneumaticcraft:aerial_interface"
    }
  ]
}