{
  "name": "Aphorism Tile",
  "icon": "pneumaticcraft:aphorism_tile",
  "category": "machines",
  "advancement": "pneumaticcraft:assembly_controller",
  "pages": [
    {
      "type": "text",
      "text": "$(thing)Aphorism Tiles/$ are like $(item)Signs/$, but they can display arbitrary amounts of text. Any text is automatically scaled so that the full text fits on the tile.$(p)When you place down an Aphorism Tile it $(ttcolor)$(t:This can be disabled in client config - see 'B:dramaSplash')defaults/$ to a random splash text from the $(l:http://mc-drama.herokuapp.com/)Drama Generator/$."
    },
    {
      "type": "text",
      "text": "$(li)$(item)Aphorism Tiles/$ can be edited in-place by $(thing)right-clicking/$ with an empty hand.$(li)Markup can be added by using $(thing)Alt + 0-9/a-f/l/m/n/o/r/$ ($(l:https://minecraft.gamepedia.com/Formatting_codes)standard Minecraft codes/$).$(li)Holding $(thing)F1/$ will show some popup help for the editor keybindings.$(li)$(item)Aphorism Tiles/$ can be recolored by $(thing)right-clicking/$ with any dye item. The tile border and background can be colored independently by clicking a corresponding area of the tile."
    },
    {
      "type": "text",
      "anchor": "items",
      "text": "$(li)$(item)Aphorism Tiles/$ can also display $(thing)items/$, instead of or along with text. You can specify an item to display by putting (on its own line) text in the format $(thing){item:<modid>:<itemid>}/$, e.g. $(thing){item:minecraft:diamond}/$.$(li)Alternatively, click the $(thing)Insert Item.../$ button on the left-hand GUI panel, and choose an item from the search popup. This will replace all the text on the current line. You can display multiple items on one tile."
    },
    {
      "type": "text",
      "text": "$(li)Tip: displayed items are scaled in size to match the height of text lines. If you're mixing text and items, keep text lines short to avoid tiny items.$(li)You can also use the slider on the left-hand GUI panel to set a $(thing)margin/$ for the tile's text, if you would like it to take up less space on the tile.$(li)Finally, you can use the checkbox on the left-hand GUI panel to make the whole tile $(thing)invisible/$, so that $(italic)only/$ the text (and/or items) is shown."
    },
    {
      "type": "text",
      "text": "$(li)Invisible Aphorism Tiles have no block shape at all unless you sneak, so they have potential uses as labels for chests, especially when displaying item(s). Since they have no shape, any interactions get passed to the block behind - right-clicking a chest, for example.$(li)Invisible tiles can be edited by sneak & right-clicking them (with any empty hand, as normal)."
    },
    {
      "type": "pneumaticcraft:assembly_system",
      "recipe": "pneumaticcraft:assembly/aphorism_tile"
    }
  ]
}