{
  "name": "Occult Energy - Intro",
  "icon": "elementaristics:textures/gui/icons/energy.png",
  "category": "energy",
  "advancement": "elementaristics:progress_energy",
  "priority": true,
  "pages": [
    {
      "type": "text",
      "text": "$(marked)Occult Energy$(), or $(marked)OE$() for short, is yet another form of energy.$(br)It is mainly present in Arcane Radiation, but can also be found in various different things.$(br2)Generally, OE is generated from some sort of $(marked)Generator$(), like the $(l:energy/entry_combustion)Arcane Combustion Generator$()."
    },
    {
      "type": "text",
      "text": "If one looks at any block connected to OE in any way while holding a $(linked:energy/entry_energy)Channeling Tool$(), they'll quickly notice blue letters in the top left of their screen, indicating the current amount of energy (in relation to the block's energy capacity).$(br2)Every one of these blocks can transfer their energy to or drain the energy from a block within $(marked)16 Blocks$().$(br)The transfer rate of a block is usually around $(t:Do note that this amount may greatly vary)20 OE per tick ($(marked)20 OE/t$())."
    },
    {
      "type": "text",
      "text": "An OE-Block can always either supply their energy to $(marked)one$() block, or drain the energy from $(marked)one block$().$(br)Usually, generators supply their energy, while OE-consumers drain energy.$(br)Almost every item connected to OE must be bound to a block providing OE. $(br)An item can be bound to such a block by using the item on the block while sneaking."
    },
    {
      "type": "text",
      "text": "To bind an OE-Block to another, one must use their $(l:energy/entry_channeling)Channeling Tool$() to $(br2)$(li)save a block position to the tool ($(marked)use + sneak$())$(li)apply a saved block position to an OE-Block ($(marked)use$()).$(br2)Considered that a block is bound to a position, the position the block is bound to can be viewed by simply looking at the block."
    }
  ]
}