{
  "name": "Specialty Items",
  "icon": "buddycards:zylex_medal",
  "category": "buddycards:enderlings",
  "sortnum": 3,
  "pages": [
    {
      "type": "text",
      "text": "Enderman and Enderlings have made quite some interesting things using Zylex. While you can't craft them yourself, if you make good friends with an Enderling they might offer you some of these rare items. They will offer these items after on every 3rd reset starting after the second one."
    },
    {
      "type": "spotlight",
      "item": "buddycards:zylex_band",
      "text": "The Zylex Rings are very useful for moving your collection around. Breaking vaults with a Zylex ring on will break the vault while keeping the items inside of it, simmilar to a shulker box.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "item": "buddycards:zylex_boots",
      "text": "The Zylex Boots are the same kinds of boots worn by Enderlings. They seem to work similarly to perfect buddysteel armor and will upgrade with your collection, and will also work with the same enchantments.",
      "link_recipe": true
    },
    {
      "type": "relations",
      "title": "Related Pages",
      "entries": [
        "buddycards:buddysteel/perfect_buddysteel_gear",
        "buddycards:enchantments/buddy_binding"
      ],
      "text": "We don't quite know how the boots are made, but they work with Buddy Binding and are very similar to Perfect Buddysteel"
    },
    {
      "type": "spotlight",
      "item": "buddycards:zylex_medal",
      "text": "The Zylex Medal is a medal that will let all Enderlings know you are a friend. When they see you with it and you've gone through all their items, they will refresh their trades without Zylex Tokens.",
      "link_recipe": true
    },
    {
      "type": "relations",
      "title": "Medal Enchantments",
      "entries": [
        "buddycards:enchantments/buddy_binding",
        "buddycards:enchantments/buddy_boost"
      ],
      "text": "The medal can also be enchanted with Buddy Binding and Buddy Boost. Buddy Boost I will give you Grading Luck I and Buddy Boost II will give you Grading Luck II."
    }
  ]
}