{
  "name": "Smart Chest",
  "icon": "pneumaticcraft:smart_chest",
  "category": "machines",
  "advancement": "pneumaticcraft:printed_circuit_board",
  "pages": [
    {
      "type": "text",
      "text": "The $(item)Smart Chest/$ is a 72-slot chest which (like its little brother the $(l:machines/reinforced_chest)Reinforced Chest/$) has obsidian-level blast resistance, and keeps its inventory when broken. However, it has some other very powerful features..."
    },
    {
      "type": "text",
      "title": "Slot Filtering",
      "text": "$(li)If you $(thing)Alt+Left-click/$ a slot with an item in it, the Smart Chest will start filtering that slot to only accept that item.$(li)You can $(thing)Alt+Left-click/$ a filtered slot to remove the filtering again.$(li)If you $(thing)Alt+Left-click/$ an empty slot, that slot and all subsequent slots will be closed, effectively reducing the inventory size.$(li)If you $(thing)Alt+Left-click/$ the first closed slot, all closed slots will be reopened."
    },
    {
      "type": "text",
      "title": "Pushing Items",
      "text": "Each face of the Smart Chest can be separately configured to push items, pull items or do nothing (the default). To configure faces, open the $(thing)Side Configuration/$ GUI tab.$(p)Faces configured to push items will try to send items from the Smart Chest to an adjacent inventory on that face.  With a $(item)Dispenser Upgrade/$ installed, the chest will eject items into the world if there is no adjacent inventory."
    },
    {
      "type": "text",
      "title": "Pulling Items",
      "text": "Faces configured to pull items will try to pull items from an adjacent inventory on that face.$(p)If you install a $(l:base_concepts/upgrades#magnet)Magnet Upgrade/$, the chest can absorb nearby items on the ground. This only works for faces that have been configured to pull items; the default pickup area is a 3x3x3 cube adjacent to the pulling face, which can be increased with $(l:base_concepts/upgrades#range)Range Upgrades/$."
    },
    {
      "type": "crafting",
      "text": "Creating a Smart Chest",
      "recipe": "pneumaticcraft:smart_chest"
    }
  ]
}
