{
	"name": "Connecting components",
	"icon": "rs_ctr2:data_cable",
	"category": "rs_ctr2:basics",
	"pages": [
		{
			"type": "patchouli:text",
			"text": "Microblock components interact with each other through \\oPorts\\. on their surface.\\pThe different types of \\oPorts\\. are distinguishable by their texture:\\+\\rData\\d (red checkerboard)\\+\\yPower\\d (golden socket)\\+\\wItem\\d (white pipe hole)\\+\\cFluid\\d (blue pipe hole)\\+\\mBlock Interaction\\d (purple)\\+\\DSpecial\\d (black square)"
		}, {
			"type": "patchouli:text",
			"text": "Each \\oPort\\d also has a direction that is indicated by either blue or green markings around it.\\pFor \\rdata ports\\d, green means \\goutput signal\\d and blue means \\binput signal\\d.\\pFor the other types, green represents the \\g\"master\" side\\d that is in control of the interaction and blue represents the \\b\"slave\" side\\d that is only passively reacting."
		}, {
			"type": "patchouli:text",
			"text": "The most straightforward way of connecting ports is to place the components so that their faces are touching. The ports have to be of the same type and opposite direction.\\pIf direct connection is not feasible, they can be connected by routing a \\iCable\\d between the two ports instead. There are matching cable types for each port except for the \\D\"Special\"\\d type, which can only be connected directly."
		}, {
			"type": "patchouli:text",
			"anchor": "cable",
			"text": "Cables can only form paths with exactly two endpoints, meaning they can not branch. So if you want to connect a single data output with multiple data inputs or make a single slave port accessible to multiple masters, you need \\iSplitters\\d to do so.\\pJust like cables, there exists a splitter for every port type (again except \"Special\").\\pNote: Splitters can be chained only a \\c$(t:See their 'stats' tool-tip)limited number of times$(/t)\\d before they stop transmitting!"
		}, {
			"type": "patchouli:spotlight",
			"item": "rs_ctr2:not_gate",
			"title": "Ports in tool-tips",
			"text": "In item tool-tips, the ports of a component are referred to by colored arrows. The color represents the port type with blue and green for data inputs and outputs. The direction of the arrow tells where the port is when looking at the part's item model.\\nSo in the example item, \\g>\\d is right data output and \\b<\\d is left data input."
		}, {
			"type": "patchouli:relations",
			"entries": [
				"rs_ctr2:placement",
				"rs_ctr2:io",
				"rs_ctr2:signals"
			],
			"text": ""
		}
	]
}