{
  "hexcasting.entry.circus.particles": "Particles",
  "hexcasting.entry.circus.mind_control": "Mind Control",




  "hexcasting.spell.hex_circus:linear_particle": "Linear Particle",
  "hexcasting.spell.hex_circus:bezier_particle": "Bezier Particle",


  "hexcasting.spell.hex_circus:command_creature": "Command Creature",
  "hexcasting.spell.hex_circus:whittle_will": "Whittle Will",
  "hexcasting.spell.hex_circus:get_will": "Willingness Purification",





  "hex_circus.page.particles.opening.0": "I have figured out the secrets of showmanship by studying the magic used by the fabled Illusioner!$(br2)The following pages contain information on how to make ephemeral particles to really bring my spells to life!",

  "hex_circus.page.particles.linear.0": "Summons a singular particle that moves in a straight line from the first vector to the second, the particle takes on the color of the third vector in the form of something called \"RGB\" values between 0 to 1.",
  "hex_circus.page.particles.linear.1": "The number appears to control the speed at which the particle moves, although this is relative to the path length, a speed of 1 seems to make the particle finish its journey after about a second. Costs one 10 thousandth of an amethyst dust.",

  "hex_circus.page.particles.bezier.0": "Works the same as Linear Particle, but with an extra vector between the end point and the color",
  "hex_circus.page.particles.bezier.1": "This new vector seems to attract the particle during its journey, making the line in which it moves bend towards the third vector.$(br2)Costs one 2 thousandth of an amethyst dust.$(br2)$(br2)Side note: The particle never seems to actually reach the third vector",


  "hex_circus.page.mind_control.opening.0": "By studying the Evoker I believe I have discovered how they keep control over the Allay whose minds they have twisted into the devious Vex!Although I have not been able to fully recreate the permanent effects, I have devised my own, admittedly weaker version of this powerful ability.$(br)All creatures with a mind have something they want, something they $(italic)need.$(clear) This can be used to my advantage!",
  "hex_circus.page.mind_control.opening.1": "By manipulating the minds of lesser creatures and affecting what they want, I can practically make them do anything! $(br2)Although for now I'll have to stick to making them walk to a location of my choosing.$(br2)The following pages contain information on how to command the will of lesser beings, as well as whittling away at their will to resist my commands.",

  "hex_circus.page.mind_control.command_creature.0": "Commands the will of a lesser creature to move to the position at the top of the stack",
  "hex_circus.page.mind_control.command_creature.1": "An ungodly amount of media is wasted to gain control control as the creature tries to resist the command, this varies from species to species",

  "hex_circus.page.mind_control.whittle_will.0": "Whittles away at the will of the creature at the top of the stack, causing the cost of commanding it to halve.",
  "hex_circus.page.mind_control.whittle_will.1": "I should be careful with this, as a creature completely losing it's will to live results in cardiac arrest.$(br2)$(br2)Costs media equivalent to 64 charged amethyst",

  "hex_circus.page.mind_control.get_will": "Takes the creature at the top of the stack and replaces it with the amount of media in dust required to command it's mind, or null if commanding it is not possible.",




  "hexcasting.mishap.hex_circus.invalid_creature": "This creature does not appear to be of a valid species for this spell!",

  "hexcasting.mishap.hex_circus.influence_player.influencer": "You attempted to attack another player's mind... Didn't go so well, did it now?",
  "hexcasting.mishap.hex_circus.influence_player.influencee": "%s attempted to invade your mind! They have severely paid for their actions"

}