{
  "name": "Micromissiles",
  "icon": "pneumaticcraft:micromissiles",
  "category": "tools",
  "advancement": "pneumaticcraft:printed_circuit_board",
  "pages": [
    {
      "type": "text",
      "text": "$(item)Micromissiles/$ are small hand-launched missiles with an explosive payload and smart mob targeting. To fire a $(item)Micromissile/$, simply $(thing)right-click/$ the missile pod. Each pod has 100 missiles by default.$(p)Micromissiles seek targets within a 24-block spherical radius, centered on the missile. Once a suitable target is found, the missile will turn toward that target."
    },
    {
      "type": "entity",
      "entity": "pneumaticcraft:micromissile",
      "offset": "-0.3",
      "text": "$(italic)Small but lethal/$"
    },
    {
      "type": "text",
      "text": "$(item)Micromissiles/$ will never target the player who fired the missile or any entity (pets, drones...) belonging to that player. But beware of collateral damage from nearby explosions: not recommended for close quarters combat!$(p)$(item)Micromissiles/$ can target living entities, minecarts & boats, but will not target item entities or other non-living entities such as paintings."
    },
    {
      "type": "text",
      "text": "If a $(item)Micromissile/$ hits any entity or block, it will immediately explode. The explosion will not damage terrain $(ttcolor)$(t:See 'B:damageTerrain' in mod config)by default/$.$(p)$(item)Micromissiles/$ have a limited lifetime, which is 300 ticks (15 seconds) $(ttcolor)$(t:See 'I:missileLifetime' in mod config)by default/$. After that the missile will run out of fuel and drop from the sky, but it will still explode when it hits the ground."
    },
    {
      "type": "text",
      "text": "If you aim directly at a suitable entity when firing, the fired $(item)Micromissile/$ will immediately lock on to that entity, regardless of what else is nearer.$(p)If you $(thing)sneak+right-click/$ the missile pod, a GUI will open allowing configuration of several missile properties:$(li)The selection triangle allows you to balance between top speed, turn rate and explosion power."
    },
    {
      "type": "text",
      "text": "$(li)You can select between $(thing)Smart/$ and $(thing)Dumb/$ mode: in $(thing)Smart/$ mode, missiles will lock on to targets as described above, while in $(thing)Dumb/$ mode, missiles will simply fly in a straight line until they hit something, but with good speed and damage capability.$(li)You can filter which entities to attack by entering an $(l:base_concepts/entity_filter)entity filter/$ in the $(bold)Entity Filter/$ field."
    },
    {
      "type": "text",
      "text": "$(li)The $(bold)Save as Default/$ button causes the current settings to be saved and used for all newly-crafted missile pods. Note: settings are saved server-side."
    },
    {
      "type": "crafting",
      "recipe": "pneumaticcraft:micromissiles",
      "text": "Creating Micromissiles"
    }
  ]
}