{
  "this.is.a.comment.1": "Pattern names--------------------------------------------------------------------------------------------",
  "hexcasting.action.oneironaut:getdim1": "Spatial Reflection",
  "hexcasting.action.oneironaut:getdim2": "Spatial Reflection II",
  "hexcasting.action.oneironaut:getdim/overworld": "Homeland Reflection",
  "hexcasting.action.oneironaut:getdim/nether": "Inferno Reflection",
  "hexcasting.action.oneironaut:getdimheight": "Atlas' Decomposition",
  "hexcasting.action.oneironaut:getdimscale": "Ratio Purification",
  "hexcasting.action.oneironaut:dimteleport": "Noetic Gateway",
  "hexcasting.action.oneironaut:infusemedia": "Media Infusion",
  "hexcasting.action.oneironaut:swapspace": "Spatial Interchange",
  "hexcasting.action.oneironaut:craftrod": "Conduct Rod",
  "hexcasting.action.oneironaut:getrodlook": "Baton Reflection",
  "hexcasting.action.oneironaut:getrodpos": "Baton Reflection II",
  "hexcasting.action.oneironaut:getrodstamp": "Metronome Reflection",
  "hexcasting.action.oneironaut:delayrod": "Metronome Gambit",
  "hexcasting.action.oneironaut:haltrod": "Finale",
  "hexcasting.action.oneironaut:resetrod": "Encore",
  "hexcasting.action.oneironaut:readrodram": "Williams' Reflection",
  "hexcasting.action.oneironaut:writerodram": "Williams' Gambit",
  "hexcasting.action.oneironaut:readrodramremote": "Williams' Reflection II",
  "hexcasting.action.oneironaut:writerodramremote": "Williams' Gambit II",
  "hexcasting.action.oneironaut:queryrod": "Conductor's Reflection",
  "hexcasting.action.oneironaut:rodloopactive": "Conductor's Reflection II",
  "hexcasting.action.oneironaut:craftbottomlesstrinket": "Craft Bottomless Trinket",
  "hexcasting.action.oneironaut:writeidea": "Inscribe Idea",
  "hexcasting.action.oneironaut:readidea": "Retrieve Idea",
  "hexcasting.action.oneironaut:readideatime": "Metadata Purification",
  "hexcasting.action.oneironaut:readideawriter": "Metadata Distillation",
  "hexcasting.action.oneironaut:readsentinel": "Scrutinize Sentinel",
  "hexcasting.action.oneironaut:resistdetection": "Stealth Shroud",
  "hexcasting.action.oneironaut:detectshroud": "Discern Shroud",
  "hexcasting.action.oneironaut:circle": "Circle",
  "hexcasting.action.oneironaut:applymindrender": "Empower Mind Render",
  "hexcasting.action.oneironaut:reviveflayed": "Instill Psyche",
  "hexcasting.action.oneironaut:advanceautomaton": "Cellular Generation",
  "hexcasting.action.oneironaut:applynotmissing": "Uplifting Resonance",
  "hexcasting.action.oneironaut:getsoulprint": "Soulprint Reflection",
  "hexcasting.action.oneironaut:signitem": "Sign Item",
  "hexcasting.action.oneironaut:checksignature": "Signature Purification",

  "this.is.a.comment.2": "Block/Item names--------------------------------------------------------------------------------------------",
  "item.oneironaut.pseudoamethyst_shard": "Pseudoamethyst Shard",
  "item.oneironaut.shifting_pseudoamethyst": "Shifting Pseudoamethyst",
  "item.oneironaut.thought_slurry_bucket": "Thought Slurry Bucket",
  "item.oneironaut.reverberation_rod": "Reverberation Rod",
  "item.oneironaut.endless_phial": "Inexhaustible Phial",
  "item.oneironaut.bottomless_trinket": "Bottomless Trinket",
  "item.oneironaut.echo_staff": "Echo Staff",
  "item.oneironaut.beacon_staff": "Magitech Staff",
  "item.oneironaut.spoon_staff": "Spoon",
  "item.oneironaut.pigment_flame": "Flame Pigment",
  "item.oneironaut.pigment_echo": "Echo Pigment",
  "item.oneironaut.pigment_noosphere": "Noetic Pigment",
  "item.oneironaut.pigment_frenzyflame": "Frenzy Pigment",
  "item.oneironaut.memory_fragment": "Memory Fragment",
  "item.oneironaut.memory_fragment.all": "It seems I've consumed all the memories that this crystal can offer me...",
  "item.oneironaut.wisp_capture_device": "Wisp Wrangler",
  "item.oneironaut.mind_scalpel": "Synaptic Scalpel",
  "item.oneironaut.monkfruit": "Monkfruit",
  "item.oneironaut.rending_thorns": "Rending Thorns",

  "block.oneironaut.noosphere_gate": "Inscrutable Rift",
  "block.oneironaut.pseudoamethyst_block": "Pseudoamethyst Block",
  "block.oneironaut.pseudoamethyst_cluster": "Pseudoamethyst Cluster",
  "block.oneironaut.pseudoamethyst_bud_small": "Small Pseudoamethyst Bud",
  "block.oneironaut.pseudoamethyst_bud_medium": "Medium Pseudoamethyst Bud",
  "block.oneironaut.pseudoamethyst_bud_large": "Large Pseudoamethyst Bud",
  "block.oneironaut.thought_slurry": "Thought Slurry",
  "block.oneironaut.thought_slurry_flowing": "Flowing Thought Slurry",
  "block.oneironaut.noosphere_basalt": "Noosphere Basalt",
  "block.oneironaut.wisp_lantern": "Wisp Lantern",
  "block.oneironaut.wisp_lantern_tinted": "Tinted Wisp Lantern",
  "block.oneironaut.super_budding": "Budding Pseudoamethyst",
  "block.oneironaut.sentinel_sensor": "Sentinel Sensor",
  "block.oneironaut.raycast_blocker": "Anti-Raycast Slate",
  "block.oneironaut.raycast_blocker_glass": "Anti-Raycast Glass",
  "block.oneironaut.sentinel_trap": "Seer Impetus",
  "block.oneironaut.circle": "§0§oCircle",
  "block.oneironaut.hex_resistant_block": "Hex-Warded Obsidian",
  "block.oneironaut.media_ice": "Sagely Ice",
  "block.oneironaut.media_ice_frosted": "Transient Sagely Ice",
  "block.oneironaut.media_gel": "Plasmodial Psyche",
  "block.oneironaut.cell": "Dissonant Psyche",
  "block.oneironaut.wisp_battery": "Wisp Weaver",
  "block.oneironaut.decorative_wisp_battery": "Lesser Wisp Weaver",
  "block.oneironaut.hover_elevator": "Hexcaster's Hoverlift",
  "block.oneironaut.hover_repeater": "Hoverlift Repeater",
  "block.oneironaut.monkfruit_bush": "Monkfruit Bush",
  "block.oneironaut.spacebomb": "Slipcharge",

  "fluid.oneironaut.thought_slurry": "Thought Slurry",

  "this.is.a.comment.3": "Book entry titles--------------------------------------------------------------------------------------------",
  "oneironaut.entry.dim_iotas": "Dimension Iotas",
  "oneironaut.entry.status_iotas": "Status Iotas",
  "oneironaut.entry.noosphere_main": "A Strange Realm",
  "oneironaut.entry.noosphere_materials": "Thoughtful Materials",
  "oneironaut.entry.wisp_lanterns": "Wisp Devices",
  "oneironaut.entry.slipway_hint": "A Reflection on Slipways",
  "oneironaut.entry.miscpatterns": "Misc. Oneironaut Patterns",
  "oneironaut.entry.super_budding": "Better Media Farming",
  "oneironaut.entry.idea_inscription": "Idea Inscription",
  "oneironaut.entry.sentinel_detection": "Sentinel Detection",
  "oneironaut.entry.detection_shielding": "Nondetection",
  "oneironaut.entry.raycast_assailant": "Anti-Hex Blocks",
  "oneironaut.entry.mindrender": "Mind Render",
  "oneironaut.entry.soulprints": "Soulprints",
  "oneironaut.entry.hover_elevator": "Hoverlifts",
  "oneironaut.entry.flayrevival": "Artificial Minds",

  "this.is.a.comment.4": "Book pages--------------------------------------------------------------------------------------------",
  "oneironaut.page.spaceswap.1": "Accepts two lists of two vectors, to define two cuboids, and a Spatial Imprint. These cuboids must have the exact same dimensions and rotation.",
  "oneironaut.page.spaceswap.2": "I'm not quite sure what this one is supposed to do, it's always yelling at me about special dimensions. Perhaps it needs to use this special dimension as an intermediary?",
  "oneironaut.page.spaceswap.3": "Exchanges the blocks within the first cuboid in your current dimension (which must be within ambit) for the blocks within the second cuboid in the dimension corresponding to the Spatial Imprint. $(l:https://www.desmos.com/calculator/ydbg8zhmyp)Cost (in amethyst dust) is logarithmic for the first 1001 blocks, after which it increases linearly$(/l).$(br)Will not exchange any unbreakable blocks.$(br)One or both of the endpoint dimensions must be the noosphere.",
  "oneironaut.page.spaceswap.4": "One or both of the endpoint dimensions must be the noosphere.",
  "hexcasting.spell.oneironaut:dimteleport.samedim": "The spell does not do anything, similar to if I told someone to go home, when they were already at home.",
  "oneironaut.page.dim_iotas.1": "I've descovered a kind of iota which seems to represent a layer of reality itself. In lieu of better understanding, I've decided to call these Spatial Imprints.",
  "oneironaut.page.dim_iotas.2": "Returns a Spatial Imprint representing the dimension I am currently in. Costs a negligible amount of media.",
  "oneironaut.page.dim_iotas.3": "Returns a Spatial Imprint representing the dimension my sentinel is currently in. Costs one-tenth of an amethyst dust.",
  "oneironaut.page.dim_iotas.4": "Returns a Spatial Imprint representing the overworld. Costs one-tenth of an amethyst dust.",
  "oneironaut.page.dim_iotas.5": "Returns a Spatial Imprint representing the nether. Costs one-tenth of an amethyst dust.$(br)There seems to be some resistance when I cast this. Perhaps I'll be able to overcome it with $(#54398a)greater skill$()...",
  "oneironaut.page.dim_iotas.6": "Accepts a Spatial Imprint, and returns the lowest and highest altitudes at which blocks can exist in the corresponding dimension.",
  "oneironaut.page.dim_iotas.7": "Accepts a Spatial Imprint, and returns how many blocks you'd have to travel in the overworld to travel the equivalent of one block in the input dimension.",
  "oneironaut.page.dimteleport.1": "Accepts an entity and a Spatial Imprint and teleports the entity to its position in the proper dimension. Generally costs 20 Charged Amethyst.$(br)Will fail if supplied a player other than myself.",
  "oneironaut.page.dimteleport.2": "If I use this to return to a dimension that I previously left within the same instant, the cost drops to five amethyst dust, as the spell can take advantage of a lingering strand of media leading back to my original position. Otherwise, it will attempt to find a safe spot to deposit me, potentially conjuring a block to prevent me from falling to my doom.$(br2)Strangely, I feel an odd sense of acceleration when transporting myself this way, along some incomprehensible axis.",
  "oneironaut.page.infusemedia.1": "Accepts a vector and infuses media into the corresponding block in order to transmute it. Cost and exact effect vary depending on target.",
  "oneironaut.page.infusemedia.2": "Conceptually, this spell is quite similar to $(l:patterns/spells/blockworks#hexcasting:edify)Edify Sapling$(/l).$(br)However, the media that the target block receives is far more finely-tuned, and can thus achieve far more interesting results.",
  "oneironaut.page.wisp_lanterns.1": "I've found that by using materials unique to the Noosphere, I can create a special jar capable of producing and containing a tiny wisp. While this wisp cannot cast anything, it emits quite a bit of light, and will mimic pigments shown to it.$(br)I can also craft a version with tinted glass, in case the wisp's light would disrupt my study's aesthetic.",
  "oneironaut.page.wisp_lanterns.2": "Additionally, by feeding this illumination wisp significant amounts of media, I can cause it to undergo mitosis, with the newly-created wisp being seemingly-identical to the wandering wisps produced by slipways.$(br2)The device to split the wisp in this way can be fed media-bearing items via hoppers or similar, and is capable of storing 640 charged amethyst worth of media.",
  "oneironaut.page.wisp_lanterns.3": "Simply apply a redstone signal to activate. Produces a wisp every four seconds, and consumes two charged amethyst to do so.$(br)The capacity and fill level of the phial used make no difference.",
  "oneironaut.page.wisp_lanterns.4": "Alternatively, I can create a version which does not consume (or accept) any media, but produces wisps which yield only net-zero media when consumed.$(br2)All the sparkly shiny orbs, none of the prohibitive cost!",
  "oneironaut.page.wisp_lanterns.5.originaltoolong": "Using similar principles, I've designed a device which can capture (and contain) wisps for their eventual release, though it does not work on wandering wisps due to their instability.$(br)Capturing one of my own wisps always consumes one amethyst shard worth of its (rechargable) 64-charged capacity, and capturing someone else's costs half again as much media as it contains. To capture a wisp, I must simply use the item on a wisp, and it will be sucked into the housing(assuming it has sufficient media and does not already contain a wisp).",
  "oneironaut.page.wisp_lanterns.5": "Using similar principles, I've designed a device which captures, stores, and releases wisps, though it does not work on unstable wandering wisps. Capturing one of my own wisps consumes one amethyst shard from its battery. Capturing someone else's wisp costs half again the media it contains. To capture a wisp, I must simply use the device on it, assuming it has enough media and isn't already occupied.",
  "oneironaut.page.wisp_lanterns.6": "When releasing a cyclic wisp, it is placed on the side of the block I use the item on. Projectile wisps are launched from my face, retaining their previous speed (but not direction). To discard a contained wisp, I need only use the item while crouching.",
  "oneironaut.page.wisp_lanterns.7": "To initalize the device's media battery, I must use it on one of my own wisps, which will irretrievably consume it and set the battery's capacity to the wisp's stored media value, rounded up to the nearest dust. Should I wish to reset this (along with everything else about the device), I can simply place it in a crafting grid on its own.",

  "oneironaut.page.noosphere_materials.1": "A strange fluid which agitates media entering it, preventing amethyst crystal formation. Stimulates my mind in pleasing ways when I immerse myself in it.",
  "oneironaut.page.noosphere_materials.2": "A rock which is primarily composed of media, somehow. Can be used to craft spell circle blocks.",
  "oneironaut.page.noosphere_materials.3.title": "Pseudoamethyst",
  "oneironaut.page.noosphere_materials.3": "A large crystal of media much like amethyst, but not quite the same. Produces a buzzing sensation under my fingers when I touch it, as if its media is stimulating the nerves. Breaking it without special care causes it to shatter into 1-4 pieces.",
  "oneironaut.page.noosphere_materials.4": "The shards can be used to fuel spells, and yield slightly more energy than a normal amethyst shard. Can also be used to craft several interesting things.",
  "oneironaut.page.noosphere_materials.5": "A solid form of media which is created when Thought Slurry freezes in a media-rich environment, or is caused to freeze by a hex.$(br)Its surface seems to have negative friction, causing anything sliding on it to accelerate indefinitely (albeit slowly).",
  "oneironaut.page.noosphere_materials.6": "An extremely viscous mass of media, capable of very basic cognition, analagous to a slime mold. While it is normally quite lethargic, it uses a spell-like ability to attempt to ensnare anything that touches it.",
  "oneironaut.page.slipway_hint.1": "The slipways, they must lead $(o)somewhere$(). Wisps do not simply manifest from nothing. No matter what I try, I cannot insert so much as a finger through that chaotic rift.$(br2)I'm going about this wrong. Perhaps rather than attempting to force my way through, I should be attempting to calm the storm.",
  "oneironaut.page.slipway_hint.2": "A large amount of harmonious media may just do it...",
  "oneironaut.page.slipway_hint.2.title": "Hmm...",
  "oneironaut.page.noosphere_main.1": "I've made it.$(br)The realm beyond the slipways. The ambient media is overwhelming. My mind is screaming at me, telling me I shouldn't be here. But I must press on. This is the next step in the journey.",
  "oneironaut.page.noosphere_main.2": "Every single thing I've examined here seems to be composed largely of media, similar to conjured matter, but orders of magnitude denser.$(br)$(o)Even the air is media. How am I breathing?$(br2)$(l)How can I even exist here?",
  "oneironaut.page.rod.1": "I've discovered that I can craft a peculiar sort of casting item, using the strange shards found in ancient cities.$(br)This item is unusual in that it casts its imbued hex twenty times per second while I concentrate on it, until it either mishaps or I cast Finale or Encore. This initiates a cooldown period, usually about one second.",
  "oneironaut.page.rod.2": "The echo shards seem to bear some bizarre form of media, with a tendency to loop back on itself while retaining a bit of the previous cast.",
  "oneironaut.page.rod.3": "Acts just like $(l:patterns/spells/hexcasting)the spells used to program conventional casting items$(). Costs 10 Charged Amethyst.",
  "oneironaut.page.rod.4": "When cast with a Reverberation Rod, returns my look vector from when I started the current cast loop.",
  "oneironaut.page.rod.5": "When cast with a Reverberation Rod, returns my eye position from when I started the current cast loop.",
  "oneironaut.page.rod.6": "When cast with a Reverberation Rod, returns the timestamp from when I started the current cast loop.",
  "oneironaut.page.rod.7": "Accepts a positive integer. When cast with a Reverberation Rod, delays the current cast loop's next cast until that many twentieths of a second have passed.",
  "oneironaut.page.rod.8": "When cast with a Reverberation Rod, forcibly halts the current cast loop.",
  "oneironaut.page.rod.9": "Accepts a positive integer. Halts the current cast loop but also reduces the cooldown period from 1 second to ((1/20) * number) seconds. Cooldown due to mishap is unaffected.",
  "oneironaut.page.rod.10": "Accepts a non-list iota, and stores it inside the current cast loop. It will be lost when the cast loop ends.",
  "oneironaut.page.rod.11": "Returns the iota stored in the current cast loop. Defaults to NULL.",
  "oneironaut.page.rod.12": "Returns a boolean corresponding to whether the current cast is making use of a rod.",
  "oneironaut.page.rod.13": "As Williams' Gambit, but can be cast from non-rod sources while a rod is in use.",
  "oneironaut.page.rod.14": "As Williams' Reflection, but can be cast from non-rod sources while a rod is in use.",
  "oneironaut.page.rod.15": "Returns whether the caster is currently using a rod, regardless of the current cast is from that rod.",
  "oneironaut.page.rod.16": "Echo shards can also be used in the construction of a staff, though it seems the only special property of such a staff is making sculk sounds.",
  "oneironaut.page.miscpatterns.1": "I've found a couple patterns designed to interact with item frames. Nothing fancy, but they're nice utility for things like controlling my spell circles.$(br2)Additionally, it seems Sorter's Purification works on them just fine, so my attempts to find a dedicated frame-item pattern were pointless.",
  "oneironaut.page.miscpatterns.2": "Accepts an item frame entity, and returns its rotation, from 0 to 7.",
  "oneironaut.page.miscpatterns.3": "Accepts an item frame entity and an integer from 0 to 7, and sets its rotation to the number. Costs a negligible amount of media.",
  "oneironaut.page.miscpatterns.4": "As $(l:patterns/basics#hexcasting:raycast/entity)Scout's Distillation$(/l), but also accepts a list of entity type iotas. Any entity whose type is not present in the list will be ignored. Costs an amount of media slightly less negligible than that of the aforementioned pattern.",
  "oneironaut.page.miscpatterns.5": "Returns a random number between 0 and 1, with a gaussian distribution.",
  "oneironaut.page.miscpatterns.1.formerlink": "$(l:hexal:patterns/types#hexal:type/block_item)",
  "oneironaut.page.super_budding.1": "I've found that the amethyst-like material native to the noosphere can be imbued with a villager's mind, much like normal amethyst. What's more, the block that results from this process produces significantly more media than normal Budding Amethyst, and it can be picked up and moved if one takes special care.",
  "oneironaut.page.super_budding.2": "Pseudoamethyst requires a stronger mind than normal amethyst, but the cost is well worth it.",
  "oneironaut.page.super_budding.3": "Additionally, when cultivated in the Noosphere, budding pseudoamethyst will produce pseudoamethyst clusters rather than conventional amethyst. These clusters will of course yield pseudoamethyst shards, as well as an unstable form of pseudoamethyst containing about four times as much media as the regular shards. Unfortunately, due to this instability, it cannot be directly converted into usable media. However, it can be converted into many other forms of media crystal by simply bringing the two items together.",
  "oneironaut.page.super_budding.4": "It seems to react to my gaze, as if endowed with some form of perception.",
  "oneironaut.page.super_budding.5": "The media generation rate of budding pseudoamethyst is such that even when immersed in thought slurry to inhibit crystal formation, it will still yield usable amounts of media. While the overall supply is nigh-endless, the amount accessible to any given action is quite small, like an inch-deep ocean a million miles across. However, due to this minimal depth, the media will dissipate rapidly before reaching my staff when accessed from afar, such as when recharging an item.",
  "oneironaut.page.super_budding.6": "Constantly provides about a tenth of an amethyst dust worth of media. While I certainly $(o)can$() hold several of these in order to gain access to more easy media, this results in rapidly-diminishing returns.",
  "oneironaut.page.super_budding.7": "I can also jam one into a trinket in order to replace its media supply with an inexhaustible phial, giving it access to the endless media within. However, it cannot use any media other than that provided by the phial.",
  "oneironaut.page.super_budding.8": "Writes a hex to the bottomless trinket in my other hand. Costs ten charged amethyst.",
  "oneironaut.page.idea_inscription.1": "As the noosphere is a realm of thought, it stands to reason that it could be used for information storage. These patterns do just that, inscribing an iota into the noosphere and reading it back (regardless of my current dimension). They can also store iotas inside the minds of other beings, assuming their thoughts are as... $(o)unfettered$() as my own. In the notation for these patterns, \"key\" refers to any vector or compatible entity.",
  "oneironaut.page.idea_inscription.2": "While this is quite versatile, the noosphere's ambient media is constantly in motion, and as such any iota stored in it will eventually be lost, similar to if I poured hot water into the ocean. It seems to take about an hour before such information decays into unusable garbage.$(br2)It seems that $(l:greatwork/akashiclib)Akashic Libraries$(/l) work based on similar principles, where the shelves serve as insulation to prevent decay.",
  "oneironaut.page.idea_inscription.3": "Accepts a valid key and any iota, and stores it in the corresponding location. Costs a quarter of an amethyst dust.",
  "oneironaut.page.idea_inscription.4": "Accepts a valid key, and returns the corresponding iota. Costs one-eigth of an amethyst dust.",
  "oneironaut.page.idea_inscription.5": "Accepts a valid key, and returns when the corresponding iota was inscribed, or -1. Costs no media.",
  "oneironaut.page.idea_inscription.6": "Accepts a valid key and a player, and returns whether the corresponding iota was inscribed by that player. Costs no media.",
  "oneironaut.page.sentinel_detection.1": "By combining the noosphere's pseudoamethyst with the organic sensory apparatus native to the deep dark, I've discovered a way to detect fluctuations in ambient media. This new form of sensor detects the presence of $(l:patterns/spells/sentinels)Sentinels$(/l) within approximately 16 meters, and outputs a redstone signal based on its proximity to the closest one. Comparators attached to it will output a signal if the sentinel in question is particularly powerful.",
  "oneironaut.page.sentinel_detection.2": "$(o)I'm sure the warden won't mind.$()",
  "oneironaut.page.sentinel_detection.3": "Additionally, this sensor can be incorporated into a Cleric Impetus, allowing it to activate when a sentinel is placed in the area (albeit with a lower range than the plain sensor). I've dubbed this contraption a Seer Impetus. Though it no longer responds to redstone, the circle's hex will start with a reference to the owner of the triggering sentinel on the stack.$(br)Due to the media interference produced by the cast, the impetus cannot detect sentinels it places itself.",
  "oneironaut.page.sentinel_detection.4": "As the sensor does not care whose sentinel it sees, I should take care to avoid allowing my trap circles to target me.",
  "oneironaut.page.sentinel_detection.5": "Accepts a vector and a player, and returns either the distance from the vector to the target player's sentinel or NULL. Costs a negligible amount of media.",
  "oneironaut.page.sentinel_detection.6": "Conjures a fleeting sensor at the target coordinates, which \"listens\" to the patterns in the ambient media to seek out the telltale signature of a sentinel.",
  "oneironaut.page.detection_shielding.1": "While conventional invisibility potions work just fine for fooling human senses, they are useless against hexes, so I've yet to find any method of making oneself completely undetectable. However, this spell I've discovered allows me to get closer to that goal, scattering media around a creature like chaff, in order to interfere with hex-based detection methods.",
  "oneironaut.page.detection_shielding.2": "Accepts a living entity and a number ($(o)n$()), and shields the entity from hex-based detection for $(o)n$() seconds. Costs two amethyst dust per second.",
  "oneironaut.page.detection_shielding.3": "Also drains media from the entity at a rate of 1/10 of a dust per second, as the shielding effect collects it to produce the chaff.$(br2)I should be careful with what I apply this to, as creatures with no loose media of their own will have their very minds fractured in order to provide this media.",
  "oneironaut.page.detection_shielding.4": "While this is very effective at blocking effects such as $(l:patterns/basics#hexcasting:raycast/entity)Scout's Distillation$(/l) and the various forms of $(l:patterns/entities#hexcasting:zone_entity/animal)Zone Distillation$(/l), it has no effect on $(l:patterns/entities#hexcasting:get_entity)Entity Purification$(/l) variants, as those already have a fairly precise idea of where you are. What's more, the chaff itself produces an energy signautre, which, while dim, is detectable by a specialized pattern.",
  "oneironaut.page.detection_shielding.5": "Accepts a vector and a number, and returns a list of unit vectors pointing from the initial vector to shrouded entities within a radius defined by the number.",
  "oneironaut.page.detection_shielding.6": "I've also discovered a spell which applies normal Invisibility. Functions just like the normal $(l:patterns/great_spells/zeniths)Zeniths$(/l), and costs one amethyst dust per three seconds.",
  "oneironaut.page.raycast_assailant.1": "By \"threading\" pseudoamethyst through a block, I can create something which causes any raycast (including entity raycasts) that hits or passes through it to return null, as if it didn't hit anything.",
  "oneironaut.page.raycast_assailant.3": "Strangely, combining pseudoamethyst with obsidian in the same way does not confer anti-raycast properties, instead making it nigh-indestructible to hexes. However, the resultant block loses much of its durability, being no stronger than common stone (though it retains its blast resistance).",
  "oneironaut.page.mindrender.1": "I've read legends of a particularly macabre form of weapon known as a Mind Render. This weapon, sometimes used by ancient hexcasters, is capable of severing a creature's very thoughts, dealing damage that bypasses all known forms of protection. What's more, if this damage leaves the target just on the brink of true death, it will fall into a vegetative state, never to recover. I shudder to think of what the ancients may have used this property for...",
  "oneironaut.page.mindrender.2": "Accepts an item or item frame bearing the Sharpness enchantment, and converts it into Mind Render of the same level. Cost is based on enchantment level, and increases by 50%% if the item is a book.",
  "oneironaut.page.lore.treatise1.1": "While it is possible to produce most iotas on the fly, there are cases where one finds it impractical, or simply cannot (such as very large and precise numbers, or entity references), and as such must obtain the desired iota in another way. Reading it from a Focus or a similar item works just fine, but in many cases this would require a third hand, which I do not have. Other methods of fetching iotas from external locations have their own limitations as well.",
  "oneironaut.page.lore.treatise1.2": "In cases where no external reference method would work well, one must insert the desired iota into the hex itself. This may seem counterintuive to some, what with the conventional wisdom being that a hex is a list of patterns, but one must remember that patterns are just another type of iota, which $(l:patterns/meta#hexcasting:eval)Hermes' Gambit$(/l) (and similar patterns) works particularly well with.",
  "oneironaut.page.lore.treatise1.3": "While you can't just shove a number into the list and expect it to be pushed to the stack as if it was a $(l:patterns/numbers)Numerical Reflection$(/l) pattern, there are ways around this.$(br2)The simplest (and least reliable) is the $(l:patterns/patterns_as_iotas#hexcasting:escape)Consideration$(/l) pattern. Similar to its use when casting freehand, anything that comes immediately after it in a list will be escaped and pushed to the stack when it might otherwise be executed, preventing mishaps due to execution of non-patterns.",
  "oneironaut.page.lore.treatise1.4": "However, when you're more than one exeuction deep in a hex (such as with nested conditional logic, or loops), the number of Considerations required to properly escape an iota increases exponentially, making it unreliable when used in anything that could conceivably be executed by another hex.",
  "oneironaut.page.lore.treatise1.4.link": "relevant xkcd",
  "oneironaut.page.lore.treatise1.5": "A far more reliable method of escaping iotas is to use $(l:patterns/patterns_as_iotas#hexcasting:open_paren)Introspection$(/l) and $(l:patterns/patterns_as_iotas#hexcasting:close_paren)Retrospection$(/l). When a pattern list is being evaluated and an Introspection is encountered, everything up to (but not including) its paired Retrospection is escaped and pushed to the stack in a list, regardless of iota type. You can then work with this list as you see fit, such as using $(l:patterns/lists#hexcasting:splat)Flock's Disintegration$(/l) to push all of its contents to the stack on their own.",
  "oneironaut.page.lore.treatise1.6": "If the contents of your list looks like this:$(br2)Introspection$(br)Any iota(s)$(br)Retrospection$(br)Flock's Disintegration$(br2)the state of the stack after all that is executed will simply be all the iotas that were contained within Introspection and Retrospection.",
  "oneironaut.page.lore.treatise2.1": "When one wishes to impart motion upon something, the standard method is to use $(l:patterns/spells/basic#hexcasting:add_motion)Impulse$(/l). However, this can get prohibitively expensive when one wishes to make something move extremely quickly, as the cost increases exponentially with the length of the vector. This can be mitigated by simply using a magnitude-1 Impulse many times over on a single target, turning the overall cost from n^2 to 2n-1, where n is the magnitude of the vector.",
  "oneironaut.page.lore.treatise2.2": "The easiest way to accomplish this is with $(l:patterns/meta#hexcasting:for_each)Thoth's Gambit$(/l), by giving it a list containing many instances of the same entity reference. There are other (and often better) methods, of course, but aside from simply drawing the patterns over and over, they generally fall under the broader topic of loops, which is outside the scope of this document.",
  "oneironaut.page.lore.treatise3.1": "While $(l:patterns/meta#hexcasting:for_each)Thoth's Gambit$(/l) is perfectly-suited for casting something on many targets at once, using to it cast something on one target many times can get awkward, and short of completely halting the hex, it is not possible to add or remove targets once Thoth has begun executing.$(br)To get around these limitations, one simply needs to use a different sort of loop.",
  "oneironaut.page.lore.treatise3.2.header": "While Loop",
  "oneironaut.page.lore.treatise3.2": "A While loop is a loop that continues executing until some condition is fulfilled, such as an entity's target velocity having been reached. The most common way to accomplish this is creating a pattern list which duplicates and executes the top iota on the stack, duplicating it, then executing it. On its own this simply produces an infinite loop which does nothing but mishap.",
  "oneironaut.page.lore.treatise3.3": "However, by adding actual functionality and a bit of boolean logic, you can create a proper while loop. The code for the aforementioned infinite loop is as follows:$(br)Introspection$(br)Gemini Decomposition$(br)Hermes' Gambit$(br)Retrospection$(br)Gemini Decomposition$(br)Hermes' Gambit$(br2)By adding logic that changes whether the inner Hermes' Gambit gets evaluated based on a condition, you can make it stop once that condition is fulfilled.",
  "oneironaut.page.lore.treatise3.4.header": "Loop Unrolling",
  "oneironaut.page.lore.treatise3.4": "A more complex form of loop is an unrolled loop. Like Thoth's Gambit, it's created with a fixed number of iterations which can't easily be added to, but Charon's Gambit can be used to halt it early if need be. It also has the advantage that when done competently, it only ever produces one or two levels of recursion depth (not counting anything executed in the body of the loop). Loop unrolling is accomplished by creating a pattern list you want to repeat, duplicating it many times, and then combining all those lists into one.",
  "oneironaut.page.lore.treatise3.5": "The simplest way to accomplish this is to use $(l:patterns/stackmanip#hexcasting:duplicate)Gemini Decomposition$(/l) and then $(l:patterns/lists#hexcasting:concat)Combination Distillation$(/l), resulting in a doubled pattern list. This method can be repeated to achieve greater powers of 2, and only produces a single level of recursion depth, when the list is executed. A more flexible method is to use $(l:patterns/stackmanip#hexcasting:duplicate_n)Gemini Gambit$(/l) to produce $(o)n$() copies of the list, then gathering $(o)n-1$() instances of the pattern for Combination Distillation into one list and executing it, thus merging all the copies of your original list into one.",
  "oneironaut.page.lore.treatise4.1": "Some of my, erm, \"colleagues\" have trouble transcribing long hexes.$(br)\"This is too long!\"$(br)\"The grid doesn't have enough space!\"$(br)$(bold)Skill issue$(), I say. It's not like a hex is immutable once you've drawn the last Retrospection. All you need to do is save the work-in-progress hex to a focus (though you should make sure to conserve enough grid space to actually do this).",
  "oneironaut.page.lore.treatise4.2": "Then you just use the $(l:patterns/lists)list manipulation$(/l) patterns to combine it with the other parts once you're done.$(br2)You don't even need to use multiple foci, you can just append one part to the last one as you finish them, and then save that to one focus. The multiple-focus method makes it easier to debug your finished hex, but as far as I know that's its only benefit compared to the one-focus method.",
  "oneironaut.page.lore.science1.1": "$(o)\"What is this and how do I get rid of it?\"$()$(br)A question asked by many people upon their first encounter with a slipway. I don't have a good answer for the second part of the question, but I believe I can provide a satisfactory response to the first.$(br)From what I can tell, a slipway is a tiny hole in space, the other side of which is the media realm known as the Noosphere.",
  "oneironaut.page.lore.science1.2": "The wisp-like phenomena that emerge from it are formed when the vast ambient media of the Noosphere attempts to rush through the hole (much like gas leaking into a near-vacuum) and gets tangled in a manner similar to how wisp-summoning spells weave the media which they consume.",
  "oneironaut.page.lore.science1.3": "Additionally, it seems that slipways have a sort of barrier over the entrance, preventing any matter from passing through. If this barrier could be pierced, and the hole expanded, the slipway would become capable of absorbing matter into the noosphere. It would also cease producing wisps, as the media coming through would do so far more slowly, and thus not be agitated and tangled. If one were to attempt this, they would have to be careful not to widen it too greatly, or they would risk the surrounding area being absorbed into the noosphere.",

  "not.real.translation.key.1": "TODO: Add a structure that is implied to be part of a laboratory that has been ripped from the overworld by an engorged gateway",

  "oneironaut.page.lore.science2.1": "What a strange place. The liquid that comprises the ocean here is not much denser than water, but small islands float in it despite being comprised of a rock similar in density to ordinary basalt. What's more, everything seems strangely ephemeral, like a dream. But how could this be a dream, when I am more lucid than I've ever been before?",
  "oneironaut.page.lore.science2.2": "It seems this great lucidity is a product of the ambient media present here, lubricating my thoughts. These media levels even exceed those present at the cores of wisps, reducing their innate decay to infinitesimal levels. Interestingly, this has no effect on wisps which bear an imprint of someone else's soul, preventing me from using wisps as indefinite truename storage.$(br)This ambient media even leaks through sufficiently-large dimensional rifts, preserving wisps on the other side as long as they remain within a certain range of the rift.",
  "oneironaut.page.lore.science3.1": "This crystal is quite fascinating. An object formed from pure media, orders of magnitude denser than conventional conjured blocks, or even the condensed media crystals that some of my colleagues at the library have been studying. It doesn't even contain the trace amounts of silicon dioxide found in amethyst of similar media density. And when I leave it unattended for a while, dust collects in fractalline patterns, as if the crystal bears a passive spell-like effect.",
  "oneironaut.page.lore.science3.2": "Examining it more thoroughly under a microscope, it seems that these fractals extend beneath the surface of the crystal, and are constantly shifting in a consistent pattern. Could this be a time crystal?",
  "oneironaut.page.glow_ambit.1": "Despite diligent research, the source of the special properties of other hexcasters' entity references has eluded me. However, I've discovered a way to bestow one such property upon other beings, at least temporarily (and flashily).$(br)This spell allows casters to affect creatures from great distances just like the infinite-range aspect of a player reference. However, one must still be close to the target in order to perform the initial application.",
  "oneironaut.page.glow_ambit.2": "Accepts a living entity, and allows it to be accessed from anywhere for one minute. Has a base cost of one amethyst shard, plus one additional shard per application before allowing it to expire.",
  "oneironaut.page.glow_ambit.3": "It seems that this effect functions by causing the target to emit some sort of psionic resonance, strong enough to cause its outline to be \"visible\" through all manner of barriers (perhaps hexcasters naturally produce this same resonance, but much subtler?). However, this glow is distinct from that induced by spectral arrows and similar, so don't bet on things to detect that working for this.",
  "oneironaut.page.soulprints.1": "A soulprint is an iota similar to my player reference in that it represents me, but significantly more limited in use. It is impossible for anyone to obtain my soulprint without my involvement, though it is not subject to the same write-restrictions as ordinary player references.$(br2)Interestingly, soulprints are valid keys for $(l:oneironaut:patterns/idea_inscription)Idea Inscription$(/l).",
  "oneironaut.page.soulprints.2": "Returns my soulprint, mishapping if cast using anything other than a staff. Costs a negligible amount of media.",
  "oneironaut.page.soulprints.3": "Invisibly engraves my soulprint onto the item in my other hand, or erases it if it is already there. Costs 1 amethyst dust.$(br)I should be careful to seal any focuses or similar that I sign, as acquiring an unsealed signed focus may allow someone to impersonate me, and Erase Item gets rid of the signature.",
  "oneironaut.page.soulprints.4": "Accepts a soulprint, and checks if the item in my other hand is engraved with it. Returns true if so, false otherwise. Costs a negligible amount of media.",
  "oneironaut.page.hover_elevator.1": "By combining materials native to the noosphere with certain ingredients associated with levitation, I can create a device which produces streams of propulsive energy capable of carrying me along them, with minimal risk of falling. To use it, it must be placed facing directly towards another one (which must be facing it in turn). Once I've done this, both ends must be activated with a",
  "oneironaut.page.hover_elevator.2": "redstone signal, and the energy stream will form between the paired emitters, assuming they are within range of each other (64 meters horizontally, or 128 vertically). By stepping into the stream, I will be held in place until I look towards either end of the stream, at which point I will be accelerated in that direction until I hit a maximum speed proportional to how closely my vision parallels the stream. Crouching causes the stream to hold me in place regardless of my gaze.",
  "oneironaut.page.hover_elevator.3": "$(o)Best to don some long fall boots the first time I try these.",
  "oneironaut.page.hover_elevator.meme":"$(o)Bad and naughty hexcasters get sent to the hover cube.",
  "oneironaut.page.hover_elevator.4": "Additionally, I can create a repeater capable of extending the range of the emitters when placed between them, such that the stream can continue on as if it had just left the emitter. Of course, such an extension requires more powerful components, and even then the stream can only be extended by three repeaters before it becomes too unstable to form.",
  "oneironaut.page.hover_elevator.5": "Fortunately, this device seems to be rather immaterial for some reason, and I can pass straight through it without having to carefully twist around it in the stream.$(br)$(o)No, it does not make the stream pause for a moment before continuing.",
  "oneironaut.page.flayrevival.1": "I've long been frustrated with the uselessness of the empty husk you get after flaying a villager (or nearly killing something using $(l:oneironaut:items/mindrender)Mind Render$(/l)). While there $(o)are$() a few tasks for which they can conduct themselves adequately, these are largely things which even simple beasts would be suitable for. Fortunately, I've discovered a spell capable of bestowing some measure of cognition upon these husks.",
  "oneironaut.page.flayrevival.2": "Accepts a flayed mob, and creates an artifical pseudo-mind to inhabit its body. Costs 16 charged amethyst when used on a villager or allay, or 10 amethyst shards for anything else.",
  "oneironaut.page.flayrevival.3": "While these pseudo-minds are capable of moving their bodies around as if they were their original inhabitants, they are too simple to be called truly sapient, even with the rather loose definition of the term that must be used when applying it to villagers. As such, any villager \"restored\" in this manner loses any professional experience it had before, and cannot gain such experience ever again.",
  "oneironaut.page.flayrevival.4": "They do, however, regain their ability to reproduce, with any children they produce being untainted by my craft.$(br2)I'm not sure why the restored villagers suddenly gain an affinity for green clothing, but at least it serves as a good indicator of which villagers will be of little further use.",
  "oneironaut.page.monkfruit.1": "I've discovered that using the $(l:patterns/spells/blockworks#hexcasting:edify)Edify Sapling$(/l) spell on a Sweet Berry Bush produces a rather interesting plant. It is much like the shrub it mutates from, however its thorns are imbued with a media field which siphons the minds of pricked creatures into the plant in order to grow. It can grow without this (albeit slowly), though it still requires minds nearby to provide small amounts of media.",
  "oneironaut.page.monkfruit.2": "The fruit that this bush produces is quite sweet, and can be processed into sugar. Additionally, it releases bits of media during digestion, which seek out rechargeable items on my person. I should be wary of the thorns while picking the fruit.",
  "oneironaut.page.monkfruit.3": "Twigs sheared off of the mature bush remain dangerous, and can be used to craft a rather ominous blade.$(br2)This blade acts much like a sword enchanted with low-level $(l:oneironaut:items/mindrender)Mind Render$(/l), though it is far more precise, able to rend minds while causing minimal collateral damage to the flesh. I can of course use it more like a conventional blade if I like, but this does risk killing the target outright.",
  "oneironaut.page.monkfruit.4": "$(o)It's not rocket science.$()",

  "this.is.a.comment.5": "Advancements--------------------------------------------------------------------------------------------",
  "oneironaut.advancements.noosphere.enter": "A Realm of Thought and Dream",
  "oneironaut.advancements.noosphere.enter.description": "Enter the Noosphere",
  "oneironaut.advancements.noosphere.find_tower": "A Timeless Classic",
  "oneironaut.advancements.noosphere.find_tower.description": "Discover the tower of an unknown hexcaster",
  "oneironaut.advancements.noosphere.find_media_lab": "Crystallized",
  "oneironaut.advancements.noosphere.find_media_lab.description": "Discover a grim experiment",
  "oneironaut.advancements.noosphere.find_garden": "Stranded",
  "oneironaut.advancements.noosphere.find_garden.description": "Discover an unfortunate soul's last reminder of home",
  "oneironaut.advancements.lore.root": "Oneironaut Lore",
  "oneironaut.advancements.lore.root.description": "Memories lost to time",
  "oneironaut.advancements.lore.treatise1": "Hexcaster's Memory #1",
  "oneironaut.advancements.lore.treatise1.description": "Reflections on iota embedding",
  "oneironaut.advancements.lore.treatise2": "Hexcaster's Memory #2",
  "oneironaut.advancements.lore.treatise2.description": "Reflections on efficient use of Impulse",
  "oneironaut.advancements.lore.treatise3": "Hexcaster's Memory #3",
  "oneironaut.advancements.lore.treatise3.description": "Reflections on repeated patterns",
  "oneironaut.advancements.lore.treatise4": "Hexcaster's Memory #4",
  "oneironaut.advancements.lore.treatise4.description": "Reflections on long hexes",
  "oneironaut.advancements.lore.science1": "Scientist's Memory #1",
  "oneironaut.advancements.lore.science1.description": "Research into the nature of slipways",
  "oneironaut.advancements.lore.science2": "Scientist's Memory #2",
  "oneironaut.advancements.lore.science2.description": "Research into the properties of the Noosphere",
  "oneironaut.advancements.lore.science3": "Scientist's Memory #3",
  "oneironaut.advancements.lore.science3.description": "Research into the structure of pseudoamethyst",
  "oneironaut.advancements.unflay": "Recycling!",
  "oneironaut.advancements.unflay.description": "Surely you weren't going to just throw that away!",
  "oneironaut.advancements.ouchie": "Ouch!",
  "oneironaut.advancements.ouchie.description": "What did you expect?",

  "this.is.a.comment.6": "Mishaps--------------------------------------------------------------------------------------------",
  "hexcasting.mishap.oneironaut:badcuboid.mismatch": "Supplied cuboids are dissimilar.",
  "hexcasting.mishap.oneironaut:badcuboid.toobig": "Supplied cuboids are too big.",
  "hexcasting.mishap.oneironaut:uninfusable": "Expected an infusable block at %s, but got %s.",
  "hexcasting.mishap.oneironaut:nonoosphere": "Expected one end of the transfer to be a special dimension.",
  "hexcasting.mishap.oneironaut:norod": "Expected to be cast from a Reverberation Rod.",
  "hexcasting.mishap.oneironaut:norodremote": "Expected an active Reverberation Rod in hand.",
  "hexcasting.mishap.oneironaut:missingenchant": "Expected %s to be enchanted with %s, but it is not.",
  "hexcasting.mishap.oneironaut:unhappyslime": "The slime says \"%s\"",
  "hexcasting.mishap.oneironaut:norequirediota": "The slime demands %s",
  "hexcasting.mishap.oneironaut:requiresdifferententities": "an entity different from the target",
  "hexcasting.mishap.oneironaut:nostaff": "%s expected to be cast using a staff.",
  "oneironaut.mishap.noitemframe": "an item frame",
  "oneironaut.mishap.invalidideakey": "a vector, player, or soulprint",
  "oneironaut.mishap.unenlightenedtarget": "an enlightened player",
  "oneironaut.mishap.notbrainswept": "a flayed villager",
  "oneironaut.mishap.badentitykey": "an enlightened player or a flayed villager",
  "oneironaut.mishap.nolistsallowed": "a non-list iota",
  "oneironaut.mishap.entitytypelistplease": "a list of entity types",
  "oneironaut.mishap.wrongsizelist": "List is improperly sized.",
  "oneironaut.mishap.twovectorsplease": "List does not contain two vectors.",
  "oneironaut.mishap.requiresflayedmob": "%s expected a flayed mob, but got %s.",
  "hexcasting.mishap.invalid_value.class.oneironaut:imprint": "a spatial imprint",
  "hexcasting.mishap.invalid_value.class.oneironaut:soulprint": "a soulprint",

  "this.is.a.comment.7": "Other---------------------------------------------------------------------------------------------",
  "hexcasting.iota.oneironaut:dim": "Dimension",
  "hexcasting.iota.oneironaut:uuid": "Soulprint",
  "hexcasting.iota.oneironaut:uuid.label": "Soulprint of %s",
  "biome.oneironaut.noosphere_sea": "Noosphere Sea",
  "text.oneironaut.clearIdeasResponse": "Cleared iota storage map.",
  "effect.oneironaut.detection_resistance": "Media Shroud",
  "effect.oneironaut.not_missing": "Uplifting Resonance",
  "effect.oneironaut.rumination": "Rumination",
  "enchantment.oneironaut.overcast_damage": "Mind Render",
  "itemGroup.oneironaut.oneironaut": "Oneironaut",
  "oneironaut.tooltip.wispcapturedevice.haswisp": "Contains a wisp with %s dust and hex signature %s.",
  "oneironaut.tooltip.wispcapturedevice.nowisp": "No wisp.",
  "oneironaut.tooltip.wispcapturedevice.uninitialized": "Media reservoir has not been initialized.",
  "text.oneironaut.lorem_ipsum": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.",
  "oneironaut.tooltip.lich_media_amount": "Reservoir contains: %s/%s (%s)"
}
