{
  "name": "Brazier",
  "category": "devices",
  "icon": "bewitchment:brazier",
  "pages": [
	{
	  "type": "text",
	  "text": "A Brazier is a special vessel designed to hold reagents that are to be burned. Depending on the reagents burned, the Brazier will cast effects from giving passive boosts, to casting thick fogs, and even to summon creatures of the beyond, as burning items is one surefire way to help it cross the veil into the spirit world and to communicate with said spirits."
	},
	{
	  "type": "crafting",
	  "recipe": "bewitchment:brazier",
	  "text": "Braziers can also burn Incense, which when ignited will give those in the area special effects. Some more sinister folk have spoken of their ability to cast curses upon targets using a Brazier as well…"
	},
	{
	  "type": "text",
	  "title": "Incense",
	  "text": "When a certain amount of reagents are burned in a Brazier along with Dragon’s Blood Resin acting as a catalyst, Incense are created. When burned, it will cast a fog in the area that can provide certain passive effects to users should they fall asleep in the smoke, along with warding off darker creatures who touch its smoke."
	},
	{
	  "type": "text",
	  "text": "However due to the ethereal nature of this smoke, the effects from an Incense simply cannot be as strong as the effects from a Sigil or Brew, unless...."
	},
	{
	  "type": "bewitchment:incense_recipe",
	  "recipe": "bewitchment:vitality",
	  "text": "Reinforces the flesh and blood of the user, allowing them to deal more damage as well as take less damage."
	},
	{
	  "type": "bewitchment:incense_recipe",
	  "recipe": "bewitchment:deftness",
	  "text": "Enhances the speed and agility of the user."
	},
	{
	  "type": "bewitchment:incense_recipe",
	  "recipe": "bewitchment:invigorating",
	  "text": "Causes the user to be more durable overall, and lets them break blocks faster."
	},
	{
	  "type": "bewitchment:incense_recipe",
	  "recipe": "bewitchment:cats_eye",
	  "text": "Stimulates the eyes of the user, allowing them to see in the dark just as a cat would."
	},
	{
	  "type": "bewitchment:incense_recipe",
	  "recipe": "bewitchment:fullness",
	  "text": "Makes the user less hungry, and allows them to take more hits."
	},
	{
	  "type": "bewitchment:incense_recipe",
	  "recipe": "bewitchment:intensity",
	  "text": "When burned in a separate brazier alongside a brazier containing a different incense, it increases the potency of its effects. Not compatible with Concentration."
	},
	{
	  "type": "bewitchment:incense_recipe",
	  "recipe": "bewitchment:concentration",
	  "text": "Thickens and concentrates the smoke from a nearby brazier, allowing its effects to linger on much longer. Not compatible with Intensity."
	}
  ]
}
