{
    "name": "Letter from a Druid",
    "icon": "minecraft:paper",
    "category": "basics",
    "advancement": "roots:root",
    "priority": true,
    "sortnum": 2,
    "pages": [
      {
        "type": "text",
        "title": "To my fellow druid,",
        "text": "It can often times be difficult to start out in the world. The process of living in harmony with nature may seem like a pleasant ideal when things are going well, but when the sun sets and darkness rules the land, respecting nature may become a difficult task.$(br2)Use the tools at your disposal well, but use them responsibly. Respect nature's creatures at every turn!"
      },
      {
        "type": "crafting",
        "recipe": "roots:assorted_seeds",
        "text": "Temptation may come upon you when faced with hunger or even starvation, but even at the worst of times you may find comfort and sustenance from a handful of seeds gently toasted."
      },
      {
        "type": "text",
        "title": "Wildroot",
        "text": "I have learnt much on the matter of $(l:herbs/wildroot)wildroot$(), that wondrous, magic-filled root that litters the land and lurks in the tall grasses.$(br2)It was once the roots of vast trees known as wildwood, now forever lost from the land. It still retains vitality & life however.$(br2)As with many plants, it can be cultivated in soil as you would any other crop."
      },
      {
        "type": "crafting",
        "recipe": "mysticalworld:stuffed_aubergine",
        "title": "Aubergine",
        "text": "The humble $(l:resources/aubergine)aubergine$() can be delicious cooked & combined with other root vegetables becomes.$(br2)Its latent magic is weak, but you will find uses for it in spells & rituals. Like wildroot, it can be cultivated."
      },
      {
        "type": "text",
        "title": "Terra Moss",
        "text": "The $(l:herbs/terra_moss)strange spores$() which may be found in tall grass grow best when placed on rough stone near water. When scraped away carefully with a knife, it is clear that magic suffuses them.$(br2)However, fear not that you will spend your days breaking grass in search of spores, for there is a ritual, that of $(l:rituals/ritual_overgrowth)Overgrowth$(), which will magically grow this moss on suitable stone."
      },
      {
        "type": "text",
        "title": "Other Crops",
        "text": "Fear not sacrificing the space around you for the cultivation of other crops, such as wheat or carrots. These will give you sustenance, and, you may find others like you in the world willing to trade their currency for your goods.$(br2)A well-kept garden will forever be a boon to you, and you might eventually find $(l:apparatus/runestone)a means to keep away trampling animals & monsters$()."
      },
      {
        "type": "text",
        "title": "Other Druids",
        "text": "Indeed, within these encampments you may find like-minded druids more progressed in the arts, who may be willing to trade essential items and resources in return for this currency.$(br2)This may give you a needed boost in resources, or perhaps, if discovered early enough, unlock new ideas and concepts. Some of them may even be willing to trade away their most valuable items!"
      },
      {
        "type": "text",
        "title": "Rarer Resources",
        "text": "My research into the various spells & rituals has found that some require rare resources, be they from tropical climes, the wettest swamps or from the driest deserts.$(br2)Being older, I was unable to make such a journey, but have heard tell of a $(l:rituals/ritual_transmutation)ritual that harnesses runestones to turn mundane things into others$().$(br2)However, none of the texts available to me detailed it."
      },
      {
        "type": "text",
        "text": "As I have mentioned my advancing years, the passage of time begins to feel like a closing loop that will end my current cycle on the land.$(br2)There have been times when I have had not had time to wait for crop to ripen, and at a lack of the common fertilizer which all herbs seem to respond to.$(br2)In these times of need, I found the $(l:spells/spell_growth_infusion)Spell of Growth Infusion$() useful, though tedious by nature."
      },
      {
        "type": "text",
        "text": "Other texts speak of greater spells & rituals to grow entire fields & forests, and others yet to harvest them, but these are beyond my meagre skills. Perhaps you will succeed where I could not.$(br2)$(br2)Some final words: never despair! If you find yourself at a loss, and my words unable to help, ensure every avenue of research has been exhausted.$(br2)Often frustrations are eased by unlocking a new herb."
      },
      {
        "type": "text",
        "text": "Fare the well, my friend! Although I will not live to see it, I know that even in your darkest moments there will be such sources of light and understanding that I cannot even comprehend them.$(br2)$(br2)- $(o)the name is too faded to read$()"
      },
      {
        "type": "empty"
      }
    ]
  }