{
  "name": "Introduction",
  "icon": "minecraft:paper",
  "category": "survive",
  "priority": true,
  "pages": [
    {
      "type": "text",
      "text": "When one finds oneself lost, or unable to find one's way, it can be difficult to keep a cool head - $(italic)a phrase which here means to stay calm in a difficult situation$() - and in some difficult situations, it may not only be difficult to stay calm, it may also be difficult to survive."
    },
    {
      "type": "text",
      "text": "Should you find yourself in a difficult situation, the Pyrotechnic Esoterica contains many techniques and ideas that - through the act of starting fires rather than putting them out - will serve to dramatically increase the likelihood of your survival.$(p)For example, $(info) while looking at a Pyrotech inventory, $(sneak) to display item quantities; $(sneak) + scroll to insert or extract small amounts of items."
    },
    {
      "type": "text",
      "text": "Another technique that will serve to dramatically increase the likelihood of your survival is the technique used to build a $(item)Campfire$().$(p)A $(item)Campfire$() is an indispensable component to wilderness survival and, as such, the knowledge required to construct a $(item)Campfire$() is a cornerstone in each new volunteer's wilderness survival library."
    },
    {
      "type": "text",
      "text": "When huddled together in the dead of night $(italic)- a phrase which here means a time in the middle part of the night, when it is darkest and coldest -$() a $(item)Campfire$() can be used to heighten anticipation and dread while recreationally engaging in scintillating yet predictable tales of horror and misfortune.$(br)  However, for a person in your predicament, heightening anticipation and dread for recreational enjoyment is probably not a priority."
    },
    {
      "type": "text",
      "text": "For a person in your predicament, a person engaged in the horror and misfortune of wilderness survival in a very non-recreational, non-scintillating, and unpredictable way, $(info) a $(item)Campfire$() is most useful for cooking food and creating light$() - light that will act as a comfort against the anticipation and dread that is inevitably heightened in the middle part of the night, when it is darkest and coldest."
    },
    {
      "type": "text",
      "text": "This guide, also being an indispensable component to wilderness survival and a cornerstone in each new volunteer's wilderness survival library, naturally contains the necessary knowledge required to construct and make use of just such a $(item)Campfire$()."
    },
    {
      "type": "relations",
      "entries": [
        "survive/campfire"
      ]
    }
  ]
}