{
  "wiki.ic2.category.armors": "Armors",
  "wiki.ic2.category.batteries": "Batteries",
  "wiki.ic2.category.block_misc": "Misc",
  "wiki.ic2.category.blocks": "Blocks",
  "wiki.ic2.category.brewing": "Brewing",
  "wiki.ic2.category.cables": "Cables",
  "wiki.ic2.category.cfoam": "Construction Foam",
  "wiki.ic2.category.credits": "Credits",
  "wiki.ic2.category.crops": "Crops",
  "wiki.ic2.category.early_game": "Early Game",
  "wiki.ic2.category.electric_blocks": "Electric Blocks",
  "wiki.ic2.category.electric_tools": "Electric Tools",
  "wiki.ic2.category.electricity": "Electricity",
  "wiki.ic2.category.essentials": "Essentials",
  "wiki.ic2.category.explosives": "Explosives",
  "wiki.ic2.category.first_day": "First Day",
  "wiki.ic2.category.fluid_blocks": "Fluid Blocks",
  "wiki.ic2.category.fluids": "Fluids",
  "wiki.ic2.category.fourth_tier": "Fourth Tier",
  "wiki.ic2.category.general": "General",
  "wiki.ic2.category.generators": "Generators",
  "wiki.ic2.category.gui": "Gui Knowledge",
  "wiki.ic2.category.item_energy": "Portable Energy",
  "wiki.ic2.category.item_misc": "Misc",
  "wiki.ic2.category.items": "Items",
  "wiki.ic2.category.logistic": "Logistic Transport",
  "wiki.ic2.category.machines": "Machines",
  "wiki.ic2.category.misc": "Misc",
  "wiki.ic2.category.misc_tutorials": "Misc",
  "wiki.ic2.category.monitor_cards": "Monitor Cards",
  "wiki.ic2.category.personal_blocks": "Personal Blocks",
  "wiki.ic2.category.progression": "Progression",
  "wiki.ic2.category.reactor": "Reactor Components",
  "wiki.ic2.category.reactors": "Reactors",
  "wiki.ic2.category.scanners": "Scanners",
  "wiki.ic2.category.second_tier": "Second Tier",
  "wiki.ic2.category.third_tier": "Third Tier",
  "wiki.ic2.category.tools": "Tools",
  "wiki.ic2.category.tubes": "Tubes",
  "wiki.ic2.category.tutorials": "Tutorials\n§l§4Beginner Instructions!§r",
  "wiki.ic2.category.upgrades": "Upgrades",
  "wiki.ic2.category.villager": "Villagers!",
  "wiki.ic2.category.wrenches": "Wrenches",
  "wiki.ic2.page.blocks.cables": "Cables",
  "wiki.ic2.page.blocks.cables.desc": "Cables are your only way of short/long distance transporting of electricity.\n\nThey have different limits on how much they can transport at once and how much loss they can have.\nJust make sure to insulate them otherwise they may or may not shock you...§<newPage>§<header;Tutorial;true>\nPlease make sure you checked out the §<redirect;true;Electricity Tutorial;ic2:subpage.electricity> \nso you know how it works!",
  "wiki.ic2.page.blocks.cfoam": "Construction Foam",
  "wiki.ic2.page.blocks.cfoam.desc": "CFoam or Construction Foam is your entry-drug into its magic.\n\nIt is highly suggested you be careful around here!\nNot many come back once they have entered this place...§<newPage>§<header;What is it?;true>\nConstruction foam is a Block that can be used for:\n- §lDecoration§r \n- §lTexture§r §lCopying§r using a §<redirect;true;Obscurator;ic2:preview.obscurator> \n- §lHiding§r §rBlocks§r like Tubes/Cables/Pipes\n- §lCreating§r §<redirect;true;Reinforced Stone;ic2:preview.reinforced_stone>§<newPage>§<header;How to use it?;true>\nBy default you craft §<redirect;true;Wet Cfoam;ic2:preview.wet_cfoam> and place it down. \nIt will either dry by itself if it is bright enough or can be dried using Sand/Concrete powder if you are not willing to wait.\nUsing concrete will automatically dye it. Though this can be also done after the fact using a §<redirect;true;Painter;ic2:preview.painter>§<newPage>§<header;Sprayed CFoam;true>\nIf you compress it into CFoam Pellets, you get a 13x multiplier on your CFoam and then it can be put into a §<redirect;true;CFSprayer;ic2:preview.foam_sprayer>.\nThe basic variant will spray in a burst in the direction you are looking into. \nA §<redirect;true;Electric CFoam Sprayer;ic2:preview.electric_sprayer> can be used to control the amount being sprayed.\nThough this requires a Canning Machine to fill it. §<newPage>§<header;Obscuration;true>\nOnce Cfoam has dried, it can be Obscurated using a §<redirect;true;Obscurator;ic2:preview.obscurator>.\nThe Obscurator itself can copy textures meaning you can use it to apply \"almost\" any texture on to CFoam as you wish.\n\nWant a house of Diamond Blocks but don't want to waste the diamonds?\nPlace a block down, obscurate it and place loads of CFoam around!\nWant to troll your friends that RF works with a IC2?\nCopy a RF Mods Block and paste it on to a IC2 Cable and put a cable next to it!\nBelieve me they will freak out. (Tested multiple times)§<newPage>§<header;End Notes;true>\nNote that Obscuration works only the following CFoam Types:\n- Full Blocks\n- Slabs\n- Stairs\n- Walls\n\nWhy? Because the process on making them compatible is really difficult.\nEspecially with the feature set in them.",
  "wiki.ic2.page.blocks.electric_blocks": "Electric Blocks",
  "wiki.ic2.page.blocks.electric_blocks.desc": "Electric blocks are your tools to make your electric grid more stable and complex.\n\nElectric Storages, Transformers, Chargers, Stations, Lights everything you could desire.\n\nOfc there are multiple tiers to these tools too.",
  "wiki.ic2.page.blocks.explosives": "Explosives",
  "wiki.ic2.page.blocks.explosives.desc": "Explosives are a part of the industrialzation.\n\nSo IC2 Classic adds a couple blocks regarding that.\nOn top of that IC2C nerfs a couple blocks explosion resistance to make the destruction less containable.\nThis does not change vanilla in any form since the resistance was only reduced to make stronger explosions actually stronger.\n\nTo give an example: 6 Obsidian was strong enough to contain 1 Nuke without any damage.\nNow you need a lot more then that.\nObsidian was nerfed from a strength of 1200 down to 60. (Vanilla does 4)",
  "wiki.ic2.page.blocks.fluid_blocks": "Fluid Blocks",
  "wiki.ic2.page.blocks.fluid_blocks.desc": "IC2 Classic has a lot of blocks that use or work with fluids.\n\nSo a dedicated Fluid Transport System is a must.\nIntroducing the Fluid Pipe System.\n\nWhich most active Fluid Producers automatically support.§<newPage>§<header;Pipes;true>\nFor all else Pipes have a GUI where they can be set to extract fluids themselves.\nPipes also have \"Priority System\" which is based on: Lower Number => Higher Priority.\nSaid GUI can be accessed if a Tank is present and no item is in your hand.§<newPage>§<header;Realism;true>\nPipes have drag when pushing fluids through them.\nDepending on the strength of the source you can only go so far.\nGoing horizontal consumes 1 Strength, going down costs nothing and going up consumes 2.\nAlso the network tries equal distribution and only if there is fluid left over it will do lower priority things.",
  "wiki.ic2.page.blocks.generator": "Generators",
  "wiki.ic2.page.blocks.generator.category": "The following tiers of generators available to you based on how far you have progressed\n\n- §<redirect;true;LV Generators;ic2:blocks.generators.lv> \n- §<redirect;true;MV Generators;ic2:blocks.generators.mv> \n- §<redirect;true;HV Generators;ic2:blocks.generators.hv> \n- §<redirect;true;Compact Generators;ic2:blocks.generators.compact> ",
  "wiki.ic2.page.blocks.generator.compact": "Compact Generators",
  "wiki.ic2.page.blocks.generator.compact.desc": "Compact Generators are a weird concept created out of a specific need\nto reduce lag in the world, since Tile Entities are not really optimized.\n\nNowadays that is no longer really required since these generators are hyper optimized,\nbut they are still a thing for saving space and for the joke of it.\n\nTo make this less OP you are paying extra resources to achieve the compression.",
  "wiki.ic2.page.blocks.generator.desc": "You need power?\nWe have power!\nThe following lists IC2C's power generation solutions for all your needs,\nranging from Low Voltage (LV) to High Voltage (HV).\nThe format for energy is 'EU/t', or Electrical Units per Tick. If you haven't checked out the Tutorials, you should do so.\nEU is explained in depth there.",
  "wiki.ic2.page.blocks.generator.hv": "High Voltage Generators",
  "wiki.ic2.page.blocks.generator.hv.desc": "High Voltage Generators are your end game Power Producers.\n\nThese are upgraded forms of existing power sources that make them so much better\n\nto compensate for the elevated power requirements that will come at you at this point.\nOn top of that these generator's are not easy to automate.\n\nThey are either unsafe or have special requirements, like a constant cost.",
  "wiki.ic2.page.blocks.generator.lv": "Low Voltage Generators",
  "wiki.ic2.page.blocks.generator.lv.desc": "Low Voltage Generators are your early game access to Power.\n\nThese solutions are either little passive power producers or resource consuming power production.\n\nThis should get you started until you get into later game energy production.",
  "wiki.ic2.page.blocks.generator.mv": "Medium Voltage Generators",
  "wiki.ic2.page.blocks.generator.mv.desc": "Medium Voltage Generators are the step to solid Power Production.\n\nThese generators use their fuel much more efficiently and/or require more expensive fuel to run.\n\nThese should ramp up power production massively",
  "wiki.ic2.page.blocks.machines": "Machines",
  "wiki.ic2.page.blocks.machines.category": "The following machine tiers are available to you based on how you have progressed into the game.\n\n- §<redirect;true;NV Machines;ic2:blocks.machines.nv> \n- §<redirect;true;LV Machines;ic2:blocks.machines.lv> \n- §<redirect;true;MV Machines;ic2:blocks.machines.mv> \n- §<redirect;true;HV Machines;ic2:blocks.machines.hv> \n- §<redirect;true;EV Machines;ic2:blocks.machines.ev> \n- §<redirect;true;LuV Machines;ic2:blocks.machines.luv> \n- §<redirect;true;Industrial Worktable;ic2:blocks.machines.worktable> ",
  "wiki.ic2.page.blocks.machines.desc": "IC2Classic is a mod about industrialization. That means machinery. Many of the blocks in IC2C are machines.\n\nMachines are divided into currently six tiers based on the amount of EU/t they consume and, more importantly, can safely accept.\nNV Machines(No-Voltage) do not require electrical energy, but need a supply of furnace fuels like coal or wood.",
  "wiki.ic2.page.blocks.machines.ev": "Extreme Voltage Machines",
  "wiki.ic2.page.blocks.machines.ev.desc": "Extreme Voltage Machines are your way into the end game.\n\nIt provides you access into the last tier of tools and machines which require a lot of power.\n\nSome may argue it is not worth it. BUT everyone knows brute force is the best force!\n\nThis tier accepts up to Extreme Voltage (2048EU) and provides the last upgrade set of general purpose machines.\nWhich are Colossal Machines.\n\nColossal Machines are dynamic Multi-Blocks that process multiple items at once but for a lot more space and power,\nyet are more efficient then their counterparts.",
  "wiki.ic2.page.blocks.machines.hv": "High Voltage Machines",
  "wiki.ic2.page.blocks.machines.hv.desc": "High Voltage Machines are your step to scratch the endgame.\n\nMachines become more advanced and more power hungry.\n\nIf your power infrastructure at this point is already barely sufficient to keep up with the consumption, \nthen now is the time to build up more infrastructure.\nMost machines accept at this point High Voltage (512EU) and a lower chance to drop from a normal wrench.\n\nThough that is a small price to pay as advanced tools become accessible.",
  "wiki.ic2.page.blocks.machines.luv": "Ludicrous Voltage Machines",
  "wiki.ic2.page.blocks.machines.luv.desc": "Ludicrous Voltage Machines are the end of the game.\n\nThere isn't more to unlock then this progression tier!\nThese machines accept Ludicrous Voltage (32765 EU).\n\nThe wrench drop rate is 55%. Just enough for a precision wrench to guarantee a drop!",
  "wiki.ic2.page.blocks.machines.lv": "Low Voltage Machines",
  "wiki.ic2.page.blocks.machines.lv.desc": "Low Voltage Machines are the early stage into electric processing of resources.\n\nThese Machines accept up to 32 EU.\nIf the Machine is removed without a wrench it is always lost.\n\nBy default there is a 80% not to lose the machine with a wrench.\nThis may vary depending on the wrench itself.\n\nAlmost every LV Machine accepts Upgrades.",
  "wiki.ic2.page.blocks.machines.mv": "Medium Voltage Machines",
  "wiki.ic2.page.blocks.machines.mv.desc": "Medium Voltage Machines are the start into the midgame of the IC2C.\n\nIt throws a lot of new useful tools and machines at you that you can now play with.\n\nA lot these Machines accept up Medium Voltage (128EU) and generally run faster then the LV counterparts.\nAt the cost of less upgradeability and of course a slightly more expensive resource/energy cost,\nor having to actively power machines in idle mode.\n\nIdle Mode is a passive cost that consumes 1EU/t and requires a redstone signal to maintain the full speed.",
  "wiki.ic2.page.blocks.machines.nv": "Primitive Machines",
  "wiki.ic2.page.blocks.machines.nv.desc": "Primitive Machines, which don't use electricity, are machines that are very early accessible to you in the game.\n\nThey use burnable fuels, such as wood and coal, to power the machines.\n\nThough terribly fuel inefficient, they provide a lot of buffs and can be used on the fly very easily.",
  "wiki.ic2.page.blocks.machines.worktable": "Industrial Worktable",
  "wiki.ic2.page.blocks.machines.worktable.desc": "The Industrial Worktable is an insanely powerful crafting tool.\n\nIn fact it is so powerful that it requires its own section.\n\nWhich covers the Industrial Workbench itself and all the expansions.§<newPage>Note that all expansions require the Industrial Worktable to function.\nAnd as long as they touch the worktable directly/indirectly they will be detected.\n\nAlso expansions can be shared across multiple Worktables.",
  "wiki.ic2.page.blocks.misc": "Miscellaneous Blocks",
  "wiki.ic2.page.blocks.misc.desc": "These are Blocks that do not fit into any real category or are in decorative Nature",
  "wiki.ic2.page.blocks.personal_blocks": "Personal Blocks!",
  "wiki.ic2.page.blocks.personal_blocks.desc": "Sometimes you want to keep items safe from other people grabbing them;\n\nPersonal Blocks are Personal!\nOnly you decide who can access/destroy them.\n\nThey also work with Trade Blocks.\nThese allow users to trade for Items/Fluids/Blocks if so desired.§<newPage>§<header;Special Trade O Mat Key;true>\nOne small side info.\nIf you press the §<key;key.ic2.inv> while opening Trade-o-Mats you can view the \"buyers View\" and test things.",
  "wiki.ic2.page.blocks.tubes": "Tubes",
  "wiki.ic2.page.blocks.tubes.desc": "Tubes are one of the ways you can automate item transportation.\n\nThese tubes are very basic and can't do a lot.\nBut all the basic components to make a complex system are present.\n\nSo how do they work? Items simply flow through them and go into random directions, but not the direction they came from.\nIf there are too many items in a tube, the tube will simply not process them to ensure your game doesn't lag out.\n\nThere are Logistic Tubes that aid you with automating more complex problems, but they DO NOT automate Routing.\n\nYes, no automatic routing but fear not the Tube System has all you need to achieve automatic routing by yourself.\nJust make sure that you don't fry your brain.\n\nI wasn't joking.\n\nAlso for some extra functionality a Tube Configurator was added to give more control over things.",
  "wiki.ic2.page.credits.head": "Credits",
  "wiki.ic2.page.crops": "Crops",
  "wiki.ic2.page.crops.boni": "Crop Environment Effects",
  "wiki.ic2.page.crops.boni.desc": "Now the stats you know and what they do but what about the buffs of the environment?\nThese are the following: Nutrients, Humidity, Environment Quality.\n\nNutrients and Humidity can be affected by the blocks below it.\nThe block directly below it is the \"Farmland\",\nWhile the 3 blocks after the farmland is the \"SubSoil\".\nIn general terms the subsoil has a lesser effect per block as the Farmland.§<newPage>§lNutrients:§r\nSome biomes may have a effect on these which can be found out with a bit of common sense.\nIt can be buffed using fertilizer.§<newPage>§lHumidity:§r\nSome biomes may have a effect on these which can be found out with a bit of common sense.\nThis stat can be buffed using Hydration Cells.\nFor waterlogged crops this stat is automatically maxed out. And is in most cases not really a factor.§<newPage>§lEnvironment Quality Waterlogged:§r\n\nWhen the Crop is Waterlogged the biome gives a base value on the water quality based on its traits.\nFor each bubble column or clay in a 3x3 grid you get 1 point.\nFor each Cleaning Crop (Sea Weed/Kelp) in a 3x3 grid you also get 1 point.\nFor every block that isn't Water/Wet Sponge or Air you lose 1 point.\nThis ranges from 0-10 points of Environment Quality quality.§<newPage>§lEnvironment Quality not Waterlogged:§r\n\nFor every 15 Blocks above y-64 you get 1 point (caps at 5)\nIf the crop can see the sky you get 2 points.\nAnd for every air/non solid block that isn't a crop in a 3x3 you get half a point.\nThis ranges from 0-10 points of Environment Quality quality.",
  "wiki.ic2.page.crops.breeding": "Crop Breeding",
  "wiki.ic2.page.crops.breeding.desc": "Now how does cross breeding work?\n\nCrossbreeding is the only real random part inside of IC2C\nbut this is not a truly random way for everyone who just screamed in fear right now.\n\nTo Crossbreed a set of crop you surround a empty crop stick with a set of crops.\nUp to 4 can be used.\nThen you place on to the empty crop another set of crop sticks.\nThe crop then connects to all directly touching crops and attempts to crossbreed.\n\nNow that process might take some time. So you are suggested to bulk crossbreed.\n\nFor every growth tick, the crossbreeding crop requests the desire to crossbreed to the other crops\nand the crops somewhat randomly either agree or disagree to do so. This can be helped or made worse with crop stats.\nBy default it is roughly a 20% chance. This may differ on diffulty settings.\n\nOnce 2 or more crops agree to crossbreed a new crop will be spawned in the result spot.\nYou have 0 indicators which/how many are used; you have only 2 sticks.\n\nThe result is calculated based on a semi-random chance.\n\nFirst it evaluates all potential crops that can grow there (excluding weeds) and calculates a point value for each crop.\nThis is calculated in multiple steps.\n\nIf the Crop from the breeding crop matches the one from the list it gains 500 Points. No further Calculations.\nElse it will start to compare the Crops.\n\nThe first thing it compares are the stats (Chemistry, Consumable, Defensive, Colorful, Weed) of the crops: If the compared stat is equal, you get 2 points, if there is a 1 point difference in stat you get 1 point, a 2 point stat difference ignores it and any bigger difference gives -1 points\nAfter that is done it compares the attributes of the 2 crops. For each matching attribute of the 2 crops, it gains 5 points.\n\nThen it compares the tiers of the crops:\nIf the tier of the breeding crop is smaller then 1 point to the possible crop you lose 2 times of the tier difference in points.\nAlso if the Breeding Crop is bigger then 3 tiers then the possible crop loses the tier difference in points.\nAt the end it makes sure you do not get below 0 points for a crop and it adds it then to the points for that crop.\n\nAfter the evaluation is done, it combines all potential points together and grabs a random number between 0 and all combined crop points.\nThen it goes through every single valid result and checks if the points are bigger then the random selected value.\nIf it is, then that's your result.\nIf it's not, then it consumes the points of that specific result and checks the next crop. Repeat etc.",
  "wiki.ic2.page.crops.desc": "IC2C adds very unique crop system to the game.\nSome love it, some hate it. It's up to you to decide.\n\nIf someone remembers the Forestry mod, then you might not know that its bee breeding mechanic was inspired by it.§<newPage>§<header;Crops;true>\nCrops provide a lot of different resources and consistence.\nYou can grow:\n- Wood\n- Ores\n- Food\n- Dyes\n- SQUIDS!\n\nPlease make sure to check out the §<redirect;true;Tutorial;ic2:subpage.crop>§<newPage>§<header;Planting;true>\nSome of the crops can be directly planted, while others have to be breed.\nThough if you pick a crop you get a seed bag to replant it. Though that isn't always guaranteed.\nFully grown plants have the best chance to drop a seedbag.\n\nThis Wiki shows you if a crop is plantable by item or via breeding.§<newPage>",
  "wiki.ic2.page.crops.helper": "Crop Breeding Helper",
  "wiki.ic2.page.crops.helper.desc": "Now that this info dump is over. I hope your head is not smoking yet.\n\nNow you could manually calculate this yourself and hope your calculations are accurate.\nBut luckly you don't have to.\n\nThe Crop Analyzer has a Crop Breeding Mode that can simulate the entire thing and show you each chance for each combination as desired.\nIt does not show you the perfect matches but it allows you to toy around and find out what are the best results for your current situation.\n\nYou are not required to own any crop to test with it. It comes with a creative stock of all crops. \nNo you cant get these crops out of its inventory.\n\nAnd this covers the Crop Section.",
  "wiki.ic2.page.crops.stats": "Crop Stats",
  "wiki.ic2.page.crops.stats.desc": "So crops have stats which have upsides and downsides.\nThe range of each stat is between 0-31.\n\nWhile higher stats may result in a serious boost there are downsides too and these get massive at 24 or higher.§<newPage>§lGrowth:§r\nIncreases growth by a flat rate and increases the chance of crossbreeding.\nAt 24 or higher it turns the crop into a weed causing it to destroy nearby non-resistant crops.§<newPage>§lGain:§r\nIncreases extra drop chances by 10% (3% automated) and that drops might double with a very low chance. \nAt 24 each extra point reduces the seed drop chance by 5% (multiplicative).§<newPage>§lResistance:§r\nIncreases the chance of a seed drop and decreases the chance of a crop dying due to requirements or weeds trying to spread on to it.\nAt level 28 or higher it massively reduces the chance of crossbreeding.",
  "wiki.ic2.page.fluids": "Fluids",
  "wiki.ic2.page.fluids.alcohol": "Alcohol",
  "wiki.ic2.page.fluids.alcohol.desc": "Alcohol is your high tier but non-automateable fluid.\n\nIt produces a ton of power or can be used to can be used to maximize your the output of your ore to ingot production.\n\nIt only can only be produced through Brewing in a barrel.",
  "wiki.ic2.page.fluids.biofuel": "Biofuel",
  "wiki.ic2.page.fluids.biofuel.desc": "Biofuel is a refined form of plant matter or Woodgas.\n\nIn a decent amount of time it produces a ton of power that can be used in the mid/endgame to keep your base afloat.\n\nIf you have the production to support it.",
  "wiki.ic2.page.fluids.blazing_lava": "Blazing Lava",
  "wiki.ic2.page.fluids.blazing_lava.desc": "This, hotter than ever, fluid is produced in the Refinery and is 10x more efficient than lava in Geothermal generators/Thermal Generators. 1 unit of blazing lava counts as 10 units of regular lava and it only needs some macerated blaze rods",
  "wiki.ic2.page.fluids.desc": "IC2 Classic also provides a couple fluids that are used for a couple things.\n\nMainly for power production or some utility production.",
  "wiki.ic2.page.fluids.steam": "Steam",
  "wiki.ic2.page.fluids.steam.desc": "Steam can be produced in many ways like in the §<redirect;true;Fuel Boiler;ic2:preview.fuel_boiler> or §<redirect;true;Steam Reactor;ic2:preview.steam_reactor> but at the end of the day, it is primarily used for mid to high tier power production in generators like the §<redirect;true;Steam Tunnel;ic2:preview.steam_tunnel> or §<redirect;true;Steam Turbine;ic2:preview.steam_turbine>",
  "wiki.ic2.page.fluids.wood_gas": "Woodgas",
  "wiki.ic2.page.fluids.wood_gas.desc": "Woodgas is a byproduct in the creation of charcoal and can be produced in the §<redirect;true;Wood Gasificator;ic2:preview.wood_gassifier>.\n\nIt is a great early game power producer, but can later be refined into a more powerful fluid",
  "wiki.ic2.page.items.armors": "Armors",
  "wiki.ic2.page.items.armors.desc": "IC2Classic adds a couple types of Armor to the game.\n\nThere are some early game, Electric, Utility and more types of armors.\n\nUtility armors include ways to charge your electric tools or jetpacks.§<newPage>§<header;Armors;true>\nAlso Electric armors are modular in this version and can be configured using the Armor Configurator.",
  "wiki.ic2.page.items.batteries": "Batteries",
  "wiki.ic2.page.items.batteries.desc": "Batteries are your portable energy source that you can use in a lot of cases.\n\nEither by recharging other items or temporarily running machines with them.\n\nIt can be also used as a burst power source that deals with a lot of power consumption in a short time\nthat your energy grid is not capable of handling.",
  "wiki.ic2.page.items.electric_tools": "Electric Tools",
  "wiki.ic2.page.items.electric_tools.desc": "IC2C provides a new type of tool to the game:\n\nthe Electric Tool. It has a couple ups and downs but overall it's a big improvement.§<newPage>§<header;Electric Tools;true>\n- Uses electricity as durability.\n- They can not break.\n- They can be recharged from a multitude of sources.\n- They can only be enchanted with the Electric Enchanter.\n- They have this sick durability color.\n\nThere are a lot of useful tools in this category too that you might find appealing.\nSo lets go!",
  "wiki.ic2.page.items.info.cards": "Monitor Cards",
  "wiki.ic2.page.items.info.cards.desc": "IC2Classic adds a Monitor to the Game.\n\nThis monitor can display a lot of information on itself.\n\nThese cards provide the information to the monitor.",
  "wiki.ic2.page.items.misc": "Miscellaneous Items",
  "wiki.ic2.page.items.misc.desc": "These are items that do not fit into any real category.",
  "wiki.ic2.page.items.reactor.components": "Reactor Components",
  "wiki.ic2.page.items.reactor.components.desc": "Reactor components are the essential part of any Reactor.\n\nThese are essentially the logic of the reactor.\nThere are multiple types of components\n\nsuch as Fuel-Rods, Heat-Vents, Coolant Cells, Condensators, etc.",
  "wiki.ic2.page.items.scanners": "Scanners",
  "wiki.ic2.page.items.scanners.desc": "Scanners are an extremely useful tool for resource gathering.\n\nThey can be used in a Miner to guide what it should dig up for you.\n\nBut some of them can be independently used to show how many ores are actually present underneath you.\n\nTo add more features they can be used in combo with a Mining Drill to show you if something that you search for is nearby\n\nthough that is a lot more short ranged.",
  "wiki.ic2.page.items.tools": "Tools",
  "wiki.ic2.page.items.tools.desc": "IC2C provides you with a multitude of tools to help you in your quest to expand your factory.\n\nSome of these tools are fairly simple digging tools,\n\nothers give you access to valuable information, or just allow you to fortify/prettify your base.",
  "wiki.ic2.page.items.upgrades": "Upgrades",
  "wiki.ic2.page.items.upgrades.category": "These are the following upgrade categories:\n- §<redirect;true;Machine Upgrades;ic2:items.upgrades.machine>\n\n- §<redirect;true;Chargepad Upgrades;ic2:items.upgrades.chargepad>\n\n- §<redirect;true;Inventory Upgrades;ic2:items.upgrades.inventory>\n\n- §<redirect;true;Upgrade Kits;ic2:items.upgrades.kits>",
  "wiki.ic2.page.items.upgrades.chargepad": "Chargepad Upgrades",
  "wiki.ic2.page.items.upgrades.chargepad.desc": "ChargePads are cool and these upgrades allow the Chargepad to be more useful\n\nespecially for PVP scenarios which they were designed for from their original author.\n\nBut there are still a few highlights left, even for those who don't use PVP.",
  "wiki.ic2.page.items.upgrades.desc": "IC2C adds a multitude of upgrades for a lot of different machines.\n\nThese can be straight up upgrades or trade offs on what you can and can not do.",
  "wiki.ic2.page.items.upgrades.inventory": "Inventory Upgrades",
  "wiki.ic2.page.items.upgrades.inventory.desc": "Inventory upgrades have changed since the last version. There are only a couple of them left actually\n\nbut what they allow for is strict control of the inventory.",
  "wiki.ic2.page.items.upgrades.kits": "Upgrade Kits",
  "wiki.ic2.page.items.upgrades.kits.desc": "Upgrade Kits are your tool for upgrading parts of your factory without having to tearing everything apart and then placing the upgraded versions back down.\n\nThese are helpers that upgrade things in place instead.\n\nOfcourse this isn't always a easy step but it simplifies a lot.",
  "wiki.ic2.page.items.upgrades.machine": "Machine Upgrades",
  "wiki.ic2.page.items.upgrades.machine.desc": "Machine Upgrades are simply upgrades just for certain machines.\n\nThey come in a lot of variants, like: Transportation, Output Modification, Redstone Control, etc.\n\nThough each machine decides which of these actually can be used.",
  "wiki.ic2.page.main.body": "Now that that is out of the way lets go with some of the controls.\nAt the bottom right/left are buttons.\nThese will advance/backtrack you when clicked.",
  "wiki.ic2.page.main.head": "IC2Classic Wiki",
  "wiki.ic2.page.main.intro": "Welcome to the IC2Classic ingame documentation.\nThe least used item in IC2C. (Prediction)\nJust make sure if you throw me away that you know I am really pricy.\n\nAnyhow it is highly suggested to use The One Probe with this mod it provides a LOT of information for you. Also the EU Reader is your best friend! Be warned!",
  "wiki.ic2.page.main.wiki": "The Wiki has a lot of smaller, not so obvious details attached to it.\n\nFor example:\nIf you see §lbold text§r and over §<redirect;true;bold text;ic2:main> a tooltip may show up.\nIf this happens, that means it is a link to another page.\nWhich can be clicked on.§<newPage>For easier traversing, right click always brings you back to the previous page you were on if you followed a link.\nIf you didn't follow a link, you get moved to the first page.\n\nResolving a lot of \"Getting Lost\" issues that were reported...§<newPage>§<header;Bookmarks;true>\nThis wiki also contains books marks,\nwhich can be found at the left of the wiki.\nClicking them moves you to the desired page.\nWith shiftclicking you can remove bookmarks if they are not desired anymore.\nJust don't rip to hard on them!\nThis wiki is rather fragile§<newPage>§<header;Bookmark Overlay;true>\nBookmarks can be added dynamically as needed.\nYou just need to click the \"Green\" Bookmark with the + Symbol\nthen the book mark overlay shows up.§<image;ic2:textures/wiki/bookmarks.png;75;10;98>\nThe title of the bookmark can be customized in the blue area should you choose to.\n\nSelect the color in the red area.\nBy either:\n- Picking a predefined color.\n- Typing a hex code of a color.§<newPage>§<header;Wiki Search;true>\nThe IC2 Wiki also contains Search functionality.\nThis can be accessed with the Blue Bookmark with the magnifying glass.\n\nBy clicking on it, it will open up the Search Overlay.\nIt will attempt to show you the best results of what you search for.§<newPage>§<header;Extra Information;true>\nUnder some pages you will find these downwards facing arrows.§<image;ic2:textures/wiki/more_info.png;25;26.5;65>\n\nThese usually indicate that there is more info about the currently shown entry.\nClicking it will result in more info being shown.§<newPage>§<header;Controls;true>\n- §lLeft§r / §lRight§r §lKey§r: Move Page\n- §lUp§r / §lDown§r: Move Chapter\n- §lRightClick§r: Move back to the last page.\n- §l§<key;key.jei.showRecipe>§r: Show JEI Recipes\n- §l§<key;key.jei.showUses>§r: Show JEI Usage\n- §l§<key;key.sneak>§r + §l§<key;key.use>§r: On a block with the Wiki in your hand to open the page for it.§<newPage>§<header;Multi Block Overlay Keys;true>\n- §l§<key;key.attack>§r: Remove Ghost Structure\n- §l§<key;key.use>§r: Place Ghost Structure\n- §l§<key;key.ic2.hud>§r §l+§r §l§<key;key.pickItem>§r: Pick Ghost Structure\n- §l§<key;key.attack>§r: Remove Structure\n- §lR§r: Rotate Structure§<newPage>§<header;End of Introduction;true>\nThis covers the introduction into the wiki.\n\nThere is a lot more to read,\nfrom guides, to random useful information and let's not forget the corny jokes.\nYeah lets not forget that... The most important part!\n\nAnd at last have fun with the mod :D",
  "wiki.ic2.page.main.wiki_head": "Wiki Tutorial",
  "wiki.ic2.page.table.desc": "This is the table of contents.\n\n- §<redirect;true;Tutorials;ic2:tutorials>\n- §<redirect;true;Credits;ic2:credits>\n- §<redirect;true;Blocks;ic2:blocks.generators>\n  - §<redirect;true;Generators;ic2:blocks.generators>\n  - §<redirect;true;Machines;ic2:blocks.machines>\n  - §<redirect;true;Cables;ic2:blocks.cables>\n  - §<redirect;true;Electric Blocks;ic2:blocks.electric_blocks>\n  - §<redirect;true;Personal Blocks;ic2:blocks.personal_blocks>\n  - §<redirect;true;Fluid Blocks;ic2:blocks.fluid_blocks>\n  - §<redirect;true;Tubes;ic2:blocks.tubes>\n  - §<redirect;true;Explosives;ic2:blocks.explosives>\n  - §<redirect;true;Misc;ic2:blocks.misc>\n\n\n- §<redirect;true;Items;ic2:items.tools>\n  - §<redirect;true;Tools;ic2:items.tools>\n  - §<redirect;true;Electric Tools;ic2:items.electric_tools>\n  - §<redirect;true;Armors;ic2:items.armors>\n  - §<redirect;true;Batteries;ic2:items.batteries>\n  - §<redirect;true;Scanners;ic2:items.scanners>\n  - §<redirect;true;Upgrades;ic2:items.upgrades>\n  - §<redirect;true;Reactor Components;ic2:items.reactor.components>\n  - §<redirect;true;Monitor Cards;ic2:items.info.cards>\n  - §<redirect;true;Misc;ic2:items.misc>\n- §<redirect;true;Fluids;ic2:fluids>\n- §<redirect;true;Crops;ic2:crops>",
  "wiki.ic2.page.table.head": "Table Of Contents",
  "wiki.ic2.page.tutorials.desc": "This is the tutorial section of this book.\nIt provides a simple guideline and explanations on how certain features work.\n\nThis should assist in the progression but also on more complex features.\n\nOn the next page are links to the tutorials that already exist.",
  "wiki.ic2.page.tutorials.head": "Tutorials",
  "wiki.ic2.page.tutorials.head.path": "Tutorial Links",
  "wiki.ic2.page.tutorials.path": "Progression Tutorials:\n- §<redirect;true;First Day;ic2:subpage.first_day>\n- §<redirect;true;Early Game;ic2:subpage.early_game>\n- §<redirect;true;Second Tier;ic2:subpage.second_tier>\n- §<redirect;true;Third Tier;ic2:subpage.third_tier>\n- §<redirect;true;Fourth Tier;ic2:subpage.fourth_tier>\n\nMiscellaneous Tutorials:\n- §<redirect;true;Electricity;ic2:subpage.electricity>\n- §<redirect;true;Logistic Transport;ic2:subpage.logistic_grid>\n- §<redirect;true;Brewing;ic2:subpage.brewing>\n- §<redirect;true;Reactors;ic2:subpage.nuclear_reactor>",
  "wiki.ic2.preview.accumulator": "Quantum Accumulator",
  "wiki.ic2.preview.accumulator.desc": "The Accumulator is a high capacity, low power tier storage. It stores less but is more flexible.",
  "wiki.ic2.preview.activity_card.desc": "The Activity Card shows you if a machine is active or not.",
  "wiki.ic2.preview.adamantum.desc": "Adamantum is your diamond producing crop. It grows very slowly and requires a diamond ore/block to be underneath it.",
  "wiki.ic2.preview.adjustable_luminator.desc": "You need a specific light level? The Adjustable Luminator to the Rescue. It can be dimmed to any light level, while keeping all Luminator features!",
  "wiki.ic2.preview.advanced_chainsaw.desc": "The Advanced Chainsaw is your endgame tree-chopping tool. It eats trees alive! So be careful with that one. Not that it eats you too!",
  "wiki.ic2.preview.advanced_drill.desc": "The Advanced Drill is your endgame digger. It allows you to 3x3 mine as much as Speiger wanted to prevent it. Looks like he lost that battle!",
  "wiki.ic2.preview.advanced_hoe.desc": "The Advanced Hoe is the late-game mass-farming tool you want. It can till fields in a 5 block radius making life so much easier!",
  "wiki.ic2.preview.advanced_solar_helmet.desc": "The Advanced Solar Helmet is an upgraded Solar Helmet that produces 5EU/t charging your armor and tools.",
  "wiki.ic2.preview.advanced_tree_tap.desc": "The Advanced TreeTap is a monster. When used on a rubber tree it gets rid of the entire tree for a lot of Sticky Resin! What a monster!",
  "wiki.ic2.preview.air_refill_module.desc": "You are under water and you are running out of air? How about a Air Refill Module. It keeps you always with a fresh supply of Oxygen.",
  "wiki.ic2.preview.allium.desc": "Allium is magenta producing flower. Like all flowers it requires a bright area (12 or more). Not much else to say.",
  "wiki.ic2.preview.alloy_smelter.desc": "The Alloy Smelter is the gate to the next tier of progression. It uses 16EU/t and is used to create alloys or more complex materials.",
  "wiki.ic2.preview.alumen.desc": "Alumen is a Aluminium Producing Crop, it requires a Block/Ore of said or underneath it to fully grow.",
  "wiki.ic2.preview.aluminium_cable_item.desc": "The Aluminium Cable. It can deal with 8,192EU for a constant loss. Really good for endgame reactors.",
  "wiki.ic2.preview.argentum.desc": "Argentum is your Silver Producing Crops that needs a Block/Ore of said material underneath it to finish growing.",
  "wiki.ic2.preview.armor.bronze": "Bronze Armor",
  "wiki.ic2.preview.armor.bronze.desc": "Bronze Armor is slightly better then its iron counterpart in protection. Outside of that its basically a cheap iron variant.",
  "wiki.ic2.preview.armor.composite": "Composite Armor",
  "wiki.ic2.preview.armor.composite.desc": "Thanks to its dual layer armor and alloy plate shielding the Composite Armor is a really strong armor. Better then netherrite.",
  "wiki.ic2.preview.armor.hazmat": "Hazmat Suit",
  "wiki.ic2.preview.armor.hazmat.desc": "The Hazmat suit when fully equipped protects one from lava/fire and when having air cells makes sure you don't drown.",
  "wiki.ic2.preview.armor.jetpack.electric": "Electric Jetpack",
  "wiki.ic2.preview.armor.jetpack.electric.desc": "The Electric Jetpack is the electric variant of a jetpack. This makes it easier to keep fueled. The Compact Jetpack also has a Rocketmode!",
  "wiki.ic2.preview.armor.jetpack.nuclear": "Nuclear Jetpack",
  "wiki.ic2.preview.armor.jetpack.nuclear.desc": "Annoyed by the constant lack of fuel? The Nuclear Jetpack got you covered. Use §msafe§r Uran to keep it fueled.",
  "wiki.ic2.preview.armor.nano": "Nano Armor",
  "wiki.ic2.preview.armor.nano.desc": "The Nano Armor is your first electric armor in the game. It uses electricity to keep you safe and can be expanded on.",
  "wiki.ic2.preview.armor.quantum": "Quantum Armor",
  "wiki.ic2.preview.armor.quantum.desc": "Quantum Armor is the upgraded Nano Armor. It has a larger energy storages and more expansion capabilities.",
  "wiki.ic2.preview.armor_configurator.desc": "The Armor Configurator provides customizability to the Electric Armors with §lModules§r that enable specific functionality. Like Super Speed, Night Vision, Jetpacks, etc",
  "wiki.ic2.preview.armor_priority_pad_upgrade.desc": "The Armor Priority Upgrade changes the Chargepad to provide armor with power before the hotbar",
  "wiki.ic2.preview.aurelia.desc": "Aurelia is your gold producing crop that requires an ore/block of gold underneath it to finish growing. Some say it's too shiny!",
  "wiki.ic2.preview.auto_feeder_module.desc": "Ignore the arm that comes out of your head and shoves a food can into your mouth. It's only the Auto Feeder Module automatically feeding you food cans.",
  "wiki.ic2.preview.azure_bluet.desc": "The Azure Bluet is a flower that produces gray dye. Like all flowers it requires a light level of 12 or more.",
  "wiki.ic2.preview.bamboo.desc": "The Bamboo crop produces bamboo and grows rather quickly. Though it prefers a low (4 or less) humidity to grow.",
  "wiki.ic2.preview.base_module.desc": "The Base Module. A crafting component to create Electric armor upgrades that can be installed in the Armor Configurator.",
  "wiki.ic2.preview.base_teleporter.desc": "The Base Teleporter is your local home network of destinations where you can jump around as needed for 4000EU/teleport. It has a horizontal radius of 100 blocks",
  "wiki.ic2.preview.battery": "Batteries",
  "wiki.ic2.preview.battery.desc": "Batteries are your portable energy storage that can be used to power other machines even outside of your grid.",
  "wiki.ic2.preview.battery.pack": "Energy Pack",
  "wiki.ic2.preview.battery.pack.desc": "The Energy Pack is another portable form of power storage. Where equipped tools, etc can make use of its power.",
  "wiki.ic2.preview.battery_station": "Battery Station",
  "wiki.ic2.preview.battery_station.desc": "The Battery Station discharges electric items to then output them into the world. It creates 4 packet of its tier.",
  "wiki.ic2.preview.beetroot.desc": "The Beetroot crop produces red beets that can be either turned into food or red dye.\n\nCan optionally produce seeds when set into that mode.",
  "wiki.ic2.preview.blackthorn.desc": "The Blackthrorn is a rose that produces black dye. Some rumor that it used to produce ink sacks. Sadly that seemed to be a lie.",
  "wiki.ic2.preview.blast_induction_furnace.desc": "The Induction Blast Furnace is a specialized induction furnace for ores only. It uses 30EU/t for faster smelting",
  "wiki.ic2.preview.blue_orchid.desc": "The Blue Orchid is known in the wild only to grow in swamps. The high nutrients make it a suitable target. Though it is not required. It does require a bright area though (12 or more). It produces light blue dye.",
  "wiki.ic2.preview.blue_wheat.desc": "Blue Wheat is a weird crop. Someone could say they wanted to rip off people by painting wheat blue but no. It is a lapis producing crop that requires a lot of water. Due to such high water requirements it is known to grown underwater.",
  "wiki.ic2.preview.bone_flower.desc": "The Bone Flower has a bone to pick with you. I am not joking. It produces bonemeal. It also requires a bone block underneath it to actually grow.",
  "wiki.ic2.preview.brain_coral.desc": "The Brain Coral is a underwater crop that can be used to grow coral blocks. It has a chance to produce all variants of brain corals. That is under the assumtion it's alive. It requires clean water (3 or more) to grow.",
  "wiki.ic2.preview.bronze_cable_item.desc": "The Bronze Cable: the cheap alternative to gold! It handles up to 128EU but can only be used 1 block before losses occurs.",
  "wiki.ic2.preview.brown_mushroom.desc": "The Brown Mushroom produces itself, like a lot of other crops. It requires a Humidity of 1 or more to grow. And it grows rather fast.",
  "wiki.ic2.preview.bubble_coral.desc": "The Bubble Coral is an underwater crop that can be used to grow coral blocks. It has a chance to produce all variants of bubble corals. That is under the assumtion it's alive. It requires clean water (3 or more) to grow.",
  "wiki.ic2.preview.buffer_storage_expansion.desc": "The Buffer Storage Expansion provides the Industrial Worktable with 9 temporary output slots that it can store undesired items in.",
  "wiki.ic2.preview.cactus.desc": "Cactus stings when touched and changing from a full sized one to a smaller one doesn't change that. It just requires sun light. Also the hotter the biome is, the faster it grows",
  "wiki.ic2.preview.canner.desc": "The Canner is a packager that uses 1EU/t to package food into cans or refill tools/items with their fuels/needs or combine fuels to make them more effective.",
  "wiki.ic2.preview.capacity_pipe.desc": "The High Volume Pipe has a higher transferrate, 200mB/tick compared to the normal pipe, but the strength is same.",
  "wiki.ic2.preview.carrot.desc": "Carrots are a great food source for you and your pigs! The Crop grows itself and provides you with a steady supplies of carrots. It requires a bright area around itself. (9 or higher)",
  "wiki.ic2.preview.centrifugal_extractor.desc": "The Centrifugal Extractor is an upgraded extractor using high speed rotation to extract elements from each other. Using 16EU/t",
  "wiki.ic2.preview.centrifugal_rare_earth_extractor.desc": "The Centrifugal REE is an upgrade to its counterpart which uses the power of rotation to separate rare metals a lot faster! It uses 16EU/t.",
  "wiki.ic2.preview.cf_pack.desc": "The CFoam Pack allows you to carry a lot more Cfoam with you. This becomes really useful for bigger spraying missions.",
  "wiki.ic2.preview.cfoam": "Construction Foam",
  "wiki.ic2.preview.cfoam.carpet": "CFoam Carpet",
  "wiki.ic2.preview.cfoam.carpet.desc": "CFoam Carpets are incombustible and explosion resistant carpets!",
  "wiki.ic2.preview.cfoam.desc": "The Construction Foam Block is a decorative explosion resistant. It's not perfect but TNT doesn't scratch it.",
  "wiki.ic2.preview.cfoam.panel": "CFoam Panel",
  "wiki.ic2.preview.cfoam.panel.desc": "CFoam Panel that can be used to create railings or fence like results. It's also explosion resistant.",
  "wiki.ic2.preview.cfoam.slabs": "CFoam Slabs",
  "wiki.ic2.preview.cfoam.slabs.desc": "CFoam Slabs are decorative slabs that are also explosion resistant.",
  "wiki.ic2.preview.cfoam.stairs": "CFoam Stairs",
  "wiki.ic2.preview.cfoam.stairs.desc": "CFoam Stairs are decorative stairs that are also explosion resistant.",
  "wiki.ic2.preview.cfoam.tiles": "CFoam Tiles",
  "wiki.ic2.preview.cfoam.tiles.desc": "CFoam Tiles are carpet like in their shape yet are stone like. Again For decoration but explosion resistant.",
  "wiki.ic2.preview.cfoam.wall": "CFoam Wall",
  "wiki.ic2.preview.cfoam.wall.desc": "Want a decorative wall that is explosion resistant? CFoam walls got you covered!",
  "wiki.ic2.preview.cfoam.wool": "CFoam Wool",
  "wiki.ic2.preview.cfoam.wool.desc": "Incombustible explosion resistant wool? CFoam wool got you covered!",
  "wiki.ic2.preview.chainsaw.desc": "The Chainsaw is your go-to multi-purpose tool/weapon! It's really good at chopping trees but can also shear sheep. Overall a really useful tool!",
  "wiki.ic2.preview.charged_electrolyzer.desc": "The Charged Electrolyzer is a upgraded electrolyzer that is able to make use of multiple energy storages to infuse items a lot faster!",
  "wiki.ic2.preview.chargepad": "Charge Pad",
  "wiki.ic2.preview.chargepad.desc": "The Chargepad is stationary recharger that will take care of your electric items when you stand on it. Just don't fall on it!",
  "wiki.ic2.preview.charger_module.desc": "The Charger Module. It adds special circuitry to the electric armor to share power with other items if they need it in your inventory.",
  "wiki.ic2.preview.charging_bench": "Charging Bench",
  "wiki.ic2.preview.charging_bench.desc": "The Charging Bench is a mass charging tool that is able to charge up to 16 any tier of electric item. It comes with some useful tools.",
  "wiki.ic2.preview.chunkloader.desc": "The Chunkloader uses electricity to keep the world from collapsing by creating a space time chamber. How big that is depends on power provided. 5EU/t at minimum.",
  "wiki.ic2.preview.cocoa.desc": "The Cocoa Bean crop produces said beans. It requires a nutritional ground (3 or more) to grow.",
  "wiki.ic2.preview.coffee.desc": "Coffee is the polar opposite to tea and both groups dislike each other immensely. It produces coffee beans if the area is bright enough (9 or higher), that can be used to craft various coffee products that give various effects.",
  "wiki.ic2.preview.coin.desc": "The Industrial Coin is a uncraftable item. It's a currency so it shouldn't be creatable. It is given out by the Trade-O-Mats.",
  "wiki.ic2.preview.color_filter_tube.desc": "The Color Filter Tube simply sorts items based on their color. Allowing for a more simplified filter and more complex systems.",
  "wiki.ic2.preview.colossal_compressor.desc": "What can you do if you have a hyper speed Compressor? Make the largest compressor possible! That is the Colossal Compressor! 40EU/t",
  "wiki.ic2.preview.colossal_extractor.desc": "What can you do if you have a hyper speed Extractor? Make the largest extractor possible! That is the Colossal Extractor! 40EU/t",
  "wiki.ic2.preview.colossal_furnace.desc": "What can you do if you have a hyper speed Furnace? Make the largest furnace possible! That is the Colossal Furnace! 40EU/t",
  "wiki.ic2.preview.colossal_macerator.desc": "What can you do if you have a hyper speed Macerator? Make the largest macerator possible! That is the Colossal Macerator! 40EU/t",
  "wiki.ic2.preview.colossal_recycler.desc": "What can you do if you have a hyper speed Reycler? Make the largest reycler possible! That is the Colossal Reycler! 40EU/t. It also increases luck by 500%",
  "wiki.ic2.preview.compact_solar_panel": "Compact Solar Panel",
  "wiki.ic2.preview.compact_solar_panel.desc": "Compact Solar Panels are basically a bunch of Solar Panels thrown together to save space. SERIOUSLY?!?!?",
  "wiki.ic2.preview.compact_watermill": "Compact Watermill",
  "wiki.ic2.preview.compact_watermill.desc": "Compact Watermills are thrown together Watermills, to brute force more efficency out of them...which somehow works o.O?!?",
  "wiki.ic2.preview.compacting_recycler.desc": "The Compacting Recycler is an upgraded Recycler that uses 16EU/t to insanely fast recycle all the junk you don't need anymore.",
  "wiki.ic2.preview.comparing_cable_item.desc": "The Comparing Cable: It outputs a redstone signal based on the desired power throughput range. It can deal with 2048EU and has a loss every 2 Blocks",
  "wiki.ic2.preview.compressor.desc": "The Compressor is one of the machines required to advance in the tech tree. It does what it says; squishing things together. At a cheap 2EU/t. Get it before its too late!",
  "wiki.ic2.preview.condensator.desc": "The Condensator is the resource solution to getting rid of heat. They store a lot of heat. Useful for unstable reactor designs.",
  "wiki.ic2.preview.construction_light.desc": "You want a more interesting light in your construction site? How about a construction light? It makes the feel that much more realistic! Also it works!",
  "wiki.ic2.preview.copper_cable_item.desc": "The Copper Cable. Your starter cable that can handle up to 32EU and can be used for 5 blocks before any loss occurs.",
  "wiki.ic2.preview.cornflower.desc": "The Cornflower is a flower you would expect to produce corn. Nope, it produces blue dye! How that is logical? Ask someone else. It requires like all flowers a bright area (12 or more) to grow.",
  "wiki.ic2.preview.crimson_fungus.desc": "Crimson Fungus is your nether sapling. It can be grown into logs that allow you to survive in the nether without having logs with you. This crop though produces mushrooms and it requires a completely dry environment. Just make sure it doesn't explode on you.",
  "wiki.ic2.preview.crop_analyzer.desc": "The Crop Analyzer is your tool to find out what crops you have at the moment. But also allows you to see what crops would make if you breed them.",
  "wiki.ic2.preview.crop_analyzer_block.desc": "The Crop Analyzer is a stationary crop analyzer that can automatically analyze crops for 10000EU a crop. Though not instant it does that at 1EU/t.",
  "wiki.ic2.preview.crop_harvester.desc": "The Crop Harvester is an automatic crop picking machine. It is not fast and gets less resources but it can be upgraded and does its job for 5EU/t",
  "wiki.ic2.preview.crop_library.desc": "The Crop Library is your Digital Crop Storage. It can store as many crops as you need. Though 1EU/t is required to access them and its contents are lost when broken!",
  "wiki.ic2.preview.cropmatron.desc": "The Cropmatron is the babysitter of your crops. You want to have loved crops? Invest into one of these. 1-31EU/t your crops get all the tending they need!",
  "wiki.ic2.preview.cutter.desc": "The Cutter is your tool to control your wires. It is capable of adding and removing insulation of Cables.",
  "wiki.ic2.preview.damage_conversion_pad_upgrade.desc": "The Damage Conversion Upgrade turns the Chargepad into a deadly trap. Instead of using power to charge players it damages them.",
  "wiki.ic2.preview.dandelion.desc": "The Dandelion is your typical yellow flower that requires a bright area (12 or more) to grow. Nothing special to it.",
  "wiki.ic2.preview.detector_cable_item.desc": "The Detector Cable. It detects if power flows through it and then emits a redstone signal. It can handle 2048EU and can go for 2 blocks before any loss.",
  "wiki.ic2.preview.detector_card.desc": "The Detector Card allows you to visualize who triggered Player Detectors, allowing to create something like an access log.",
  "wiki.ic2.preview.detector_pipe.desc": "The Detector Pipe is redstone emitting pipe whenever a fluid is sent through it.",
  "wiki.ic2.preview.diamond_drill.desc": "The Diamond Drill is a drill upgrade that gives it the ability to mine harder blocks like obsidian, but also it mines dirt insanely fast. Warranting a dirt mode!",
  "wiki.ic2.preview.directional_tube.desc": "The Directional Tube forces items in a desired direction. Output can be optional blocked so nothing tries to come in through the output.",
  "wiki.ic2.preview.drain_conversion_pad_upgrade.desc": "The Drain Conversion Upgrade is even meaner. Instead of charging your items, it discharges them using the power you have in the pad.",
  "wiki.ic2.preview.drill.desc": "The Mining Drill is one of the earliest electric tools you'll want. It is a pickaxe and shovel combined into one. And with Scanner can scan for ores nearby!",
  "wiki.ic2.preview.dropping_tube.desc": "The Dropping Tube is like a dropper but doesn't have random motions attached to it. Also no redstone required!",
  "wiki.ic2.preview.dyeing_tube.desc": "The Dyeing Tube colors items that flow through it in the desired color. Painters are used for color selection.",
  "wiki.ic2.preview.dynamite.desc": "Dynamite is your really controlled explosion. It can be placed or thrown. It creates a 3x3x3 explosion that destroys most blocks. Good for mining.",
  "wiki.ic2.preview.dynamite_remote.desc": "The Dynamite-O-Mote can link to placed dynamite and can trigger all linked ones at once.",
  "wiki.ic2.preview.electric_blast_furnace.desc": "The Electric Blast furnace is specialized to only smelt ores using electricity. It uses 5EU/t and is a ~40% faster Blast Furnace",
  "wiki.ic2.preview.electric_enchanter.desc": "The Electric Enchanter gives you the ability to enchant electric tools. This is the only way and it takes 500EU/t to do so.",
  "wiki.ic2.preview.electric_furnace.desc": "The Electric Furnace is a simple yet straight forward furnace that uses electricity to cook. It uses 3EU/t and is ~40% faster than a normal Furnace.",
  "wiki.ic2.preview.electric_hoe.desc": "The Electric Hoe is your unbreakable hoe that can also change the drops of crops from products to seeds and back!",
  "wiki.ic2.preview.electric_pipe_pump.desc": "The EPP is a pump that uses electricity to send fluids through a pipe network. It has a strength of 250 Blocks and transfers up to 10kmB per tick.",
  "wiki.ic2.preview.electric_smoker.desc": "The Electric Smoker uses electricity to smoke food?!?!?! HOW? Magic? Magic! It uses 5EU/t and is ~40% faster then the normal Smoker",
  "wiki.ic2.preview.electric_sprayer.desc": "The Electric Sprayer is your more controlled sprayer. Uses EU to precisely control how much CFoam is released. Only refillable in a Canner.",
  "wiki.ic2.preview.electric_tree_tap.desc": "Treetaps are fragile so the electric TreeTap solves that by using EU instead. It can be later also upgraded to auto insert the sticky resin into your inventory!",
  "wiki.ic2.preview.electric_vent.desc": "The Electric Vents use EU production from your reactor to cool it down 2x effective compared to the normal ones.",
  "wiki.ic2.preview.electric_wood_gassifier.desc": "The Electric Wood Gasificator is a electrified Wood Gasificator that uses 1EU/t to do the same job. Sadly it produces slightly less wood gas",
  "wiki.ic2.preview.electric_wrench.desc": "The Electric Wrench is your upgrade to the wrench. It has a slightly higher drop rate, that can be upgraded, and it has 15 ensured lossless drops.",
  "wiki.ic2.preview.electrolyzer.desc": "The Electrolyzer is a machine that infuses items with electricity. It is required to directly touch a mostly full energy storage to do its work. The storage tier decides speed.",
  "wiki.ic2.preview.energy_hud_module.desc": "The HUD Module adds an info display to your view allowing you to see the power of each electric armor piece all the time. Its position isn't final.",
  "wiki.ic2.preview.energy_o_mat.desc": "The Energy-O-Mat is a block that allows energy to be traded for items or coins. It requires a personal energy storage to be connected. Allows automated Trading.",
  "wiki.ic2.preview.energy_storage": "Energy Storage",
  "wiki.ic2.preview.energy_storage.desc": "Energy Storages store excess energy in your power grid. The packet energy limit is the same as it outputs.",
  "wiki.ic2.preview.eu_card.desc": "The EU Card shows you how much power is inside a machine.",
  "wiki.ic2.preview.eu_reader.desc": "The EU Reader is your information tool. Be it GUI info, energy flow information or just general stats. It opens up the informations you get massively!",
  "wiki.ic2.preview.extinguish_module.desc": "You are on fire? Do you wanna get rid of it? The Extinguish Module comes to the rescue! It removes the fire of you as soon as it appears. It does not protect from lava.",
  "wiki.ic2.preview.extraction_tube.desc": "The Extraction Tube is the tube that simply extracts from connected inventories at a steady paste. Optional Extra extraction faces can be added via TubeTool.",
  "wiki.ic2.preview.extractor.desc": "The Extractor is a resource refiner. Its main use is to refine sticky resin into rubber, tripling your output!. But it has a lot more uses. Justifying the 2EU/t.",
  "wiki.ic2.preview.ferru.desc": "The Ferru Crop is your Iron Crop. The most valueable out of all metal crops. It requires a niron block/ore to finish growing.",
  "wiki.ic2.preview.fertilizer.desc": "Fertilizer is used to boost the growth of crops. It's slowly consumed over time.",
  "wiki.ic2.preview.filter_tube.desc": "The Filter Tube allows sorting items into your desired directions.",
  "wiki.ic2.preview.filtered_extraction_tube.desc": "The Filtered Extraction Tube is a much more advanced Extraction Tube. It can be filtered but also upgraded to move more items at once.",
  "wiki.ic2.preview.filtered_scanner.desc": "The Filtered Scanner allows you to decide what exactly are you searching for. It is not limited to ores like the others.",
  "wiki.ic2.preview.fire_coral.desc": "The Fire Coral is a underwater crop that can be used to grow coral Blocks. It has a chance to produce all variants of fire corals that is under the assumtion it's alive. It requires clean water (3 or more) to grow.",
  "wiki.ic2.preview.fisher": "Electric Fisher",
  "wiki.ic2.preview.fisher.desc": "The Electric Fisher is your endgame solution to loot. It takes a lot of power but drains the oceans out of all its loot.",
  "wiki.ic2.preview.fluid_expansion.desc": "The Fluid Expansion allows the Industrial Workbench to use fluids directly in its recipes. It stores up to 4 different fluids with a capacity of 128 buckets.",
  "wiki.ic2.preview.fluid_o_mat.desc": "The Fluid-O-Mat is a Block that fluids to be traded for items or coins. It requires a Personal Tank to be connected. Allows automated Trading.",
  "wiki.ic2.preview.fluid_scanner.desc": "The Fluid Scanner only searches for fluids. Its main use is for the Ranged Pump or if you use the Miner with pumps",
  "wiki.ic2.preview.fluid_scanner_filtered.desc": "The Filtered Fluid Scanner allows you to search for specific fluids instead of any of them.",
  "wiki.ic2.preview.fluid_tube.desc": "The Fluid Tube, the unholy fusion between a tube and pipe. Basically allows crossing of 2 streams.",
  "wiki.ic2.preview.flux_generator": "Flux Generator",
  "wiki.ic2.preview.flux_generator.desc": "The Flux Generator creates RF out of EU. Allowing for FE/RF Power by means of EU and can act as an item charger!",
  "wiki.ic2.preview.foam_sprayer.desc": "The CFoam Sprayer uses pellets to spray wet CFoam. Scaffolds can be used as guidelines, and wires/tubes/pipes can be sprayed too.",
  "wiki.ic2.preview.food_storage_module.desc": "Don't want to carry food cans around in your inventory? No problem! The Food Storage Module adds 4 slots for useable foodcans.",
  "wiki.ic2.preview.forget_me_not.desc": "The Forget Me Not flower is a pretty looking cyan flower. It is usually forgotten since it is a compound flower that is not often needed. It requires like all flowers a bright area to grow (12 or more).",
  "wiki.ic2.preview.frequency_transmitter.desc": "The Frequency Transmitter is the tool to link 2 teleporters or teleport valves together.",
  "wiki.ic2.preview.fuel_boiler.desc": "The Fuel Boiler is a steam producing multiblock machine that can only be fed with fuel cans, albeit at a really high fuel efficiency. It produces 1024mB/t of Steam.",
  "wiki.ic2.preview.fuel_can.desc": "The Fuelcan is your modular fuel storage. It is refilled in the §lCanner§r and can be a really great fuel source. Depending on the canner it can be filled with 6-12 items.",
  "wiki.ic2.preview.fuel_jetpack.desc": "The Jetpack is your early game solution to flight. It is really good at vertical motion but sadly not so good at horizontal motion.",
  "wiki.ic2.preview.fusion_reactor.desc": "Out of lava? Want a good constant supply? And don't want to pump the nether? The Fusion Reactor got you covered. It produces lava using uranium! Ultra Efficently!",
  "wiki.ic2.preview.generator.desc": "The Generator is your most basic machine for EU generation, producing a whooping 10EU/t. It uses solid fuels, such as coal or wood, in a similar manner as a furnace.",
  "wiki.ic2.preview.geothermal_generator.desc": "The Geothermal is a powerful lava-using generator, Producing a whooping 20EU/t. Covering a lot of your early game needs easily.",
  "wiki.ic2.preview.glassfiber_cable_item.desc": "The Glassfiber Cable. Wait Glassfiber? How? Magic? Anyhow its a expensive but valuable cable that deals with 512EU and can go 40 blocks without loss",
  "wiki.ic2.preview.glow_berry.desc": "The Glow Berry is a mid-game(ish) food that can be used for baking!\n\nOtherwise there is not much about it.",
  "wiki.ic2.preview.glowshroom.desc": "The Glowshroom. Why does it exist? Because GLOWSHROOM! It produces glowstone dust but requires a glowstone block to touch it so it can finish growing.",
  "wiki.ic2.preview.gold_cable_item.desc": "The Gold Cable: your higher quality power transfer. Handling up to 128EU and can transfer 2 blocks without any loss.",
  "wiki.ic2.preview.heat_exchanger.desc": "The Heat Exchanger exchanges heat with nearby components and or the reactor itself, helping balance out the heat.",
  "wiki.ic2.preview.heat_pack.desc": "The Heatpack heats up the reactor to 1000x its size. Allowing to easily maintain a certain heat level. Can not be used in a Steam Reactor",
  "wiki.ic2.preview.heat_spreader.desc": "The Component heat vent cools down the nearby touching components slowly.",
  "wiki.ic2.preview.heat_storage": "Coolant Cell",
  "wiki.ic2.preview.heat_storage.desc": "The Heat Storage allows you to temporary store heat in a heat cache. Allowing your components to last longer.",
  "wiki.ic2.preview.heat_vent.desc": "The Heat Vent slowly cools itself and/or the reactor.",
  "wiki.ic2.preview.hemp.desc": "Hemp is a IC2 exclusive crop. Yes, you cannot plant it without IC2 crop sticks. It produces said Hemp that can be used in a lot of manufacturing processes. It requires a bright area to grow (7 or more).",
  "wiki.ic2.preview.hops.desc": "Hops are your introduction into brewing. Beer can be sold to villagers, used to produce power, or for higher yields from ores. It is a fully manual process that takes hours to finish but can be easily mass produced. It requires a bright area (9 or more) to grow.",
  "wiki.ic2.preview.horn_coral.desc": "The Horn Coral is a underwater crop that can be used to grow coral blocks. It has a chance to produce all variants of horn corals. That is under the assumtion its alive. It requires clean water (3 or more) to grow.",
  "wiki.ic2.preview.hover_tube.desc": "The Hover Tube is a expensive piece of technology that allows items not to be affected by gravity or change speed at all.",
  "wiki.ic2.preview.hydration_cell.desc": "The Hydration Cell is your way to provide extra humidity to your crops. Some require a really high humidity to grow.",
  "wiki.ic2.preview.induction_furnace.desc": "The Induction Furnace is an upgraded electric furnace that can process items faster and up to 2 at once at the cost of staying powered and 16EU/t (1EU/t idle).",
  "wiki.ic2.preview.industrial_belt.desc": "The Industrial Belt allows you to carry some charge around your legs that tools can make use of when at a mining session.",
  "wiki.ic2.preview.industrial_worktable.desc": "The Industrial Worktable is the main tool that will make sure all your crafting needs are dealt with as efficiently as possible!",
  "wiki.ic2.preview.inkbergine.desc": "The Inkbergine is a squid planted underwater upside down into the ground. It slowly grows inksacks for you. But be careful not to touch it. It might ink at you.",
  "wiki.ic2.preview.input_pipe.desc": "The Input Pipe accepts fluids from external sources, causing them to be distributed through it. Only has a strength of 25 blocks.",
  "wiki.ic2.preview.insertion_tube.desc": "The Insertion Tube prioritizes inserting into inventories over into going to other tubes, plain and simple.",
  "wiki.ic2.preview.inv_card.desc": "The Inventory Card allows you to visualize a inventory with multiple modes of how it should be displayed. A good way to keep track of inventories!",
  "wiki.ic2.preview.iridium_stone.desc": "Need a personalized base? Iridium Stone is the perfect source for it. The block can only be destroyed by their owner and they are NUKE-SAFE!",
  "wiki.ic2.preview.iron_cable_item.desc": "The Refined Iron Cable. It is able to withstand 2048EU but with the price that it has 1EU loss at every block.",
  "wiki.ic2.preview.iron_furnace.desc": "The Iron Furnace, is a better version of the normal furnace. Its main improvements are a faster cook time which also improves fuel efficiency.\nIron > Stone.",
  "wiki.ic2.preview.item_limiter.desc": "The Item Limiter Upgrade allows you to decide how many items of each type are allowed to stay in the specific inventory. Which can come handy really easily.",
  "wiki.ic2.preview.itnt.desc": "Industrial TNT is a upgraded form of TNT. It has a stronger explosion strength, but works exactly like TNT and drops all destroyed blocks! Perfect for mining!",
  "wiki.ic2.preview.jump_boost_module.desc": "The Jump Boost Module provides you with a stronger jump force to jump higher then normal.",
  "wiki.ic2.preview.kelp.desc": "Kelp is your underwater fuel source that you can actually grow on land now!. Mass production is usually desireable since it is a really solid fuel source. It also cleans the water around it.",
  "wiki.ic2.preview.lag_card.desc": "The Lag Card shows you how much lag is on the server. It is the global lag.",
  "wiki.ic2.preview.lava_module.desc": "Ever wanted a hot bath? How about a lava bath? The Lava Module allows you to swim in lava for a constant energy drain.",
  "wiki.ic2.preview.light_module.desc": "Do you hate placing torches in caves? The Light Module is a toggleable portable light. Note that this is a actual light not a renderer only thing.",
  "wiki.ic2.preview.lily_of_the_valley.desc": "The Lily of the Valley is your typical white dye flower. It requires a constant light source of 12 or more to fully grow.",
  "wiki.ic2.preview.limiter_tube.desc": "The Limiter Tube is your way of partially splitting a request grid, where some request colors are blocked, while others are let through. ",
  "wiki.ic2.preview.liquid_generator.desc": "The Liquid Fuel Generator uses liquid fuels to produce power. Production varies heavily based on the fuel.",
  "wiki.ic2.preview.lumilia.desc": "The Lumilia is decorative Crop that requires moon light to grow. It only produces leaves, but it emits a light when it is fully grown.",
  "wiki.ic2.preview.luminator.desc": "The Luminator does what it says; it brightens up your day! For a little bit of energy of course. It can be also encapsuled in glass when clicked with said glass.",
  "wiki.ic2.preview.macerator.desc": "The Macerator is a really useful early game machine. Its purpose is pretty simple: smash ores to dust, doubling your ingots! It uses 2EU/t to do so.",
  "wiki.ic2.preview.machine_buffer.desc": "The Machine Buffer is a small item buffer that is capable of using transport upgrades to sort items around. Really useful for automation.",
  "wiki.ic2.preview.machine_tank.desc": "The Machine Tank is a small fluid buffer that is capable of using transport upgrades to transfer fluids around. Really useful for automation.",
  "wiki.ic2.preview.magnetizer.desc": "The Magnetizer is what a bubble column is to a ladder. It charges up Iron Fences that will swoosh you up into the sky or slowly let you down if you sneak while wearing metallic boots!",
  "wiki.ic2.preview.malachite.desc": "Malachite is your rusty copper crop. It requires a ore/block underneath it to finish growing.",
  "wiki.ic2.preview.mass_fabricator.desc": "Too much energy? No worries the Massfab has you covered!! It uses a lot of energy to create pink blobs called UU Matter that can be used to craft almost anything!",
  "wiki.ic2.preview.melon.desc": "The Melon is a chunky food source that produces melon slices though it has a small chance to produce full melon blocks too. It can be also set to produce seeds instead of slices.",
  "wiki.ic2.preview.memory_expansion.desc": "The Memory Expansion provides the Industrial Workbench up to 18 new recipe slots for your more complex recipes.",
  "wiki.ic2.preview.memory_stick.desc": "The Memory Stick is the recipe expansion to the Industrial Workbench and Bulk Crafter. It stores the recipes for later use.",
  "wiki.ic2.preview.miner.desc": "The Miner is a really efficient digger. It uses scanners, drills and mining pipes to dig directly towards the ores instead of quarrying. Using 16EU/t. Pumps interact with it.",
  "wiki.ic2.preview.miner_remote.desc": "The Miner Remote is a locator for the Rocket Miner that allows it to come to its \"Home\" Location, to be refueled or emptied.",
  "wiki.ic2.preview.mining_laser.desc": "The Mining Laser is your advanced digging tool. It has various laser modes to get rid of Blocks. It can be used in a Miner and it has a powerful weapon mode too!",
  "wiki.ic2.preview.monitor.desc": "The Monitor. A really useful, fully modular, block that displays text and other things on it. It uses monitor cards to function.",
  "wiki.ic2.preview.monitor_card.desc": "The Monitor Card is the base for all information cards you need or in TLDR terms; its a crafting component. Monitor Cards can be customized via a gui.",
  "wiki.ic2.preview.mowing_tool.desc": "Ever get annoyed of leaves or grass? The Mowing Tool comes to the rescue! When enabled you look at something that annoys you and GONE it is! It avoids crops though.",
  "wiki.ic2.preview.nano_saber.desc": "The Nano Saber is your weapon of choice against electric armor. It deals a lot of extra damage on a molecular level. Making it a dangerous counter! ",
  "wiki.ic2.preview.netherwart.desc": "The Netherwart is the opposite of a Terrawart. It is used to produce potions among a few other things. If a soulsand block is underneath it it grows 50% faster and Terrawarts turn into Netherwarts.",
  "wiki.ic2.preview.nightvision_goggles.desc": "Night Vision Goggles let you see in the dark. But unlike the experimental counter part it does not make you blind when in bright spots.",
  "wiki.ic2.preview.nuclear_reactor.desc": "The Nuclear Reactor is your \"§lUltimate§r §lPower§r §lSource!§r\". It is fully customizable §mand safe§r! It's able to fulfil all your power needs. At the risk of losing everything.",
  "wiki.ic2.preview.nuke": "Nuke",
  "wiki.ic2.preview.nuke.desc": "The Nuke is a very strong explosion. It is roughly 75x stronger then normal TNT. Expect a very large crater with very little items dropped. Can be defused by Wrench.",
  "wiki.ic2.preview.obscurator.desc": "Ever wanted to build a solid 9x9 house of diamond but didnt't want to mine for it? The Obscurator does the job! It can copy and rotate textures and paste it on to CFoam!",
  "wiki.ic2.preview.ocean_generator.desc": "The Ocean Generator is a powerhouse of a producer. It requires a lot of water to function and coral blocks to keep it clean. It produces up to a whooping 100EU/t.",
  "wiki.ic2.preview.orange_tulip.desc": "The Orange Tulip is part of the tulip flower family. It produces orange dye and requires a light level of 12 or higher.",
  "wiki.ic2.preview.ore_scanner.desc": "The Ore Scanner makes use of scanners and 40EU/block to show you exactly what/how much and where your desired resources are! Really underappreciated!",
  "wiki.ic2.preview.overclocked_pump.desc": "The Overclocked Pump is a faster pump that does the exact same with an added power cost attached to it. Just a lot faster.",
  "wiki.ic2.preview.overgrowth_fertilizer.desc": "This special fertilizer is your nuclear fuel for crops. With it the growth speed increases by 256x for 5 mins. This can go horribly wrong.",
  "wiki.ic2.preview.oxeye_daisy.desc": "The Oxeye Daisy is a daisy flower that produces light gray dye. Like all flowers it needs a bright light level.",
  "wiki.ic2.preview.painter.desc": "The Painter colors stuff. Shocking I know... On top of that it makes dyes more efficient and can mass-paint blocks too.",
  "wiki.ic2.preview.parachute_module.desc": "You are falling from really high and you know you are going to die. You should have added a Parachute Module that could have prevented that. Too bad!",
  "wiki.ic2.preview.personal_chest.desc": "You like your items safe? Even if someone Nukes your base? The Personal Chest has got you covered. It provides access control and can not be destroyed!",
  "wiki.ic2.preview.personal_tank.desc": "You want your own Personalized Tank? That nobody can nag from? The Personal Tank got you covered. It allows even customized Access!",
  "wiki.ic2.preview.pickup_tube.desc": "The Pickup tube inserts any item that it touches into itself, with a configurable radius using the §<redirect;true;Tube Tool;ic2:preview.tube_tool>. The lines it throws must be that good. Good for cacti farms.",
  "wiki.ic2.preview.pink_tulip.desc": "Ok you must be getting bored of this self repeating text. The Pink Tulip is a pink flower that requires a light level of 12 or more and produces pink dye.",
  "wiki.ic2.preview.pipe.desc": "The Fluid Pipe is your tool to transport fluids around. It has some output filters and optional extraction abilities. Can send 20mB/t with a strength of 25.",
  "wiki.ic2.preview.pixelfoam": "Pixel Foam",
  "wiki.ic2.preview.pixelfoam.desc": "Pixelfoam is a very decorative block with unique texturing. Some might have special abilities!",
  "wiki.ic2.preview.plasma_cable_item.desc": "The Plasma Cable: the ULTIMATE cable! It can deal with 32kEU though for a loss every block. At this point? Who cares about loss?",
  "wiki.ic2.preview.plasmafier.desc": "The Plasmafier is the last gate to LuV Tier. It creates plasma with 10000EU/t and UU-Matter which can be stored in empty cells that are used unlock all the endgame items!",
  "wiki.ic2.preview.plating.desc": "Reactor Plating allows you to expand the heat limit of the reactor before it blows up.",
  "wiki.ic2.preview.poppy.desc": "The Poppy, also known as a rose, is your basic red flower. Same rules like all flowers apply.",
  "wiki.ic2.preview.portable_teleporter.desc": "The Portable Teleporter is at the §labsolute§r §lendgame§r. You can link it to a teleporter, and on a click, you are there! Uses a lot of power!",
  "wiki.ic2.preview.potato.desc": "The Potato crop. This one is a bit unique. While requiring a light level of 9 or greater it produces potatoes. But also it has a very small chance to produce poisonous potatoes. Which is actually the more valueable product.",
  "wiki.ic2.preview.precision_wrench.desc": "The Precision Wrench is the final wrench upgrade. It doubles all wrench chances, making it effectively lossless.",
  "wiki.ic2.preview.pressure_alloy_furnace.desc": "The Pressure Alloy Furnace is a multiblock upgrade to its counterpart. It requires to heat-up to process resources faster at 16EU/t.",
  "wiki.ic2.preview.pressure_pipe.desc": "The High Pressure Pipe is your long distance pipe if 20 strength isn't enough. It increases it to 100 Strength.",
  "wiki.ic2.preview.progress_card.desc": "The Progress Card shows the current progress of a machines operation.",
  "wiki.ic2.preview.protective_module.desc": "Poisons are annoying. Luckily the Protective Module gets rid of them pretty quickly, though at a cost.",
  "wiki.ic2.preview.provider_tube.desc": "The Logistic Provider Tube that provides items as they are requested by the Logistic Grid. Loads of settings. Priority direction can be set using TubeTool.",
  "wiki.ic2.preview.proximity_booster_pad_upgrade.desc": "The Proximity Booster Upgrade allows to charge not only the item you have in your hand but also the slots directly touching it.",
  "wiki.ic2.preview.pump.desc": "The Pump is a machine that uses EU to suck up the fluids directly below it to transfer them into a fluid container. It uses 1EU/t and has a lot of special interactions.",
  "wiki.ic2.preview.pumpkin.desc": "The Pumpkin crop: it produces pumpkins. Nothing special about it.",
  "wiki.ic2.preview.purple_tulip.desc": "The Purple Tulip produces Purple dye and requires a light level of 12 or more.",
  "wiki.ic2.preview.quarry_scanner.desc": "The Quarry Scanner turns the Miner into a quarry that digs up everything. Not caring about what it actually is that it is digging up.",
  "wiki.ic2.preview.rainbow_flower.desc": "The Rainbow Flower is a very unique flower. It produces all dye types but which one it drops is fully random. Rumors says that it also was able to produce lapis at a very low chance. Though these are just rumors. Also flower rules apply.",
  "wiki.ic2.preview.ranged_pump.desc": "The Ranged Pump is another pump upgrade that allows to pump fluids from a lot further away, thanks to the miners ability. It can not mine. It uses 8EU/t",
  "wiki.ic2.preview.rare_earth_extractor.desc": "Mother's Cubic Shaped Earth hides a lot of rare resources from us, like Aluminium! The Rare Earth Extractor slowly unlocks these for us. At 1EU/t.",
  "wiki.ic2.preview.reactor_card.desc": "The Reactor Card provides you a lot of information about the reactor. From production to time thats left to run the uranium and more",
  "wiki.ic2.preview.reactor_fuel_cell.desc": "The Reactor Fuel Cell is a fuel that has to be charged up by touching the Uranium rod. It absorbs Isotopes created by it.",
  "wiki.ic2.preview.reactor_planner.desc": "The Reactor Planner is a simulator that allows you to safely test your reactor setups without getting nuked. It uses 100EU/t to simulate the reactor design.",
  "wiki.ic2.preview.recycler.desc": "The Recycler is used to eliminate all the unwanted items lying around a base. While slower then a lava pool, it can produce scrap which can be used later. At 1EU/t.",
  "wiki.ic2.preview.red_mushroom.desc": "The Red Mushroom is the prettier one of the two. But don't say that to the brown mushroom. It produces red mushrooms and requires any humidity to grow.",
  "wiki.ic2.preview.red_tulip.desc": "Red tulip is basically a poppy clone. That sums it up.",
  "wiki.ic2.preview.red_wheat.desc": "Redwheat is just a shy wheat. It doesn't like brightness (between 5 and 12). Its product is redstone dust so its really valuable. It can also produce seeds if it is set to the mode.",
  "wiki.ic2.preview.redirector_master.desc": "The Redirector Master is a really unique block. It can split power up to its slaves based on a percentage. Allowing to take power distribution into your own hands.",
  "wiki.ic2.preview.redirector_slave.desc": "The Redirector Slave accepts power from its Master and attempts to distribute it. If it can not do that then the future packets will be temporary split over other slaves.",
  "wiki.ic2.preview.redstone_tube.desc": "The Redstone Tube emits a redstone signal every time a item flows through it, and once it has no longer items in it the signal goes away.",
  "wiki.ic2.preview.refinery.desc": "The Refinery lets you process resources into better quality resources. Mixing items and fluids together as needed. Increasing ore yields or producing high quality fuel.",
  "wiki.ic2.preview.reflector.desc": "The Neutron Reflector makes uranium more efficient while causing more heat by reflecting neutrons back into the source.",
  "wiki.ic2.preview.reinforced.glass": "Reinforced Glass",
  "wiki.ic2.preview.reinforced.glass.desc": "The Reinforced Glass is extra stable glass that can resist explosions. It is slightly weaker then it's stone counterpart.",
  "wiki.ic2.preview.reinforced.stone": "Reinforced Stone",
  "wiki.ic2.preview.reinforced.stone.desc": "The Reinforced Stone is stronger then obsidian and with multiple layers it can hold a nuke explosion in!",
  "wiki.ic2.preview.reinforced_door.desc": "The Reinforced Door is an extremely protective against explosions. So in short it's a safe door!",
  "wiki.ic2.preview.request_tube.desc": "The Requester Tube allows items to be requested from connected Provider Tubes. It has loads of settings, for example color coding, that can be looked into.",
  "wiki.ic2.preview.restoring_fertilizer.desc": "This fertilizer repairs the crop from its nuclear counterpart since its dead afterwards. Neither can be used twice.",
  "wiki.ic2.preview.rock_cutter_drill.desc": "The Jack-Hammer is a specialized drill that Greg invented. It was optimized against stones and obsidian and nothing else. Mining a stack of Obsidian was never so satisfying!",
  "wiki.ic2.preview.rocket_miner.desc": "The Rocket Miner is a flying miner that searches for new locations to dig for. On top of that you can give it a refuel station and a way to get rid of garbage.",
  "wiki.ic2.preview.rotary_macerator.desc": "The Rotary Macerator is an upgraded Macerator and can smash rocks a lot quicker for 16EU/t, though it requires a constant signal to stay at this fast speed.",
  "wiki.ic2.preview.rotor": "Windmill Rotors",
  "wiki.ic2.preview.rotor.desc": "The Rotors are what you throw into a §<redirect;true;Windmill;ic2:preview.windmill> to make it spin. They only have different durabilities.",
  "wiki.ic2.preview.round_robin_tube.desc": "The Round Robin tube redistributes items to other sides in the desired quantities; stacksize is completely ignored.",
  "wiki.ic2.preview.sapling_acacia.desc": "The Bonsai Acacia Tree is your Acacia log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sapling_birch.desc": "The Bonsai Birch Tree is your Birch log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sapling_dark_oak.desc": "The Bonsai Dark Oak Tree is your Dark Oak log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sapling_jungle.desc": "The Bonsai Jungle Tree is your Jungle log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sapling_oak.desc": "The Bonsai Oak Tree is your Oak log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sapling_spruce.desc": "The Bonsai Spruce Tree is your Spruce log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sawmill.desc": "The Sawmill is a simple machine. It furiously cuts logs into planks for 2EU/t with the ability to get more efficient than the player using §<redirect;true;Sawblade upgrades;ic2:preview.upgrade_efficient_sawblade>. Watch your fingertips!",
  "wiki.ic2.preview.scanner.od": "Ore Density Scanner",
  "wiki.ic2.preview.scanner.od.desc": "The Ore Density Scanner shows you how dense the ores are below you using binary evaluation.",
  "wiki.ic2.preview.scanner.ov": "Ore Value Scanner",
  "wiki.ic2.preview.scanner.ov.desc": "The Ore Value Scanner shows you the total value of the ores below you, evaluating it based on the value of the ores.",
  "wiki.ic2.preview.scrapbox.desc": "The Scrapbox is the unoffical Lootbox of the game. It has a lot of random and rare drops. Just make sure not to mass-produce them...",
  "wiki.ic2.preview.sea_grass.desc": "Sea Grass is your underwater weed that destroys your crops. Since weed can not grow underwater this will spread instead.",
  "wiki.ic2.preview.sea_pickle.desc": "The Sea seems to be in a pickle, well it grows pickles. Sea Pickles are a source of green dye and also emits light underwater. Its a cool light source. It requires a bright area (10 or more) to grow.",
  "wiki.ic2.preview.shields": "Shields",
  "wiki.ic2.preview.shields.desc": "IC2 adds some custom shields to the game that just add variety. The electric one uses electricity instead of durability.",
  "wiki.ic2.preview.simple_crop_library.desc": "The Simple Crop Library is your early access to a more dense crop Storage. It can store up to 20 different crops with 20 mutations and doesn't need power.",
  "wiki.ic2.preview.simple_pipe_pump.desc": "The Simple Pipe Pump is a pump that sends fluids through a pipe grid. It has a strength of 100 blocks and transfers 20mB per tick.",
  "wiki.ic2.preview.simple_tube.desc": "Your basic tube that moves items around. Not much to add. Cheap and does the job.",
  "wiki.ic2.preview.singularity_compressor.desc": "The Singularity Compressor is an upgraded Compressor that uses the power, 16EU/t, to build enough pressure for a singularity.",
  "wiki.ic2.preview.slag_generator.desc": "The Slag Generator is an advanced Generator, increasing its output to a whooping 60EU/t. On top of that, it randomly outputs scrap as a side product.",
  "wiki.ic2.preview.slow_grinder.desc": "The Slow Grinder is a highly efficient Recycler that has a 100% efficiency or less if faster speeds are desired. For 10EU/t.",
  "wiki.ic2.preview.smoker_induction_furnace.desc": "The Induction Smoker is a specialized Induction Furnace that can only smoke foods a lot quicker for 30EU/t. How? Magic! How else?!?!",
  "wiki.ic2.preview.solar_helmet.desc": "The Solar Helmet is your passively portable power source that charges your armor and tools. Will not help underground!",
  "wiki.ic2.preview.solar_panel.desc": "The Solar Panel is a §lFREE POWER§r generator. Granting you 1EU/t during the day. Making use of the seemingly infinite power of the sun. Just make sure to have a backup.",
  "wiki.ic2.preview.solar_panel_compressed.desc": "\"What if I threw my Solar Panel into a Compressor?\". Yeah that's how bad ideas come to life...",
  "wiki.ic2.preview.solar_turbine.desc": "The Solar Turbine is an upgraded solar panel. While provided with water it will produce up to 32EU/t. It will continue to produce as it cools off, maximize it's power.",
  "wiki.ic2.preview.sonar_module.desc": "The Sonar Module is a short/long range scanner that highlights all entities within a range. Might become useful if you search for something. Cool effect included.",
  "wiki.ic2.preview.sound_beacon.desc": "The Sound Beacon is your way to control IC2 sounds. Since they are special, this allows you to create micro pockets of noise reducers/amplifiers. Uses upgrades.",
  "wiki.ic2.preview.speed_boost_module.desc": "The Speed Boost Module makes you go around at the speed of sound. Just don't run into walls.",
  "wiki.ic2.preview.speed_tube.desc": "The Speed Tube makes sure that your items are flowing around fast in your world.",
  "wiki.ic2.preview.splitter_cable_item.desc": "The Splitter Cable. It can be used to be your shut off for a connection via redstone. It deals with 2048EU and has a loss every 2 blocks.",
  "wiki.ic2.preview.splitter_pipe.desc": "The Splitter Pipe is a utility pipe that cuts all connections when it is powered, but reconnects them the moment the redstone signal is gone.",
  "wiki.ic2.preview.stacking_tube.desc": "The Stacking Tube. A directional Tube that consumes all items and stacks them to the desired size. Then outputs them to the desired side.",
  "wiki.ic2.preview.stannum.desc": "Stannum is your flexible tin ore crop. Tin is used practically everwhere. It requires a ore/block of said metal below it to grow, slick and simple.",
  "wiki.ic2.preview.static_boots.desc": "Static Boots are what kids always do when kids find out that carpets can be used to cause shocks. You get a slight EU production for every few blocks you walked.",
  "wiki.ic2.preview.steam_reactor.desc": "The Steam Reactor is the §lUltimate§r §lUpgrade§r to a Reactor. It adds risk, for lot of reward. Energy Production is a lot higher, at the cost of no room for failure.",
  "wiki.ic2.preview.steam_tunnel.desc": "The Steam Tunnel is a multiblock power source producing a whooping 2048EU/t in packets of 512EU for up to 4096mB of Steam. Giving back the water.",
  "wiki.ic2.preview.steam_turbine.desc": "The Steam Turbine is you way to produce EU from steam. It produces 32EU/t from 64mB of steam, without giving water back. Using a §<redirect;true;Fuel Boiler;ic2:preview.fuel_boiler> as source adds 8EU/t.",
  "wiki.ic2.preview.steam_vent.desc": "The Steam Vent uses water from the reactor to create steam. The hotter they are the more efficient they get.",
  "wiki.ic2.preview.step_assist_module.desc": "Everyone loves step assist. Here is the module for it. Though there is a small cost attached to it.",
  "wiki.ic2.preview.stickreed.desc": "Sticky Reeds are the most valuable crop out of all the crops as it produces sticky resin en masse. If you're always out of rubber; this solves all your issues. It is just pretty hard to obtain but no special needs.",
  "wiki.ic2.preview.sticky_dynamite.desc": "Sticky Dynamite is your throw only dynamite that sticks to the first block it touches. Otherwise it works exactly like normal dynamite.",
  "wiki.ic2.preview.sticky_tube.desc": "The Sticky Tube is a real cool tube, it sticks everywhere! Jokes aside it allows you to extract from treetap and buckets on your rubber wood trees! No more flying resin woot!!",
  "wiki.ic2.preview.stone_canner.desc": "The Stone Canner is a food processor, that increases the value of food for using tin cans. These give one food per can but also heal.",
  "wiki.ic2.preview.stone_macerator.desc": "The Stone Macerator is a very primitive Macerator that runs of coal. It is terribly fuel inefficient but allows for early ore doubling.",
  "wiki.ic2.preview.storage_expansion.desc": "The Storage Expansion adds another 18 slots to the Industrial Worktable, plain and simple.",
  "wiki.ic2.preview.su_battery.desc": "The Single Use Battery is a small but useful tool that provides 1000 EU for a bit of redstone and coal. Allowing to quickly get into energy without building generators.",
  "wiki.ic2.preview.sugarcane.desc": "Sugarcane, a very fast growing crop. It produces sugarcane and is the breeding material for sticky reed. Rumors say it grows faster on sand than on dirt. Other rumors say the opposite. Nobody knows which one is true.",
  "wiki.ic2.preview.super_cable_item.desc": "Ahh the Super Cable. Through the power of beer you are able to transfer 8192EU through a 1000 Blocks before any loss occurs. Some may say its still too cheap!",
  "wiki.ic2.preview.sweet_berry_bush.desc": "The Berry Bush is an early game food source that sting you if you are not careful. Outside of that, they do not have any requirements.",
  "wiki.ic2.preview.switch_tube.desc": "The Simple Switch Tube. Does what it says. If it receives a redstone signal, it will simple close all connections until the signal goes away.",
  "wiki.ic2.preview.tank.desc": "The Tank is a modular fluid container that can be build out of a lot of blocks. It can be up to 50x200x50 Blocks. It uses valves to be interacted with.",
  "wiki.ic2.preview.tank_storage_module.desc": "How about we turn your armor into a portable tank? That's what the Tank Storage Module is doing. Nothing fancy.",
  "wiki.ic2.preview.tea.desc": "Tea is for the people who want to chill out. It produces tea leaves which can make various types of tea. Most tea lovers dislike coffee. It requires a light level of 7 or greater to grow.",
  "wiki.ic2.preview.teleport_tube.desc": "The Teleport Tube. It sends/receives items to/from other desired Teleport Tubes. Logistic requests won't be sent through. Works across dimensions.",
  "wiki.ic2.preview.teleporter.desc": "The Teleporter is your long distance teleportation tool, that requires a crazy amount of power. That's why it needs to stay next to power storages.",
  "wiki.ic2.preview.teleporter_hub.desc": "What if you combined a Teleporter and a Base Teleporter? Yes you get the Teleporter Hub! This is basically a \"pick your target\" Teleporter. Uses a lot of power!",
  "wiki.ic2.preview.terraformer.desc": "The world isn't how you want it? You want to change it? The Terraformer comes to the rescue. It has the ability to change the world. For thousands of EU/t.",
  "wiki.ic2.preview.terrawart.desc": "Terrawart is a really useful item. It can be easily obtained by putting a snow block below a netherwart. The snow block also boosts the growth by 50%. An eaten Terrawart removes all the bad potion effects from you.",
  "wiki.ic2.preview.tesla_coil.desc": "The Tesla Coil is a shocker! Literally. It builds up a charge and when any living thing is nearby it releases the charge to shock it to death. Useful for mob grinders.",
  "wiki.ic2.preview.text_card.desc": "The Text Card shows some text you can type in here. Also Tab is supported. (Will be converted into spaces).",
  "wiki.ic2.preview.tfbp.desc": "The Terraformer Blueprint decides how the terraformer works. It is a environment changing blueprint. These are really expensive.",
  "wiki.ic2.preview.tfbp_biome.desc": "The Terraformer Biome Blueprint decides how the terraformer works. It changes the biome you are in. These are also really expensive.",
  "wiki.ic2.preview.tfbp_biome_chilling.desc": "The Chilling Biome TFBP changes the biome to a Snowy Tundra biome.",
  "wiki.ic2.preview.tfbp_biome_cultivation.desc": "The Cultivation Biome TFBP changes the biome to a Plains biome.",
  "wiki.ic2.preview.tfbp_biome_desertification.desc": "The Desertification Biome TFBP changes the biome to a Desert biome.",
  "wiki.ic2.preview.tfbp_biome_forestification.desc": "The Forestification Biome TFBP changes the biome to a Forest biome",
  "wiki.ic2.preview.tfbp_biome_irrigation.desc": "The Irrigation Biome TFBP changes the biome to a Swamp biome",
  "wiki.ic2.preview.tfbp_biome_mushroom.desc": "The Mushroom Biome TFBP changes the biome to a Mushroom Fields biome",
  "wiki.ic2.preview.tfbp_biome_undergrowth.desc": "The Undergrowth Biome TFBP changes the biome to a Jungle biome",
  "wiki.ic2.preview.tfbp_chilling.desc": "The Chilling TFBP creates a winter wonder land.",
  "wiki.ic2.preview.tfbp_cultivation.desc": "The Cultivating TFBP turns your area into a plains field with crops and flowers growing.",
  "wiki.ic2.preview.tfbp_desertification.desc": "The Desertification TFBP turns the area into a desert.",
  "wiki.ic2.preview.tfbp_flatification.desc": "The Flatification TFBP flattens the area around itself to the terraformers y level. By either filling missing blocks in or removing blocks.",
  "wiki.ic2.preview.tfbp_irrigation.desc": "The Irrigation TFBP turns your area into a rain forest.",
  "wiki.ic2.preview.tfbp_mushroom.desc": "The Mushroom TFBP turns your area into a mushroom island. Including stacking mushrooms!",
  "wiki.ic2.preview.thermal_generator.desc": "The Thermal Generator is an upgraded Geothermal Generator. Producing 90EU/t, fuel lasts 50% longer. It also produces passive power based on the area's temperature.",
  "wiki.ic2.preview.thermometer.desc": "The Thermometer is your tool for reactors. It allows you to see how hot a reactor is at that moment. Which can be vital information.",
  "wiki.ic2.preview.time_card.desc": "The Time Card. It shows the Game time, Server time, your time and the Galaxy time... Wait not that one. But it shows time.",
  "wiki.ic2.preview.tin_cable_item.desc": "The Tin Cable. It is a really cheap but weak energy conductor. It can handle only 5EU but you are lossless for 40 Blocks. Ideal for solar farms or water mills!",
  "wiki.ic2.preview.tool_box.desc": "Toolboxes are your portable inventory for the tools/food that you don't use so often but still need. It comes in various sizes.",
  "wiki.ic2.preview.tools.aluminium": "Aluminium Tools",
  "wiki.ic2.preview.tools.aluminium.desc": "Aluminium Tools are right between Diamond and Iron. Less durability but faster, but deals less damage.",
  "wiki.ic2.preview.tools.bronze": "Bronze Tools",
  "wiki.ic2.preview.tools.bronze.desc": "Bronze Tools are slightly more durable then their iron counterpart. It is just another set of useful early game tools.",
  "wiki.ic2.preview.trade_o_mat.desc": "The Trade-O-Mat is allows items to be traded for other items or coins. It requires a Personal Chest to be connected. Allows automated Trading.",
  "wiki.ic2.preview.transformer": "Transformer",
  "wiki.ic2.preview.transformer.desc": "The Transformer allows you to control packet energy that flows through the grid. 1 big packet turn into 4 smaller packets.",
  "wiki.ic2.preview.transformer_adjustable.desc": "The Adjustable Transformer is a fully customizable transformer. It can not be inverted but can produce up to 32 of any sized packets.",
  "wiki.ic2.preview.transport_tube.desc": "The Transport Tube only connects to other tubes. Inventories will be ignored.",
  "wiki.ic2.preview.tree_tap.desc": "The Treetap is your tool to extract sticky resin from rubbertrees. Just be careful not to overtap the trees.",
  "wiki.ic2.preview.treetap_and_bucket.desc": "The Treetap & Bucket is a very useful utility block that you can attach to rubbertrees in order to auto harvest them. They store 5 resin and speed up resin growth.",
  "wiki.ic2.preview.tube_coral.desc": "The Tube Coral is a underwater crop that can be used to grow coral blocks. It has a chance to produce all variants of tube corals. That is under the assumtion its alive. It requires clean water (3 or more) to grow.",
  "wiki.ic2.preview.tube_tool.desc": "The TubeTool is your configurator of some tube features. These features expand the control over tube actions massively",
  "wiki.ic2.preview.upgrade.kit.pad": "Charge Pad Upgrade Kits",
  "wiki.ic2.preview.upgrade.kit.pad.desc": "Charge Pad Upgrade Kits allows to upgrade chargepads without replacing them.",
  "wiki.ic2.preview.upgrade.kit.storage": "Energy Storage Upgrade Kits",
  "wiki.ic2.preview.upgrade.kit.storage.desc": "Storage Upgrade Kits allow you to upgrade your previous energy storage to the new tier you desire.",
  "wiki.ic2.preview.upgrade_basic_fluid_export.desc": "The Simple Fluid Export Upgrade basically pushes out 100mB per tick out of a machine. Can be stacked up to 9 items.",
  "wiki.ic2.preview.upgrade_basic_fluid_import.desc": "The Simple Fluid Import Upgrade basically pulls in 100mB per tick from a fluid tank. Can be stacked up to 9 items.",
  "wiki.ic2.preview.upgrade_cobble_generator.desc": "The Cobblegen Upgrade produces cobblestone into the machines input at 1 item per second. It is stackable.",
  "wiki.ic2.preview.upgrade_container.desc": "The Upgrade Container is basically an upgrade expansion. It has 3 upgrade slots that a machine can make use of. Though invalid upgrades are disabled.",
  "wiki.ic2.preview.upgrade_crafting.desc": "The Crafting Upgrade crafts items together and exports them into a connected inventory. Crafting speed is dynamic based on how fast the inventory provides the items.",
  "wiki.ic2.preview.upgrade_creative.desc": "Creative Upgrade is for Creative-use only. Provides Power/Tier/Speed Upgrade.",
  "wiki.ic2.preview.upgrade_durable_sawblade.desc": "The Durable Sawblade is a sawmill only upgrade. The machine gets +400% speed and outputs are increased by 2 items for the cost of +2EU/t",
  "wiki.ic2.preview.upgrade_efficiency.desc": "The Efficiency Upgrade makes machines much more efficient. Energy consumption is reduced by 5%. Multiple stacks are accepted in every machine.",
  "wiki.ic2.preview.upgrade_efficient_sawblade.desc": "The Efficient Sawblade is a sawmill-only upgrade. The machine gets a +200% speed and ouputs are increased by 4 items for the cost of +1EU/t",
  "wiki.ic2.preview.upgrade_energy_storage.desc": "The Energy Storage Upgrade expands the internal buffer by +10000EU.",
  "wiki.ic2.preview.upgrade_energy_storage_multiplier.desc": "§The Energy Storage Multiplier upgrade doubles the current internal energy buffer.",
  "wiki.ic2.preview.upgrade_exp_collector.desc": "The Experience Collector Upgrade collects extra EXP out of machines. It has a cap of 5000XP storage and has a efficiency of 50% collecting it.",
  "wiki.ic2.preview.upgrade_export.desc": "The Export Upgrade is an advanced IO upgrade. It can be filtered and it uses EU to push out a lot more items at once",
  "wiki.ic2.preview.upgrade_field_upgrade": "Field Expansion Upgrade",
  "wiki.ic2.preview.upgrade_field_upgrade.desc": "The Field Expansion Upgrade enlarges the charging range of the chargepad.",
  "wiki.ic2.preview.upgrade_fluid_export.desc": "The Fluid Export Upgrade is an advanced IO upgrade. It can be filtered and uses EU to push out the 10x of its simpler variant.",
  "wiki.ic2.preview.upgrade_fluid_import.desc": "The Fluid Import Upgrade is an advanced IO upgrade. It can be filtered and uses EU to push out the 10x of its simpler variant.",
  "wiki.ic2.preview.upgrade_import.desc": "The Import Upgrade is an advanced IO upgrade. It can be filtered and it uses EU to pull in a lot more items at once",
  "wiki.ic2.preview.upgrade_loudness.desc": "The Loudness Upgrade makes a machine louder. If it is at max audio strength then it will be heard further away.",
  "wiki.ic2.preview.upgrade_muffler.desc": "The Muffler Upgrade makes a machine quieter. That way it can still be heard but less annoying.",
  "wiki.ic2.preview.upgrade_mute.desc": "The Mute Upgrade straight out disables the audio of a machine.",
  "wiki.ic2.preview.upgrade_overclocker.desc": "The Overclocker Upgrade makes a machine much faster then before. It provides a 30% speed boost for 60% more energy usage.",
  "wiki.ic2.preview.upgrade_quantum_overclocker.desc": "The Quantum Overclocker Upgrade is a endgame upgrade. It makes the machine 60% faster for 30% power usage increase.",
  "wiki.ic2.preview.upgrade_redstone_inverter.desc": "The Redstone Inverter Upgrade inverts the redstone requirements. If a strong signal is required then a low is now required.",
  "wiki.ic2.preview.upgrade_redstone_sensitivity.desc": "The redstone Sensitivity Upgrade toggles if the machine has any redstone requirements. Providing a lot more control.",
  "wiki.ic2.preview.upgrade_simple_export.desc": "Simple Export Upgrade pushes items slowly out of the machine. 1 Item per second/operation. This can be stacked up to 9 items.",
  "wiki.ic2.preview.upgrade_simple_import.desc": "Simple Import Upgrade pulls items slowly into the machine. 1 Item per second/operation. This can be stacked up to 9 items.",
  "wiki.ic2.preview.upgrade_slowness.desc": "The Slowness upgrade is really underused upgrade. It halves the production speed of a machine and reduces power requirements by 40%",
  "wiki.ic2.preview.upgrade_transformer.desc": "The Transformer Upgrade levels up the machines maximum power tier it can accept.",
  "wiki.ic2.preview.uranium_enricher.desc": "The Uranium Enricher is a machine that combines Uran with exotic materials and 250EU/t to create very weird variants of Uran. These make life more interesting.",
  "wiki.ic2.preview.uranium_rod_blaze_single.desc": "The Blaze Uranium Rod. It produces an abnormal amount of heat. Useful for steam reactors.",
  "wiki.ic2.preview.uranium_rod_charcoal_single.desc": "Charcoal Uranium Rod. The long lasting but slow producing fuel. Really good for long lasting setups.",
  "wiki.ic2.preview.uranium_rod_ender_pearl_single.desc": "Ender Uranium Rod. It has a further reach on areas it can affect.",
  "wiki.ic2.preview.uranium_rod_isotopic.desc": "Isotopic Rods are rods that are ready to be re-enriched in the reactor.",
  "wiki.ic2.preview.uranium_rod_near_depleted.desc": "Near Depleted cells are a waste product of uranium rods. Can be relit to full uranium.",
  "wiki.ic2.preview.uranium_rod_nether_star_single.desc": "NetherStar Rod. Produce a ton of power and heat. Hard to master!",
  "wiki.ic2.preview.uranium_rod_re_enriched.desc": "Reenriched Uranium Rods are breed uranium that can be used used in the reactor.",
  "wiki.ic2.preview.uranium_rod_redstone_single.desc": "The Redstone Uranium Rod is very pulsing. Produces 2x the amount of isotopes. Runs slightly hotter.",
  "wiki.ic2.preview.uranium_rod_single.desc": "The Uranium Rod very basic. Produce the default amount of power. Nothing special.",
  "wiki.ic2.preview.uu_crop_library.desc": "The UU-Crop Library is an upgraded Crop Library that has the ability to create already known crop mutations from UU-Matter and energy. It is not cheap!",
  "wiki.ic2.preview.uu_expansion.desc": "The Matter Expansion allows you to make use of UU Matter more efficiently. It also provides resources that may not be craftable otherwise. 9 can be chosen from.",
  "wiki.ic2.preview.vacuum_canner.desc": "The Vacuum Canner is a high speed canner that creates a vacuum to package more resources and package them faster. It uses 16EU/t.",
  "wiki.ic2.preview.valve.desc": "A simple multipurpose valve that allows external interaction with the multiblocks tanks. Can be used with the Obscurator.",
  "wiki.ic2.preview.valve_animated.desc": "The Animated Valve is a small visual upgrade to the Valve. It shows the flow into a Tank and what flows in.",
  "wiki.ic2.preview.valve_pushing.desc": "The Pushing Valve is an upgrade to the normal valve where it automatically pumps out fluids. It can also work with the pipe grid.",
  "wiki.ic2.preview.valve_teleporting.desc": "The Teleporting Valve is a valve that links from 1 tank to another using a §<redirect;true;Link;ic2:preview.frequency_transmitter>. A wrench can set it to emit mode. Emitting 100mB/t of its content to another tank!",
  "wiki.ic2.preview.venomilia.desc": "The Venomilia is a tricky purple flower. If you harvest it to late, it turns poisonous and stings you when you walk through it or harvest it not carefull but it is a great source of Grin Powder.\nIt is only poisenious and Grin Powder producing when almost fully grown.",
  "wiki.ic2.preview.villager_o_mat.desc": "The Villager-O-Mat is an Auto Trader, that uses identity theft to trade as you! Sounds bad but its actually really good! It can bulk trade for you as you!",
  "wiki.ic2.preview.void_tube.desc": "The Void Tube. Void.... Void.... Void.... Yeah don't say \"that\" word to often. Anyhow. It deletes the incoming items by throwing them into the void. Void... Void... Void... Darnit!",
  "wiki.ic2.preview.warped_fungus.desc": "The Warped Fungus is your other nether wood producing mushroom. The crop produces the mushrooms and is required to be completly dry to grow.",
  "wiki.ic2.preview.water_mill.desc": "The Watermill is a passive/fuel generator. Producing a whooping 0.25EU/t (passive) or 1EU/t (active). It needs to be submerged under water to produce.",
  "wiki.ic2.preview.water_walker_module.desc": "The Water Walking Module lets you walk on water. Using electromagnetic fields to stabilize the fluid underneath you. I think at least...",
  "wiki.ic2.preview.wave_generator.desc": "The Wave Generator is a powerhouse of a Generator. Producing a fluctuating 16.5EU/t. But it requires 50 water blocks in a line.",
  "wiki.ic2.preview.weedex.desc": "Weed-ex is your safeguard against weeds. As long a crop has weed-ex, weeds cannot spawn. Though if it's applied more then once, chance is that stats will go down.",
  "wiki.ic2.preview.wet_cfoam.desc": "Wet Cfoam. Your entry drug into the CFoam Empire! It can be used to copy Textures, hide cable/tube/pipe blocks and be decorative! Dries over time or instant using Sand.",
  "wiki.ic2.preview.wheat.desc": "Wheat is your standard wheat that requires a light level of 9 or greater to grow. It also can produce seeds.",
  "wiki.ic2.preview.white_tulip.desc": "The White Tulip is part of the flower family. So flower conditions apply. It does not produce white dye but light gray dye instead.",
  "wiki.ic2.preview.wide_band_booster_pad_upgrade.desc": "The Wideband Upgrade makes the chargepad charge your entire hotbar instead of only the held item.",
  "wiki.ic2.preview.wind_turbine.desc": "The Wind Turbine is your atmospheric power producer. Creating up to 16EU/t, depending on air movement. It needs free space but doesn't care about height.",
  "wiki.ic2.preview.windmill.desc": "The Windmill is an advanced Wind Turbine. It requires rotors to run and produces up to 256EU/t. Though this depends on wind speed in the area.",
  "wiki.ic2.preview.wood_gassifier.desc": "The Wood Gassificator is a machine that burns fuel and logs into charcoal and woodgas for extra energy production in the Liquid Fuel Generator.",
  "wiki.ic2.preview.wrench.desc": "The Wrench is your tool to get rid of machines without losing them. But it is not perfect so it might still lose machines. Everyone loves that feature! Right?",
  "wiki.ic2.subpage.brewing.body": "So you have seen the brewing products and wonder how brewing works.\n\nBrewing is fairly simple, but it takes a lot of time.\nWhich is the whole point of this block. To eat time.\nWhich while boring allows you to do other projects in the meantime.§<newPage>§<header;Overview;true>\nTo create a barrel you simply craft one and place it on a wooden scaffold.\nAnd when your brew is done you just open it with a §<redirect;true;TreeTap;ic2:preview.tree_tap>.\nIt's that simple.\n\nThere are 4 brewing Modes:\n- Rum Brewing\n- Beer Brewing\n- Whisky Brewing\n- Potion Brewing§<newPage>§<header;Rum Brewing;true>\nBrewing Rum is one of the easiest one.\nJust throw in Sugar Cane and wait for it to finish and its ready to drink!\n\nIt's rather quick too, a few mins at max, compared to the other options.§<newPage>§<header;Beer Brewing;true>\nBrewing beer is rather simple,\nYou throw in Hops, Wheat and Water and wait a bunch.\nWhich you can throw 32 each of in.\n\n- The ratio between Hops and Wheat decide how strong the alcohol level is going to be,\n\n- While the ratio between Wheat and Water decides how Solid the drink is.\n- And water decides the yield.\n\nThe alcohol level decides the effects you get,\nwhile the duration is decided by the solid ratio,\nand the strength is decided by the brewing quality.\n\nThe best brew quality takes 8 hours.\nWhile after 10 days the brew turns bad.§<newPage>§<header;Whisky Brewing;true>\nWhisky is almost as easy as Rum Brewing.\nYou throw in Whisky Grist and Water and wait....\nFor a long time!\nEvery IRL day is worth 1.4 Years. So a week is worth 10 years.\nWhen taping the barrel the year count gets rounded down to the closest brew step.\nSo this one can not turn bad.§<newPage>§<header;Shaky Effect;true>\nDrinking Whisky causes you to get drunk.\nAnd what does that usually entail? \nWalking straight becomes impossible.\n\nThis is where the Shaky Effect comes into play.§<newPage>§<header;Shaky Effects;true>\nWhile it doesn't affect your movement, it instead affects your ability to be hit by projectil's.\nBasically shaking your body so much that \"Drunk Foo\" becomes a viable option.§<newPage>§<header;Potion Brewing;true>\nPotion Brewing is rather simple too.\n\nIt works like a normal potion stand, but instead of brewing 1 step at a time.\nYou use the ingredients to setup what you want to make and then let it bulk process all steps at once.\n\n\n\n\nSo for example for a Fire Resistance Potion you throw in:\nNetherwart, Magma Cream and Water\nThe water then starts the brewing.\n\nBeforehand you can throw in up to 20 redstone or glowstone.\n- §lRedstone§r: Increasing the duration of the potion. Up to 30 minutes.\n\n\n- §lGlowstone§r: Increasing the potency of the potion. Up to level 3.\n \nThough keep in mind potency cuts per extra level the duration in half. \n\nThe Quality of the brew decides how much of the duration/potency actually gets applied.§<newPage>§<header;Potion Brew Yields;true>\nThe best quality brew takes roughly 4 hours.\n\nThe biggest batch you can brew at once is 12 potions at once, or 120 tipped arrows.\n\nWhich will last long enough until the next brew is done.§<newPage>§<header;Potion Overbrewing;true>\nNote that after 20 hours of total brew time the potion turns bad and instead turns into a instant damage 4 cloud when you open the barrel.\nSo don't leave it unattended for to long.\n\nBut that covers Potions!",
  "wiki.ic2.subpage.brewing.head": "Brewing",
  "wiki.ic2.subpage.chunkloader.body": "The Chunkloader is simple to use, but requires power to run.\n\nIt comes with 4 different range Setting of:\n\n§l0§r:Local Chunk:5EU/t\n§l1§r:Local Chunk + 1 Chunk Radius:15EU/t\n§l2§r:Local Chunk + 2 Chunks Radius:60EU/t\n§l3§r:Local Chunk + 3 Chunks Radius:300EU/t",
  "wiki.ic2.subpage.chunkloader.body2": "The Chunkloader keeps all entities and tile-entities loaded within the area.\n\nThere is then the option to enable 'Chunk Ticks'.\n\nWhich will enable the random ticks within the chunks, so things like crops can grow.\nHowever the EU/t costs are doubled.",
  "wiki.ic2.subpage.chunkloader.head": "Chunkloader",
  "wiki.ic2.subpage.colossal_machine.body": "The Colossal Machine is a dynamic machine that can be build either as 2x2x2 or 3x3x3 or 4x4x4 structure.\n\nWith the master block being at the top left based on the face.\n\nEach upgrade doubles the capacity of slots of the previous one. It consumes 25mB of water per operation and produces steam as a waste product.",
  "wiki.ic2.subpage.colossal_machine.compressor": "Colossal Compressor",
  "wiki.ic2.subpage.colossal_machine.extractor": "Colossal Extractor",
  "wiki.ic2.subpage.colossal_machine.furnace": "Colossal Furnace",
  "wiki.ic2.subpage.colossal_machine.macerator": "Colossal Macerator",
  "wiki.ic2.subpage.colossal_machine.recycler": "Colossal Recycler",
  "wiki.ic2.subpage.crop.body": "IC2Classic comes with a crop system.\nYou can grow, crossbreed, and harvest crops as you wish.\n\nUnlike its vanilla part, IC2 crops do not rely on the random tick system of minecraft.\nBut they have a consistent tickrate.§<newPage>§<header;Crop Stat;true>\nCrops grow every 256 ticks (12.8s).\nBy how much is determined by a lot of factors and a tiny bit of randomness.\n\nIC2 Crops can also be placed underwater.\nThough some crops may or may not survive the underwater treatment.\nWhile others do not like the fresh air.§<newPage>§<header;Crop Stats;true>\nSo what stats do crops actually have? §<image;ic2:textures/wiki/crops/stats.png;33;20;78>\n§<padding;2>\n- §lGrowth§r: Increases Grow Rate\n- §lGain§r: Extra Yields\n- §lResistance§r: Increases Protection\n\nAll these 3 stats can go between 0-31, the higher the stats the more care the crops need.§<newPage>§<header;Stat Warning;true>\nYour main goal is to get stats higher, but keeping them below 24.\nIf you go above 24 to each stat there is a major downside that could ruin your crop field.\nAlso if the stats are to high and the care isn't enough crops could also die from starvation.\nSo if you breed higher stats watch out if the crop actually can grow without extra care.§<newPage>§<header;Growth Stat;true>\nThe §lGrowth Stat§r increases growth rate of the crop.\nMeaning that each crop tick the growth increases a lot more then without having this stat high.\n\nWhen the stat reaches level 24 the crop turns \"Weed Like\".\nWhile it will not self-destruct it will attack other crops that are not \"Weed Like\".§<newPage>§<header;Gain Stat;true>\nThe §lGain Stat§r increases Harvest Yields.\nThis can be massive when manual harvested where a few crops can give stacks of drops.\nAutomated Harvest will not gain such a massive yield increase but still increase yields substantially.\n\nWhen the stat reaches 24 or higher it will reduce the chance of extra seed bags.§<newPage>§<header;Resistance Stat;true>\nThe §lResistance Stat§r increases the strength against weed.\nAt level 31 it can no longer be taken over by weed.\n\nBut when the stat goes above 28 it reduces the chance of it partaking in crossbreeding.§<newPage>§<header;Crop Boosters;true>\nCrops are affected by the Environment §<image;ic2:textures/wiki/crops/environment.png;33;20;78>\n§<padding;2>\nThese 3 stats boost the crop growth rate massively and ensure it doesn't starve.\nEach biome provides a few boni/downsides depending from where you are.§<newPage>§<header;Crop Boosters;true>\nFor example the nether is horrible for Humidity, while the oceans do wonders for it.\n\nThe rule of thumb is the higher the better.§<newPage>§<header;Nutrients / Humidity;true>\nNutrients and Humidity are both affected by the Farmland / SubSoil below it.\nAnd can be each boosted with based on which biome they are in or with Fertilizer or Hydration.§<newPage>§<header;Environment;true>\nCrops also need a healthy Environment to grow faster.\nThere is 3 factors to increase Environment Quality.\n- §lSkylight Access§r\n- §lSpace§r: Having no solid blocks or Crops around itself.\n- §lHeight§r: Up to a certain point higher Altitudes help with the quality of the Environment.§<newPage>§<header;Underwater Environment;true>\nUnderwater crops also need a good Environment.\nWhich is a bit trickier to create.\nThere is a few ways to increase it.\n- §lClay§r: Having clay in the surrounding soil increases it slightly.\n- §lPurifying Crops§r: Some crops clean the water around itself.\n- §lBubble Columns§r: Provides a nice Environment.§<newPage>§<header;Crop Breeding;true>\nCropBreeding is the Heart of the Crop System.\n\nAnd it can be rather straight forward.\nPut 2-4 crops around the crop stick you want to breed on and place another set of cropsticks on it.\nYou can not guarantee that more then 2 crops are used in the breeding process but 2 are used at the very least.§<newPage>§<header;Crop Breeding;true>",
  "wiki.ic2.subpage.crop.breeding": "So how does breeding work? It is rather simple! Almost every combo can result into anything§<newPage>§<header;Crop Breeding;true>\nBut how is the result decided?\n\nIt is based on a point system.\nPoints are generated based on how many traits Crops share or how close the traits are in relation to each other.\nThe sum of these points is calculated together with all parent crops and then one is randomly picked from.\nWith 1 override though. If the parent crop is equal to the crop that could be picked it gets a flat 500 point buff.\nMaking it much more likely.\n\nThe §<redirect;true;Crop Analyzer;ic2:preview.crop_analyzer> can simulate examples and show potential results.\n\nOutside of that its random luck what is picked.§<newPage>§<header;Stat Breeding;true>\nNow whenever you bred a crop it will also change the stats.\nHow that is done also rather simple.\n\nIt takes the sum of the parent stats, each stat individually, and divides it by the parent count.\nThats your average stat.§<newPage>§<header;Stat Breeding;true>\nThen some fluctuation is added where randomly 2 stat points in either direction are applied, per parent present.\nSo you can lose or gain stats via crop breeding.§<newPage>§<header;Crop Copying;true>\nNow getting large amount of seeds is really difficult and annoying.\nSo you can copy crops rather simple too.\n\nBasically if the breeding stick has only 1 possible parent to breed with it will instead clone the parent crop.\nNo stat changes no crop changes a straight out clone.§<newPage>§<header;Weed Ex;true>\n§<redirect;true;Weed Ex;ic2:preview.weed_ex> is protecting your crops from getting destroyed by weed.\nBut with everything nice, over usage can hurt the crops. The stats specifically.\nSo rule of thumb is, only use it once or when the weedex is almost empty.§<newPage>§<header;Crop Analyzer;true>\nYou can scan crops by Sneak Clicking it with a §<redirect;true;Crop Analyzer;ic2:preview.crop_analyzer>\n\nIn General when having a Crop Analyzer in your hotbar a lot more information is shown in the One Probe for you!§<newPage>§<header;Farmland / Subsoil!;true>",
  "wiki.ic2.subpage.crop.head": "Crops",
  "wiki.ic2.subpage.crop.subsoil": "So what are farmland and Subsoils?§<newPage>§<header;Farmland / SubSoil;true>\nThe Farmland block is the block directly underneath the crop,\nwhile the SubSoil block is the 3 blocks directly underneath the Farmland.\nYou can search Via JEI after \"Farmland\" or \"SubSoil\" and find all the blocks that are considered as such.\n\nSome crops require special blocks.\nThese are 1 block below the SubSoil.",
  "wiki.ic2.subpage.crop_analyzer.body": "The Crop Analyzer is your mobile tool to analyze your crops.\n\nYou can either sneak click on a crop to scan it while it is planted or you can throw the item into its internal inventory to scan it.\nEach full scan takes 10.000 EU. This is done through multiplie steps that unvail some of the data each.\n\nOn top of that the Crop Analyzer can be toggled into breeding mode which allows you to simulate crop breeding.\n\n\nAt the top of the GUI you select the crops you want to use and then click the Breed button.\nThe results of what potentionally can come out will show up.\nSmall Caviat to add: Only 2 crops are fully accurate because you have no real control how many crops are included in a breeding result.\nSince it is random which crop is willing to breed.",
  "wiki.ic2.subpage.crop_analyzer.head": "Crop Analyzer",
  "wiki.ic2.subpage.crop_harvester.body": "The Crop Harvester is your way of automatically harvesting your IC2 crops.\n\nIt automatically picks crops when they are fully grown. Note that it will result into less products vs manual harvests.\nIts range can be between from 3x3x3 to 11x11x11 using Field Expansion upgrades. The machine is in the center of this cubic box.\n\nIt can be also upgraded using Overclockers to let it harvest crops a lot quicker.",
  "wiki.ic2.subpage.crop_harvester.head": "Crop Harvest",
  "wiki.ic2.subpage.crop_library.body": "The Crop Library is a significant upgrade to its simple counterpart.\n\nIt has a unlimited crop type and mutation storage but it requires EU to be accessed and modified.\nIt takes roughly 1EU passive drain to be able to see the crops and 5 EU to insert a anysize crop.\nLike the counter parts it only accepts fully analyzed seeds.\nThough its real downside is that all crops are lost if you break the library. So make sure to empty it before moving it.\n\nThat is the price for a unlimited storage",
  "wiki.ic2.subpage.crop_library.head": "Crop Library",
  "wiki.ic2.subpage.cropmatron.body": "The Cropmatron is the tool you want with your IC2 Crops.\n\nIt automates the applying hydration/fertilization/weed-exing of your crops.\nThough not as efficient in how much you get out of these items over time it is overall worth it.\nIts full coverage is 9x5x9 which it has to be in the center of.\n\nWater can be pumped into the Cropmatron to give 2 real upsides to the machine.\nFirst the Cropmatron becomes waterlogged and makes sure farmland stays wet for 1mB Water a tick.\nSecond is that Hydration cells are automatically refilled by it using the water in the Cropmatrons tank.",
  "wiki.ic2.subpage.cropmatron.head": "Cropmatron",
  "wiki.ic2.subpage.early_game.body": "So you finished your resource gathering trips, maybe even died like +10 times on the way,\nand feel ready to dive into the IC2 Mod.\n\nMaybe you even already crafted the stone machines to process your ores more efficiently.§<newPage>§<header;How to start?;true>\nA Typical dive into IC2Classic starts with the following things:\n- §<redirect;true;Generator;ic2:preview.generator> \n- §<redirect;true;Extractor;ic2:preview.extractor> \n- §<redirect;true;Macerator;ic2:preview.macerator> \n- §<redirect;true;Electric Furnace;ic2:preview.electric_furnace> \n- §<redirect;true;Cables;ic2:preview.copper_cable_item> \nA Ideal Setup could look like this:§<image;ic2:textures/wiki/early_setup.png;60;5;108>§<newPage>§<header;Ideal Setup;true>\nWhile that is the ideal setup, it isn't perfect.\nSince the generator doesn't preserve fuel efficiently,\na §<redirect;true;Batbox;ic2:preview.batbox> might be a good addition.\nAllowing for better fuel efficiency.§<image;ic2:textures/wiki/early_setup_storage.png;60;5;108>§<newPage>§<header;Ideal Setup;true>\nWith a Small Setup you can process your resources more efficiently.\nThe Macerator/Extractor cause more yield out of resources,\nwhile the Generator/Electric Furnace make the fuel more efficient.\n\nOn the next page you find a list of Shiny things you might be interested in.§<newPage>§<header;Shiny Targets!;true>",
  "wiki.ic2.subpage.early_game.head": "Early Game",
  "wiki.ic2.subpage.early_game.list": "This list contains targets where you could go to.§<newPage>§<header;Shiny Tools!;true>\n- The §<redirect;true;Wrench;ic2:preview.wrench> allows you to pickup machines without destorying them, most of the time.\n- The §<redirect;true;Mining Drill;ic2:preview.drill> gives you access to a infinite pickaxe, as long as you feed it power.\n- The §<redirect;true;Chainsaw;ic2:preview.chainsaw> is your weapon of choice?!!!!!\n- The §<redirect;true;Mowing Tool;ic2:preview.mowing_tool> gets rid of all these PESKY LEAVES!\n- And the §<redirect;true;Toolbox;ic2:preview.tool_box> is storing all your tools.",
  "wiki.ic2.subpage.electric_enchanter.body": "The Electric Enchanter is a fusion of the enchantment table, anvil, disenchanter, and the Power of EU!\n\nIt is the only way you can enchant the electric tools of EU.\nBut it is in general also a really powerful enchanter.\n\nThe Enchanter has a few modes.§<newPage>§<header;Enchanting Mode;true>\nThe Enchanting Mode is basically your normal enchantment table\nbut instead of randomly rolling, it shows you exactly what you would get\nand it uses EU to reduce the XP cost required.\n\nEnchanted tools can be rerolled with it too at a higher cost than normal enchanting.\nThe book slots at the top decide how many enchantments you get and how potent these enchantments are.\nIf there is enchanted books inside of these slots they will be prioritized and the rest will be applied afterwards.\nYou get 2 Enchantments per book slot. If there is enough enchantments to choose from.\nLapis is ofc also required.§<newPage>§<header;Anvil Mode;true>\nAnvil Mode is your classic anvil, just with a reduced XP cost and the ability to enchant Electric items.\nItems like the §<redirect;true;Mining Laser;ic2:preview.mining_laser> can be really usefull since the enchants will work in the §<redirect;true;Miner;ic2:preview.miner> too.\nThough the mining laser itself won't work directly with enchants.§<newPage>§<header;Disenchant Mode;true>\nThe Disenchant Mode is really simple too.\nPut item to disenchant in the center slot.\nProvide books & XP\nWIN!\n\nand it takesthe top enchantment of said item and move it into a dedicated book.",
  "wiki.ic2.subpage.electric_enchanter.head": "Electric Enchanter",
  "wiki.ic2.subpage.electricity.body": "IC2Classic has a form of electricity named EU. (Energy Units)\n\nEU is created in generators and moved over cables to machines you want to run. It's what powers the entire mod.\n\nEU is a very simple form of power, but it doesn't allow you to let your guard down.\nLets start with the generators.§<newPage>§<header;Generators;true>\nGenerators are fairly simple.\nThey use fuel and produce power.\nA normal generator for example produces 10EU/tick.\nThat power then gets automatically emitted as an energy packet.\n\nWhat is an energy packet?\nThat gets explained later.§<newPage>§<header;Electric Machines;true>\nElectric machines are things that use EU to do things.\nFor example the Macerator (Machine) uses energy to turn cobblestone into sand.\n\nA machine can accept energy depending on its tier.\nWith our Macerator example, it can accept 32EU per packet.§<newPage>§<header;Electric Machines;true>\nWhat happens if you put 40EU per packet into the Macerator?\nIt will §lEXPLODE§r.\n\nSo when working with machines, make sure how much power they can accept per packet.§<newPage>§<header;Energy Packets?;true>\n§<reset_header>\nOk so what is actually a energy packet?\nIt's fairly simple.\nIt is a box filled with power that you send using mail. Takes a while but it comes there eventually.\n\nOk jokes aside.\nYes you can think that an energy packet is a box, and the power itself determines how big said box is.\n\nSo machines can accept only boxes up to a certain size, but an infinite amount of boxes until it is full.\n\nNo the machine doesn't explode if it is full and you try to shove in more boxes of power.§<image;ic2:textures/wiki/packet.png;80>§<newPage>§<header;Cables;true>\nCables are your transport of these imaginary boxes of power.\nLike machines, they have a limit how much power they can transfer.\n\nCopper Cables for example have a transfer limit of 32EU/packet.\nBut they can transfer infinite amount of packets.\n\nThough since you are trying to push energy through metal, there is some loss for doing so.\nTo use our Copper example. It loses 0.2EU per block you try to push power through.\n\nTo make the game easier, the loss is rounded down. Meaning until you reach 1.0 you will not lose any power.\nMeaning you want to keep distances short, or account for it.\nNote that loss applies for each packet individually.\n\nAlso make sure you keep cables insulated, otherwise you might get a shocking experience if you go near them.§<newPage>§<header;Transformers;true>\nNow there is a blatant problem here.\nWhat if my power source is to high for my machine?\nDo I need to build a new one?\n\nThis is where transformers come into play.\nThey can take higher tier packets in and convert them into lower tier packets.§<newPage>§<header;Transformers;true>\n§<image;ic2:textures/wiki/transformer.png;50>\n§<padding;3>\nThis image shows 1x 128EU going in to the transformer and coming out as 4x 32EU packets.\nAllowing to downstep packets and securing the grid of weaker machines.§<newPage>§<header;Inverted Transformers;true>\n§<image;ic2:textures/wiki/inverse_transformer.png;50>\n§<padding;3>\nTransformers can also be inverted using a redstone Signal.\nDoing that inverts the \"inputs\" and \"outputs\".\nThis allows to compress energy packets and help to reduce Energy loss.§<newPage>§<header;EU-Reader;true>\nNow all this information is useful, but that information is all hidden and not visible.\n\nNow the §<redirect;true;EU-Reader;ic2:preview.eu_reader> changes that.\nHaving an EU-Reader in your hotbar enables tooltips on items that allow you to see the exact stats of said generators/cables/machines.§<newPage>§<header;Directional Power;true>\nMost of the power sources emit their power into all 6 directions.\nBut there are a few that are directional in their nature.§<image;ic2:textures/wiki/directional.png;45>§<newPage>§<header;Directional Power;true>\nThe rule of thumb is\n- A single point is an §lOutput§r\n- while no or 3 points are an §lInput§r\n\nSmall side note:\nThe colors on the dots indicate what the power would be on their side, based on the respective cables§<newPage>§<header;Grid Splitting;true>\nNow there is one more problem that you may or may not have run into.\nBut what happens if you need to pass by cables really closely to each other and do no want them to connect?\n\nYou have 2 solutions to that problem:\n- 1: Give up.\n- 2: Build bigger§<newPage>§<header;Painters;true>\nJokes aside. Option 1 is §<redirect;true;Painters;ic2:preview.painter> §<image;ic2:textures/wiki/color_blocking.png;45>\n§<padding;5>\nCables that are painted will not connect to other cables if they are differently colored.§<newPage>§<header;Mining Pipes;true>\nYour second option is mining pipes: §<image;ic2:textures/wiki/mining_blocking.png;45>\n§<padding;5>\nMining pipes can be placed on cables and act like anchors / plugs so cables won't connect to each other.\n\nExtra to that holding mining pipes show this sick overlay.",
  "wiki.ic2.subpage.electricity.head": "Electricity",
  "wiki.ic2.subpage.electrolyzer.body": "The Electroylzer is a machine that directly draws energy from power storages.\n\nWhile it needs to touch the power storage it doesn't need to connect to the output to function.\n\nIt consumes 1/4 of the energy storages output rate.§<newPage>§<header;Recipes;true>\nThe Electrolyzer has 2 recipe modes:\n- §lCharging§r: When the storage is 70% or more full.\n- §lDischarging§r: When the storage is 30% or less full.\n\nRecipes themselves can decide which modes do work on them.\nWhen a Recipe says \"Dual\" it means it works with both.",
  "wiki.ic2.subpage.electrolyzer.head": "Electrolyzer",
  "wiki.ic2.subpage.first_day.body": "So you started your first day,\nand want to know how to start IC2Classic.\n\nYour first goal is to gather resources.\nSo Your playthrough starts like any other.\n\nYou go mining / exploring and collect resources.\nThe order isn't really important.§<newPage>§<header;Ores;true>\nOn your first mining trip, you want to avoid dying,\nand find the following ores:\n- Coal\n- Iron\n- Copper\n- Tin\n- Redstone\n\nCoal/Iron/Copper and Tin can be found rather high,\nwhile for redstone you need to dig rather deep down.§<newPage>§<header;Exploration;true>\nYour exploration goal is to find these trees: §<image;ic2:textures/wiki/rubber_tree.png;130>\nThey are called §lRubber Trees.§r\nThey can be found in:\n- Forests\n- Swamps\n- Jungle biomes.\nSwamps are the source of them. \nBut like always, kindly get out of their swamp.\n\nOnce found, you want to collect their resin, and collect saplings for your home.§<newPage>§<header;Resin Collection;true>\nOnce you have some rubber trees you want to collect their resin with a Treetap.\n\nRubber trees have these resin spots that you can tap for resin.\nOnce tapped, by right clicking them with a Treetap, they will slowly re-grow.\nJust make sure not to overtap them otherwise the resin spot ceases to exist.§<newPage>§<header;Helpful items;true>",
  "wiki.ic2.subpage.first_day.head": "First Day",
  "wiki.ic2.subpage.first_day.list": "This item list shows you a few things you should go for,\nWhat things you can turn into and etc.",
  "wiki.ic2.subpage.fisher.body": "The Electric Fisher is your end game solution to getting loot,\n\nIt takes a lot of energy to keep it running, but the loot you get is a lot.\nIt is faster then 64 players would be combined with best loot.\n\nThe structure is fairly simple, just a small platform and chain downwards.\nThe length of the Chain decides how much extra luck you get.\n\nThe chain has to be at a minimum length of 5 blocks and a max range of 10.\n\nThe platform can be made out of any plank/log and the container above the fisher needs at least 20 slots to be valid.",
  "wiki.ic2.subpage.fisher.head": "Electric Fisher",
  "wiki.ic2.subpage.fourth_tier.body": "For the fourth tier you need Iridium\n\nIridium is created using UU-Matter, which is produced by a §<redirect;true;Massfabricator;ic2:preview.mass_fabricator>.\nTurning energy and optional other resources into UU.\n\nThe optional resources being \"Scrap\", which makes the process 7x less energy intensive.§<newPage>§<header;Shiny Dog Treat!;true>\nAnyhow at this point there is not much more you need.\nHere is your shiny list!\n\nPlease Go away!!!!",
  "wiki.ic2.subpage.fourth_tier.head": "Fourth Tier",
  "wiki.ic2.subpage.fuel_boiler.body": "The Fuel Boiler is one of the endgame generation producers.\nIt is a 2x2 multiblock build of this and its structure blocks.\n\nIt uses Fuelcans to boil water into steam. It produces 1024mB steam per tick.\nThis is done in a very efficient manner. It is 2x efficient as a normal generator with its fuel.\n\nThough this is only the case once it is heat up. The heatup phase takes 10x the fuel compared to when it is fully heat up.\nThis fuel efficiency can be massively improved on by effectively making use of the Fuel can which is a modular fuel source that can be pretty terrible or insanely good.\n\nThe top 4 blocks of this multiblock automatically output steam to directly connected tanks.\n\nUnlike its other mod counterparts, this one does not explode if you run out of water and refill it with that.",
  "wiki.ic2.subpage.fuel_boiler.head": "Fuel Boiler",
  "wiki.ic2.subpage.fusion_reactor.body": "Fusion Reactor is a cubic 5x5x5 structure where the blocks are all reinforced variants. \n\nIt is also the answer to that burning question of...how much lava is enough lava?\n\nThe answer? There's no such thing as enough!§<newPage>§<header;The Structure;true>\nThe frame and the floor is made out of any reinforced stone,\nwhile the rest is made from any reinforced glass.\n\nValves can be inserted at an point in the structure.§<newPage>§<header;How to get it running;true>\nHow does the fusion reactor work?\nThrow in up to 6 Uranium rods into it and a meltable block.\nDifferent Uranium types have their own production rates.\n\nBe warned the heatup cost is expensive, but once heated up it makes the fuel rather efficient.",
  "wiki.ic2.subpage.fusion_reactor.head": "Fusion Reactor",
  "wiki.ic2.subpage.gui.body": "IC2Classic has a varied set of GUI Features that are ment to aid you in your playthrough.\n\nLets start with the 3 most common buttons.§<image;ic2:textures/wiki/gui/buttons.png;30;42;34.56>\n§<padding;5>\n- §lI§r: Inventory Settings\n- §lC§r: Comparator Settings\n- §lS§r: Slot Info\n\nThese settings are accessible to you in every machine that has a GUI.\nIt is the replacement for the \"Machine Tool\" that was present in previous iterations of the mod.\n\nAnd yes I am just padding out the text so the next info can be on a double page!\n\nYou will understand why I am doing that when you flip over!§<newPage>§<header;Inventory Settings;true>\n§<image;ic2:textures/wiki/gui/machine.png;74>\n§<padding;5>\nMachine access control allows you to set inventory settings for the entire machine / Slots\nBy default the machine settings are selected.§<newPage>§<header;The Controls;true>\n- §lBlue§r: The letters DUNSWE stands for each side you want to configure.\n- §lRed§r: These toggle buttons allow you to enable/disable if the side is accessible.\n- §lCyan§r: The 4 state buttons are allowing you to decide if a side is Both, Insert only, Export only or Disabled.\n- §lReset§r: Just resets to the default settings for the entire machine.\n- §lGreen§r: The 2 buttons are machine only settings that only some machines have a use for.\n   - §lLeft button§r: Allows only 1 item per type to be inserted into the visible inventory (for that specific side)\n   - §lRight button§r: Allows only 1 stack in size to be inserted into the visible inventory (for that specific side)\n  \n- §lInventory Slots§r: Allows to inventory upgrades to be inserted into, so you can filter what and how many items are allowed and what not.§<image;ic2:textures/wiki/gui/machine_selected.png;60;10;98>\n§<padding;5>\nAlso you can click on slots and make slot specific settings!§<newPage>§<header;Comparator Controls;true>\n§<image;ic2:textures/wiki/gui/comparator.png;74>\n§<padding;5>\nThe Comparator Settings allow you to modular design your Comparator output.§<newPage>§<header;Comparator Controls;true>\n- The §lBlue§r Section allows you to select which comparator out put you modify.\nV => Vanilla Comparator,\nwhile the rest is specific sides for the Advanced Comparator\n- The §lGreen§r section is the sources for the output you can select.\nShowing live what output they would provide.\n\n- The §lRed§r section is where your comparator output is being calculated.\nThe §lLeft Number§r is the value provided while the right number is what is going to be the actual output.\nThis is due to the 3 buttons, which are processed left to right.\n§lTorches§r invert the signal.§<newPage>§<header;Comparator Controls;true>\nwhile the §lRepeater§r signs it to either 0 or 15, when enabled.\nThe final output then is calculated based on what the \"Selector\" button says.\nBy default it will do §l\"Min\"§r but §l\"Max\"§r and §l\"Average\"§r are options. It will take all provided sources into account.\n\nSimply Click on sources to add/remove them.§<newPage>§<header;What goes into that slot?;true>\nOften you ask yourself, what goes into that machines slot?§<image;ic2:textures/wiki/gui/inventory_selected.png;74>\n§<padding;5>\nThe Slot Filter Info basically does exactly that!\nShows you what goes into each slot.\nSimply click on the §l\"S\"§r Button and click on any slot of the inventory you click on.\nAnd it shows you exactly what goes into it.\n\nIf the list is a bit long there is also a search bar!\nThank you for Daenara for suggesting that idea! §<newPage>§<header;Slot Filter Selector;true>\nThe Slot Filter Info also has other utilities.\nYou know how you have to have a item to set a filter?\nEven if that doesn't get consumed?\n\nI know exactly what you are thinking!\nAnd yes you are right!§<newPage>§<header;Slot Filter Selector;true>\n§<image;ic2:textures/wiki/gui/item_selector.png;74>\n§<padding;5>\nWhen a slot is a filter. You can simply click on that slot to select your filter.\nIt even checks what item is a valid input. So no guessing!§<newPage>§<header;Item Tooltips;true>\n§<image;ic2:textures/wiki/gui/tooltip.png;18>\n§<padding;5>\nItems have Keybinding tooltips that exactly tell you what to do.\nSometimes a Keybinding says only \"m\" like in this example.\nMost of the time that \"Key\" is combined with a \"Right Click action\", unless it is reasonable to understand that the right-click combo is impossible.\nLike with jetpacks.§<newPage>§<header;Item Inventories;true>\nOne last feature that people won't expect is.\nYou can open item inventories even from the inside of another block.\nAnd interact with it, without having to take out the item and use the right-click funtionality.\n\nThis was already done with some other mods, but it only worked with player inventories.§<newPage>§<header;Friends Gui;true>\nIC2Classic has a few personalized blocks.\nbut sometimes you are playing in a group.\nThat's where the Friends GUI comes into play.\n\nIt is opened with pressing:\n§<key;key.ic2.hud> + §<key;key.ic2.toggle> \n\nThen you can enable who is your friend and then select them and specify specific permissions as desired.",
  "wiki.ic2.subpage.gui.head": "Gui Essentials",
  "wiki.ic2.subpage.industrial_worktable.body": "The Industrial Worktable is a really powerful crafting bench,\ncombined with a solid storage solution; it outclasses other options out there.\n\nBut what the Industrial workbench isn't is an \"Automation Tool\".\nIt is designed to reduce crafting, by assisting you, not by automating it away.§<newPage>§<header;Industrial Worktable;true>\n§<image;ic2:textures/wiki/industrial_worktable.png;120>§<newPage>§<header;Recipe Memory;true>\nThe §lGreen§r is your recipe storage where the recipes are stored.\nBy default you gain 9 recipes but this can be expanded with §<redirect;true;Memory Sticks;ic2:preview.memory_stick>.§<newPage>§<header;Recipe Memory;true>\nRecipes can be added when you have a recipe stored in the crafting grid and hit the save button. Just click on the slot you want to save in.\nWhen you click on a recipe it will automatically load it into the recipe grid.\nMiddle-mouse clicking on a recipe will delete it.§<newPage>§<header;Memory Expansions;true>\nThe §lYellow§r section stores the memory sticks that expand the recipes.\nNote that recipes are stored in the memory sticks themselves, meaning they can be replaced as needed.§<newPage>§<header;Main Storage;true>\nThe §lRed§r area is your main storage where you store your items in. The restock button (hopper) will refill your items in after every craft. (It will remember the layout)§<newPage>§<header;Trash Storage;true>\nThe §lBlue§r are your trash slots where ingredients that come up during crafts and are not used are landed in. This area is ignored by the restock feature and is also prioritized by the crafting grid.§<newPage>§<header;NBT Setting;true>\nThe \"Paper\" Button is a \"per recipe\" button that indicates if a recipe has to search for exact NBT Data instead of any item that you are searching for.\nThis is to help recipes that have to have specific data to be provided to work, by default it is off due to most recipes not checking NBTData itself.§<newPage>§<header;Recursion Crafting;true>\nThe Workbench button enables recursive crafting. This is the setting that makes this worktable so powerful.\nIf you want to craft something but only you have its base components and not all ingredients required,\nthen this button allows you, when enabled, to automatically craft all sub ingredients for you.\nProvided it knows the recipes. (Recipe slots)\nThat means you can have very grindy recipes turn into a single click since it automatically finds out what to craft and does it for you\nand if it can not craft then it will automatically tell you where it was stuck.§<newPage>§<header;Recursion Crafting Limitations;true>\nOfcourse there is limitations with this system. Mainly due to performance reasons but also to make it not to overpowered.\n- You can only have 512 SubCrafts at once. Meaning if your recipe exceeds requires more then 512 crafts to make its ingredients it will say no.\n- You can only go up to 6 layers deep. \n\n(Workbench -> Planks -> Logs is 1 layer deep) Meaning you can only have so many ingredients to be created before it blocks you.\n- The resulting unused items have to fit into the trashslots. So make sure to keep them clean or to keep track of them.\n- All Ingredients or subrecipes have to be provided by the user.\nWhile these sound rather small these make sure that the table can stay reasonable with their performance and assist you with reducing crafting.§<newPage>§<header;Restock;true>\nThe Restock Button, The Hopper, enables that after every craft it will automatically refill the main storage with all the items it misses.\nWhile keeping the before craft layout and trying to preserve it.\nThis also works with expansions, where it automatically refills them if they want/need to be refilled.§<newPage>§<header;Request Network;true>\nSince tubes have a request system the Industrial Worktable has a request system too.\n2 in fact.\nThe hopper minecart button that simulates a craft and if that one is valid it will request all the missing items from the request grid.\nThe request tube button opens a subsection where the user can make his own requests.\nNote that the \"Request selector\" isn't aware what items are in the grid, so you can request anything and stuff that can be fulfilled will be.\n\nThis is due to mod engine limitations, and networking data reduction.§<newPage>§<header;Expansions;true>\nThe Industrial Workbench can have expansions, by default it can be 6, but this can be either 0-20 in the configs.\nThese expand the functionality of the workbench.\nAs long as an expansion is directly or indirectly connected to a workbench it can be added.\nAlso expansions can be shared between multiple worktables.",
  "wiki.ic2.subpage.industrial_worktable.head": "Industrial Worktable",
  "wiki.ic2.subpage.item_energy.body": "IC2Classic has a lot of electric tools and portable energy storages.\nAlso called batteries.\n\nThere are a few things to know about portable energy in general that is essential for a smooth play-through.§<newPage>§<header;Tools;true>\nHow would I recharge tools without going back to my generator block?\n\nThere are 2 ways:\n- §lArmor/Curio§r: Have a portable energy storage in either your armor or Curio (if installed) slots.\n   Tools will auto attempt to recharge the moment you use them.§<newPage>§<header;Tools;true>\n- §lItem§r: Right click a battery in your main hand.\n   The moment you right click a battery in your hand it will recharge everything in your hotbar with its own power.§<newPage>§<header;Energy Tiers;true>\nItems also have their own power tier. §<image;ic2:textures/wiki/energy_tier.png;40>\n§<padding;5>\nWhen you try to charge/discharge a battery/tool of any type, the charger/discharger must be equal or greater in its energy tier.\n\n\nFor example a §<redirect;true;Batbox;ic2:preview.batbox> can't charge a §<redirect;true;Energy Crystal;ic2:preview.energy_crystal>.\nBecause the Energy Crystal is tier 2 and the Batbox is Tier 1.§<newPage>§<header;Charing Benches;true>\n§<redirect;true;Charging Benches;ic2:preview.charging_bench_lv> and §<redirect;true;Battery Stations;ic2:preview.battery_station_lv> can override this.\nSince they are specialized blocks to deal with that sorta thing.",
  "wiki.ic2.subpage.item_energy.head": "Portable Energy",
  "wiki.ic2.subpage.liquid_generator.body": "The Liquid Generator mainly accepts 3 different Liquids.\n\n§lWoodgas§r\n4mb : 1 tick : 10EU/t \n\n§lBio-Fuel§r\n1mb : 2 ticks : 128EU/t \n\n§lAlcohol§r\n1mb : 24 ticks : 50EU/t \n\nWoodgas can be produced by a §<redirect;true;Wood Gasifier;ic2:preview.wood_gassifier>",
  "wiki.ic2.subpage.liquid_generator.head": "Liquid Fuel Generator Liquids",
  "wiki.ic2.subpage.miner.body": "The Miner is your gateway to semi-automatic mining.§<newPage>§<header;Miner;true>\nYou are running out of resources. The Miner is one of the most efficient ways to gather resources out there that doesn't require Steve Power!\n\nWhy it is semi-automatic?\nMainly because it only runs once and requires manual moving.§<newPage>§<header;Miner Scanners;true>\nThe Miner requires a §<redirect;true;Scanner;ic2:items.scanners> to run.\nThe scanner decides on how and how far the Miner works, without it will just dig down.\n\nA normal scanner just targets the desired ores and skips all the useless stuff unless what's directly in the way.\nA Quarry scanner targets every single block for a giant hole.§<newPage>§<header;Miner Drills;true>\nThe drill decides how fast and how efficient the Miner digs and also which block it can dig.\nIt is effectively the drill head, even if a §<redirect;true;Mining Laser;ic2:preview.mining_laser> seems weird.\nIf the drill is missing the mining pipe will be retracted.\nAlso Fortune/Silk Touch are used when they are on the drill.§<newPage>§<header;Mining Pipes;true>\nThe Miner needs mining pipes to drill down into the ground.\nIt actually determines how far the Miner can go down to.\nYou can always re-supply the mining pipes as they are used.\nAlso when the mining pipes are retracting you can replace the them with another block and they will be placed instead. §<newPage>§<header;Special Interactions;true>\nThe Miner can use a Pump if it is connected to suck up fluids that would cause the Miner to be stuck otherwise.\n\nThe Miner by default only outputs to the sides and not to the top/bottom.\nThis can be configured with the Inventory Access control, it checks if the side is exportable.§<newPage>§<header;Workgroup;true>\nA Miner itself is only so fast. Putting multiple close to each other has the downside that they will fight over each other what to do\nand effectively slow each other down.§<newPage>§<header;How to Workgroup;true>\nThis is where the \"Workgroup\" button comes into play.\nAfter you placed down all your miners, you can click said button to create a Workgroup.\nSaid Workgroup searches in a 5 block radius for all miners that aren't in a Workgroup and adds them to the list.\nMaking the one you started it in the Master Miner.§<newPage>§<header;What Workgroups do;true>\nWhen a Miner is a helper in a Workgroup it no longer requires a scanner,\nsince the Master decides on which blocks are mined.\nEvery single Miner has its own task, which the workgroup makes sure that there is no collisions are present.\nIf there isn't enough tasks or the miners do collide with each other during mine, instead of fighting over the block miners instead assist each other.\nIncreasing the Mining Speed of that specific block.\n\nWhile there can be inefficiencies. This increases the efficiency greatly.§<newPage>§<header;Extra Workgroup Knowledge;true>\nEvery Miner still requires Drills, Mining Pipes and power.\nAlso the Miner that finally breaks the Block actually spawns the Drops so you need to cover all miners with sending items away.\nPumps also have to be setup individually, though only the master requires it to pump fluids, every extra pump just helps dealing with fluids.",
  "wiki.ic2.subpage.miner.head": "Miner",
  "wiki.ic2.subpage.ocean_generator.body": "The Ocean Generator checks in a §lRadius§r §lof§r §l5§r §lBlocks§r in all directions.\n\nIt requires a minimum of 26 coral blocks adjacent to start generating EU.\n\nEvery coral(above 25) increases effectiveness by 4% and 10 Water have a Production of 1EU/t",
  "wiki.ic2.subpage.ocean_generator.head": "Ocean Generator",
  "wiki.ic2.subpage.overgrowth_fertilizer.body": "The Overgrowth fertilizer is a dangerous tool.\n\nIt provides high reward at a certain risk.\nIt boosts the crop tick speed by 256x for 5 minutes.\nThis has the upside of crops growing 256x faster but also fertilizer and hydration are consumed 256x faster.§<newPage>§<header;Limitations;true>\nAfter the 5 minutes are over the crop is basically dead. It does not tick anymore.\nSo if you have a partical grown crop good luck getting that of your crop.§<newPage>§<header;Revival;true>\nRestoring Fertilizer can be used to revive it to its old behavior but both can be only used once on a crop stick.\nIf you want to reapply it you need to break and replace the Crop Sticks.§<newPage>§<header;Warnings;true>\nOne really cruel downside of this is though if weed decides to ever spread to another cropstick,\nit also will spread the overgrowth meaning you unleash hell on your crop farms.§<newPage>§<header;Why?;true>\nWhy would you ever use this?\n\nIn a controlled space this can be a really useful tool.\nCropbreeding can take hours to grind for a single crop.\nThis speeds up the process at the risk of losing just as you have gotten it or lose your crops that you use to breed things.§<newPage>§<header;Final words;true>\nIt also can be used to bulk produce certain products you only want once and don't want to wait a long time.\n\nSo be warned it is a dangerous tool.",
  "wiki.ic2.subpage.overgrowth_fertilizer.head": "Overgrowth Fertilizer",
  "wiki.ic2.subpage.pressure_alloy_furnace.body": "Pressure Alloy Furnace is a multiblock that uses the Pressure Alloy Furnace and its structure blocks to form. It is a 2x2x2 Structure with the master block being at the top-left based on the facing.",
  "wiki.ic2.subpage.pressure_alloy_furnace.head": "Pressure Alloy Furnace",
  "wiki.ic2.subpage.pump.body": "The Pump:\nIt is a really useful block if you want a stable water-source that doesn't get accidently get deleted due to overusage.\nThe pump is only capable of pumping up the fluid directly below it.\n\nFor mass clearing: please check out your local §<redirect;true;Ranged Pump;ic2:preview.ranged_pump>.§<newPage>§<header;Pump Special Interactions;true>",
  "wiki.ic2.subpage.pump.compressor": "The Pump can be used with a §<redirect;true;compressor;ic2:preview.compressor> directly.§<newPage>§<header;Compressor;true>\nIt will take the water from pumps and turn it directly into snowballs!§<newPage>§<header;Miner;true>\nThere are also special interactions with the §<redirect;true;Miner;ic2:preview.miner>.\nwhere it will help the miner deal with fluids when it comes into contact with it.",
  "wiki.ic2.subpage.pump.head": "Pumps",
  "wiki.ic2.subpage.pump.interactions": "Pump Special Interactions",
  "wiki.ic2.subpage.reactor.body": "The Nuclear Reactor is a highly complex but also modular generator.\n\nIt uses §<redirect;true;Reactor Components;ic2:items.reactor.components> to work.\nThey make it produce power, let it explode or do anything.\n\nSo the reactors are just empty shells that are useless without components!§<newPage>§<header;Reactor Simulation;true>\nThe first thing that should be known is that the inventory of the reactor updates in a specific way.\nThe order of operations is from the top left to the bottom right.\n\nAnd the reactor explodes if the after updating the last component the heat is over the maximum allowed level.§<newPage>§<header;Components;true>\nThere are a few Component types out there.\nA Overview:\n- §<redirect;true;Uranium Rods;ic2:preview.uranium_rods> \n- §<redirect;true;Heat Vents;ic2:preview.heat_vent> \n- §<redirect;true;Heat Exchangers;ic2:preview.heat_exchanger> \n- §<redirect;true;Reactor Plating;ic2:preview.plating> \n- §<redirect;true;Reflectors;ic2:preview.reflector> \n- §<redirect;true;Isotopic Rods;ic2:preview.isotopic_rod> \n- §<redirect;true;Condensators;ic2:preview.condensator> \n\nSmall side note:\nComponents, if they get overheated, can break.\nSo be careful§<newPage>§<header;Uranium Rods;true>\nUranium Rods produce the power that you are interested in.\nSadly they also cause those pesky explosions everyone hates...\n\nUranium gets a efficiency bonus if it touches another Uranium Rod.\nThough the Heat output also goes up.§<newPage>§<header;Uranium Rods;true>\nIf the rod isn't touching components that can accept heat the rod dump their heat directly into the reactor.§<newPage>§<header;Heat Vents;true>\nHeat Vents are your cooling solution for the reactor.\nThey usually cool only themselves while others cool also the reactor directly.§<newPage>§<header;Heat Vents;true>\nThere are a few variants:\n- §lHeat Vents§r: \nYour basic cooling solution.\n- §lStream Vents§r: \nConvert Water into steam, gets more efficient the less heat they can store.\nOnly work in Steam Reactors.\n- §lElectric Vents§r:\nReduce EU production slightly to achieve double the cooling.§<newPage>§<header;Heat Exchangers;true>\nHeat Exchangers exchange heat between components and sometimes the reactor.\nThese help to balance out the heat so your reactor isn't exploding so quickly.§<newPage>§<header;Heat Balancers;true>\nHeat Balancers are almost like Heat Exchangers.\nThe only difference is that they work like an overflow balancer where it only drains from almost full components\nand only fills into almost empty components.\n\nAllowing to control the flow of heat a bit.§<newPage>§<header;Coolant Cells;true>\nThat give a buffer of heat storage that can be inserted to but also extracted from.§<newPage>§<header;Plating;true>\nReactor Plating allows you to increase the maximum heat and reduce the explosion strength of your reactor.\nWhich can be used to increase breeding efficiency.§<newPage>§<header;Isotopic Cells;true>\nIsotopic Cells are basically cells that use reactor heat and Uranium ions to revive themselves.\nWhich allows your reactor to last a lot longer.\nThis process also allows you to 8x your Uranium ingots into rods.§<newPage>§<header;Condensators;true>\nCondensators are your brute force approach for cooling.\nThey use resources, like lapis / redstone, to cool a reactor.\nThey can absorb up to a certain amount of heat before they need to be refilled.\nBut they never break.§<newPage>§<header;Reactor Planner;true>\nNow you might be frightened by the whole \"Reactor Exploding\" if you do something wrong.\n\nLuckly the §<redirect;true;Reactor Planner;ic2:preview.reactor_planner> exists.\nIt allows you to simulate reactors in a safe environment and get everything safely running before switching into production.\n\n\nAlso it shows you a lot of extra stats about the reactor so you can design everything you need too.\n\nAlso the worst that can happen: \nYou blow up the cyber Space... nobody needs that anyways.",
  "wiki.ic2.subpage.reactor.head": "Nuclear Reactor",
  "wiki.ic2.subpage.rocket_miner.body": "The Rocket Miner is a very versatile tool, allowing for completely automating resource gathering but it does require a decent amount of setup to get it up and running smoothly.\n\nThere are some slots in the GUI that allow for various upgrades/modules to be included. \nThese include the:§<newPage>§<header;Components;true>\n- §<redirect;true;Chunkloader;ic2:preview.chunkloader>, enabling operation even if the miner is thousands of blocks away from its refueling position, \n- §lMining Pipe§r §lstorage§r for those really deep ores, \n- §lA Cell storage§r to handle fluids that would otherwise stall the miner\n- §lA Cobblegen§r §lUpgrade slot§r for filling part of its mess back up.§<newPage>§<header;Recycling;true>\nPotentially, you could include a recycler to scrap the blocks that are unwanted.\nWhich is decided by the scanner. Meaning that cobble and dirt for example get turned into scrap/boxes.\nThis is to increase how much storage for the things you want is present and reduce the garbage.§<newPage>§<header;Energy Storage;true>\nMore importantly is the energy storage and Rocket Miner Remote slot. The former allows for an HV tier energy battery to be charged and used while the miner is operating.\nThe §<redirect;true;Remote;ic2:preview.miner_remote> allows for the miner to find it way back home so it can refuel. §<newPage>§<header;Refueling;true>\nRefueling is a critical part of the Rocket Miner as its energy buffer will only last for so long, that or the internal storage fills and it can no longer work effectively.\nOnce the miner has either \n- §lA§r.) reached a certain threshold on power remaining, it will fly back home to recharge \n\n- §lB§r.) when the internal storage is filled, it will fly home to drop its items off. \n\nOnce it comes back home, it will wait until it is given a redstone signal to fly off back to work. Careful though, you don't want it flying back before its ready so try and avoid giving its refueling point a constant redstone signal.",
  "wiki.ic2.subpage.rocket_miner.head": "Rocket Miner",
  "wiki.ic2.subpage.second_tier.body": "You reached the point where you would like to progress into the next tier.\nWhat do you actually need?\n\n- A power system that has at least 50-80EU/t production is suggested\n\n- A lot of either Dirt/Clay/Terracotta§<newPage>§<header;Aluminium;true>\nYour goal is to produce Aluminium (Alu) for advanced Machines.\n \nAlu dust can be crafted using a §<redirect;true;Rare Earth Extractor;ic2:preview.rare_earth_extractor>.\nUsing Dirt/Clay/Terracotta, \n- §lDirt§r being the slowest way, but easiest to obtain.\n- §lClay/Terracotta§r being the best way if possible.§<newPage>§<header;Nether Aluminium;true>\nYou can also find Alu in the Nether, but it is very well hidden,\nbut if you find 1-2 of them you are set for the midgame.\n\nOnce you have aluminium dust you process it in an §<redirect;true;Alloy Smelter;ic2:preview.alloy_smelter> with sand.\n\nThat is where you need the power. It is a power hungry machine.\nMake sure it doesn't suck your grid dry!§<newPage>§<header;Machine List;true>",
  "wiki.ic2.subpage.second_tier.head": "Second Tier",
  "wiki.ic2.subpage.second_tier.list": "These are the machines/materials you want.\nYes a bit dry, but have fun find out the shiny things yourself!",
  "wiki.ic2.subpage.simple_crop_library.body": "The Simple Crop Library is a bulk storage solution to your crop seeds.\n\nThough it is the most limited solution it does not require power and drops all its contents when broken.\n\nIt stores 20 crops types and each type can have 20 mutations with 128 items stored.\nWhich results in a total storage of 51.200 crop seeds it can potentially store.\n\nThis will deal with your early game need of crop storage. It is far better then a double chest and provides a lot more information.\n\nThe only real downside is crop seeds have to be analyzed to be stored in the Library.",
  "wiki.ic2.subpage.simple_crop_library.head": "Simple Crop Library",
  "wiki.ic2.subpage.steam_reactor.body": "The Steam Reactor is an upgrade to the Nuclear Reactor.\n\nThough for a pretty high cost.\nThere are a couple rules changing with the Steam Reactor that make it more risky but also a lot more interesting.§<newPage>§<header;The rule changes;true>\nFirst of all the heat the Uranium outputs is now your production potential, not the electric output.\nThe heat has to go through Steam Vents that use the reactors internal tank to convert heat to steam.§<newPage>§<header;Steam Vents;true>\nSteam Vents get more efficient with heat to steam conversion the hotter they are.\nIf they don't have any water or can not output steam then they stop cooling instantly.§<newPage>§<header;The Reward;true>\nAnd the last but massive change the clockrate the reactor runs at is 20x the normal reactor.\n\nThis means you have very little time to deal with errors.\n\nThe reward is a higher potential power output.\n\nIf you can handle the heat! Unlike a certain Dovahkiin0_0",
  "wiki.ic2.subpage.steam_reactor.head": "Steam Reactor",
  "wiki.ic2.subpage.steam_tunnel.body": "The Steam Tunnel is a multiblock that produces EU from steam and is capable of recycling the steam back into water.\n\nIt consumes up to 4096mB per tick to produce 2048EU/t, in 512EU packets.§<newPage>§<header;Structure;true>\nThe Structure is a hollow 5x3x3 and §<redirect;true;Valve Blocks;ic2:preview.valve> can be used to fill/drain steam/water.\nIt uses Machine Structure Blocks and a Steam Tunnel Block at the center of the blade.",
  "wiki.ic2.subpage.steam_tunnel.head": "Steam Tunnel",
  "wiki.ic2.subpage.tank.body": "The Tank is a fully dynamic multiblock that can be built from 3x3x3 up to 50x200x50.\n\nIt can be built with a big variation of Blocks.\nEach air block is worth 16 Buckets.\n\n§<redirect;true;Valve Blocks;ic2:preview.valve> can be used in any non-frame block to interact with the tank.\n\nGlass blocks are not allowed in the frame.\n\nHere is a list of valid blocks: ",
  "wiki.ic2.subpage.tank.head": "Tank",
  "wiki.ic2.subpage.teleporter.body": "To link Teleporters you require a §<redirect;true;Frequency Transmitter;ic2:preview.frequency_transmitter> and use it on the respective Teleporters to link.",
  "wiki.ic2.subpage.teleporter.body2": "The Teleporter is capable of teleporting many things, including entities, fluids, items and EU.\n\nIt will teleport whatever it finds in front it as long as the it matches with the other Teleporter.\n\nHaving any storage container(like chests) in front of it, would teleport the items to the other Teleporters' storage container.\nSame goes for fluids and EU with their respective fluid container(tank) and EU container(e.g. MFSU).\n\nAs for entities, it will teleport any entity that's in front of it, as long there's space on the other side.\n\nBe aware that the costs are very high, but are done in bulk.",
  "wiki.ic2.subpage.teleporter.head": "Teleporter",
  "wiki.ic2.subpage.tesla_coil.body": "As already said the Tesla Coil is very useful for mob grinders.\n\nThe Tesla Coil has a radius of 4 Blocks and deals equal damage to all damageable entities in range.\n\nIt discharges every 32 ticks(1.6 seconds) and deals 1 damage for every 400 EU discharged.\n\nIt is considered as a fake player, so it will grant \"Player Only\" drops\n\nElectric armors protect against the deadly effects of high voltage DEATH and might turn it into free charging!",
  "wiki.ic2.subpage.tesla_coil.head": "Tesla Coil",
  "wiki.ic2.subpage.thermal_gen.body": "The Thermal Generator is a more efficient geothermal generator.\n\nWhile it makes fuel last 50% longer and produces 50% more power it has also a passive power production.\nWhich is based on the blocks around it, which also can be amplified/weakened by the biome it is in.§<newPage>§<header;Thermal Generator;true>\nHere is a rough list:\n- §lLava Like§r: 0.005EU/block\n- §lFire/Flowing Lava§r: 0.0015EU/block\n- §lMagma Block§r: 0.0035EU/block\n- §lObsidian§r: 0.0025EU/block\n- §lStone/Metal Blocks§r: 0.001EU/block\n- §lWater Like§r: -0.0015EU/block\n- §lSnow Blocks§r: -0.0025EU/block\n- §lIce Blocks§r: -0.005EU/block\nThese values in the best case, all lava blocks, will result in roughly 16EU in passive production.\nThough your average will be passive 5EU production in a mountain or like 10EU in the nether...",
  "wiki.ic2.subpage.thermal_gen.head": "Thermal Generator",
  "wiki.ic2.subpage.third_tier.body": "Hayoooo you are finally at the point where you think it is time to progress into the next tier.\n\nBut you are not sure where to start.\nNo worries, we got you covered!\n\nHere are some requirements you want to check before you start:§<newPage>§<header;The REQUIREMENTS!;true>\n- §lPower§r: Have at least 300-500EU power production, sustained. \nWhile it isn't required, it makes life so much easier since now we get into the power hungry stage.\n- §lResources§r: Make sure you have a few stacks of quarz and rare earth. While not hard to get they are essential.§<newPage>§<header;How to continue on!;true>\nNow that you have §mnot§r ensured that you have all stuff you need.\nHere is what you need to do:\n\n- You use the Quartz & Redstone in a §<redirect;true;Alloy Smelter;ic2:preview.alloy_smleter> to produce Pulsating Quartz§<newPage>§<header;How to continue on!;true>\n- And turn the Rare Earth into magnets using the §<redirect;true;Electrolyzer;ic2:preview.electrolyzer>\n\n\nThese two resources allow you to produce the next tier machines you so desire to enter the next realm of the progression...\nOk I'll stop with these big words... lets go to the SHINY stuff!§<newPage>§<header;Shiny Stuff!;true>",
  "wiki.ic2.subpage.third_tier.head": "Third Tier",
  "wiki.ic2.subpage.third_tier.list": "At this point you really should know what you want.\nIs this tutorial even necessary?!?!?!?!\nYES OFC! Right?",
  "wiki.ic2.subpage.tube_tool.body": "The TubeTool is your big expansion of the tube system.\n\nAllowing things that weren't possible without it, by enabling features that are disabled by default.\n\nSince there is so many features there is a list of things it can do.",
  "wiki.ic2.subpage.tube_tool.head": "Tube Tool",
  "wiki.ic2.subpage.tubes.body": "The Tube System is a rather simple yet effective system in IC2.\nBut unlike fully automatic options, this is more in the spirit of Minecraft.\n\nThere is a bunch of variants that do their specific thing and your task is to use them in a way that suits your needs.§<newPage>§<header;Tube Grid;true>\nThis can be a easy task if it is a smaller system, but it can get to brain melters too, if you try to do something to big/complex at once.\nSo keep that in mind when you use them.\n\nIn general the Tube System gives you everything you require to make a decent automation system.§<newPage>§<header;Tube Tool;true>\nAlso make sure to check out the §<redirect;true;Tube Tool;ic2:preview.tube_tool>.\nIt contains some extra functionality for tubes that are optionally enabled with it.\nSuch as, redstone control, expanded connectivity and a few other things.§<newPage>§<header;Logistic Grid;true>\nThe Tube System comes also with a logistic system attached for a more scaled automation solution.\nBut unlike other options these do not take care of \"Routing\", all they do is send and fulfill requests, you are in charge of managing routing!§<newPage>§<header;Basic Request;true>\n§<image;ic2:textures/wiki/logistic_grid.png;45>\n§<padding;5>\nThis is is a most basic example how a logistic grid could look like!\nHave a simple §<redirect;true;Request Tube;ic2:preview.request_tube> on the right and a §<redirect;true;Provider Tube;ic2:preview.provider_tube> on the left.§<newPage>§<header;Basic Request;true>\nThe Request Tube will automatically send requests through connected tubes to all Provider Tubes.\nIf there is stock, it will be sent out!§<newPage>§<header;Routing;true>\n§<image;ic2:textures/wiki/logistic_crossing.png;75>\n§<padding;5>\nBut how do you deal with a crossing in a scenario like this.\nNormally tubes just randomize where things go.\nSo this current setup just will not work.\nThe Solution?\nThere are 2 solutions to this:\n- §<redirect;true;Filter Tube;ic2:preview.filter_tube> which allows you to filter directions based on items.\n- §<redirect;true;Color Filter Tube;ic2:preview.color_filter_tube> which allows to filter directions based on colors.\n\nYes, requesters can be set a \"request color\" so you don't have to setup filter for every potential item.§<newPage>§<header;Grid Splitting;true>\n§<image;ic2:textures/wiki/logistic_splitting.png;75>\n§<padding;5>\nSo how do you deal with a scenario where you want grid sharing but request to be only partially shared across 2 grids.\nIn this case you want green/blue to be accessible on the other grid while red stays split.\nBecause you can not filter red to go to the right side since the request only provides the color but not which it result it should go into.\n\nAnd the requests do not care if an item can flow somewhere or not.§<newPage>§<header;Grid Splitting;true>\nThe solution is actually fairly simple.\nThe §<redirect;true;Request Limiter Tube;preview.limiter_tube> basically blocks any requests from passing through it.\nAnd you have to specifically enable the color that you want to let through.\n\nMeaning you can just set it to let green/blue requests through while all red requests stay in their local grid.§<newPage>§<header;BuildCraft Comparason;true>\nThe giant elephant in the room is that this is heavily inspired by BuildCraft.\n\nHere are some key differences:\n- §lExplosion§r: Tubes never explode if you throw in to many items.\nBut a performance/lag reduction method they do not process more then 100 individual stacks at once, meaning they get stuck until there is room left. Saving a lot of servers!\n\n\n- §lPerformance§r: Tubes are crazy optimized. While they can contribute to lagging a server, you can place ten thousands of them and have barely any lag from them.\n\n\n- §lGravity§r: Gravity is a thing. Meaning items flowing down will speed up, while items flowing up will slow down faster then moving horizontal. A minimum speed exists though.\n\n- §lPipeWires§r: Do not exist.",
  "wiki.ic2.subpage.tubes.head": "Tube & Logistic Tubes",
  "wiki.ic2.subpage.uu_crop_library.body": "The UUMatter Crop Library is for the guys who have done an expert job of breeding crops.\n\nLike its counter part it can store unlimited types and mutations. Though the stacksize limit is changed to 1.\nAnd storing that seed costs 512EU.\nThe ability of the UUMatter Crop Library is to clone seeds. Using UUMatter and EU.\nDuplicating a crop costs the amount of stats it has multiplied by 10000 EU and 1 UU Matter per Item cloned.\nIt can store up to 512 UUMatter.",
  "wiki.ic2.subpage.uu_crop_library.head": "UU Crop Library",
  "wiki.ic2.subpage.villager.body": "IC2Classic also adds a few villagers into the game.\nThese can be unlocked with different Blocks from the game.§<newPage>§<header;Electric Engineer;true>\n§lBlock:§r §lIron Furnace§r\nThis Electrified Villager is your component vendor, it is selling circuits and a few other things.\nCan be useful if you are low on Iron!\nThough I would avoid him, since a few villagers have told that the shocks made him Crazy...§<newPage>§<header;Nuclear Engineer;true>\n§lBlock:§r §lNuclear Reactor§r\nThe somehow Green glowing Villager is your Reactor Vendor, selling Reactor components and Uranium...\nThat explains the glow... I think.\nBut these are one way to get a lot of Uranium.§<newPage>§<header;Crop Farmer;true>\n§lBlock:§r §lSimple Crop Library§r\nThe Fake Farmer is your local Crop lover. Nothing Suspicious about him.\nHe sells crops with bad or decent stats, or some crop related items.§<newPage>§<header;Demolishon Man;true>\n§lBlock:§r §lITNT§r\nThe dust covered Villager is your Explosive Engineer.\nNeed to blow up something? He is the guy!\nSelling All forms of Explosive and broken metal!\nJust make sure to never leave him alone with explosives in your base!§<newPage>§<header;Brewing Master;true>\n§lBlock:§r §lBarrel§r\nThe Drunk Villager is your Brewing Expert!\nSelling all forms of Beer and Whisky.\nReally nice guy to talk to!§<newPage>§<header;Greg;true>\n§lBlock:§r §lPixelfoam GregTech§r\nGreg is... Greg. He was so crazy that we had to turn him into a Villager!\nHe also approved this... Well he only said \"hmmmmmmmmmm\" but that should be a consent...\nRight! Right???\nHe sells CFoam, tools and a few other things.\nJust be careful. Some trades are to good to be true!§<newPage>§<header;Recipes;true>",
  "wiki.ic2.subpage.villager.head": "Villagers",
  "wiki.ic2.subpage.villager.recipes": "Here you find all the recipes to create the Blocks required!",
  "wiki.ic2.subpage.villager_o_mat.body": "The Villager-O-Mat is an automatic trader, that uses identity theft to trade as you!\n\nWhile this does sound bad in the beginning that is actually super useful.\nSince you keep all the useful discounts that the trader will make over time for you.\nOr if you save them, the savior discounts.§<newPage>§<header;Family Friendly Game Mechanics!;true>\nLet's ignore that you were incentivized to cause the situations where villagers needed to be saved!\n\n§l*cough*§r §l*cough*§r De/Zombification to gain discounts §l*cough*§r §l*cough*§r§<newPage>§<header;The UI;true>\n§<image;ic2:textures/wiki/villager_o_mat.png;85>\n§<padding;2>\nThe UI seems to be complex but is rather simple.\nThe bar at the top is stored XP, which is autocollected when a trade is made.§<newPage>§<header;The UI;true>\nThe Villager Selector keeps track of all Villagers that it can find\nand give you all of them to select.\nWhile showing you the XP bars.\n\nThe Villagers that don't have XP bars are \"Categories\" of Villagers, which allow you to mass select them to reduce grind work.§<newPage>§<header;Trade Selection;true>\nThe center piece is basically your trade selector.\nYou simply click on a Trade to disable / enable it.\n\nThe In / Out section is basically telling you where it imports items for trading from and where it exports the trading results too.\nThe output supports Tubes, but not the input.§<newPage>§<header;How does it work?;true>\nThe Villager-O-Mat is a rather slow machine.\nIt attempts to trade only once every minute. But it will try to process every single selected trade at once.\nIf at least a single trade was done, it will charge you 6000EU per selected trade, ignoring if it traded or not.§<newPage>§<header;How does it work?;true>\nThat sounds like really expensive but if you have 20 trades selected, meaning 6000EU, it comes down to 100EU/t that it actually consumed.\nWhich isn't that expensive.\nAnd that doesn't even account for villager only being able to trade twice a day.",
  "wiki.ic2.subpage.villager_o_mat.head": "Villager-O-Mat",
  "wiki.ic2.subpage.wrench.body": "The §<redirect;true;Wrench;ic2:preview.wrench> is a pretty controversial item within IC2Classic.\n\nIt's your only tool to remove machines without losing them.\nIn older versions there was no clear way of what the wrench is doing.\nWhich has been changed to a 3 color overlay.§<newPage>§<header;Blue Overlay;true>\n§<image;ic2:textures/wiki/wrench_blue.png;90>\n§<padding;5>\nThe Blue overlay is for changing the direction of the block.\nThe direction is set based on which side you click on.\n- §lCenter§r: Sets the direction to the side you clicked it on. (Opposite if sneaking)\n- §lLeft§r: Sets the direction to the left side of the clicked direction.\n- §lRight§r: Sets the direction to the right side of the clicked direction.\n- §lBottom/Top§r: Sets the direction to down/up.\n\n\nSo if you are not clicking on the center you are setting the direction based on the side you are going towards to.§<newPage>§<header;Yellow Overlay;true>\n§<image;ic2:textures/wiki/wrench_yellow.png;90>\n§<padding;5>\nThe Yellow overlay is for special actions.\nFor example removing mining pipes from tubes, but it could be for a lot of things.§<newPage>§<header;Red Overlay;true>\n§<image;ic2:textures/wiki/wrench_red.png;110>\n§<padding;5>\nThe Red overlay is for block removal. When removing a machine the side does not matter.§<newPage>§<header;Wrench Removal;true>\n§<image;ic2:textures/wiki/wrench_loss.png;70>\n§<padding;5>\nWhen removing a machine there is not a guaranteed chance that you get the exact block back.§<newPage>§<header;Wrench Removal;true>\nInstead if you are unlucky you get the machine block, of its appropriate tier, back.\n\nOne of the ways to reduce the loss of machine is to enchant your wrench with Fortune.\nThat gives a 10% multiplier, stacking, per level.\nBut crude solutions can get you only so far!\n\nThe other way is to progress through the mod and obtain the §<redirect;true;Electric Wrench;ic2:preview.electric_wrench>,\nwhich has a §l\"lossless\"§r mode.\nThat mode retroactively ensures that the machine is not lost, at a cost of 1 of its very limited uses.\nTo give a bit of lore: You overload the circuitry to achieve a perfect result, but the circuitry can handle only so much.\nLater down the line there is another upgrade that is 100% lossless within the mod.\n\nWhich can be further upgraded since it is only lossless within the mod and not everything.§<newPage>§<header;Controversy;true>\nThis feature has been in controversy,\nsome people really dislike the \"loss\" feature so much that they go past the \"Agree to disagree\".\n\nI made a few changes to this feature, since I like it, to make more accessible.\nBut some people still don't care and would rather choke the feature away.\n\nTo quote TFS Android 16:\n§l\"Your compliance isn't a factor\"§r\n\nSo if you hate it that much, then the mod isn't for you.",
  "wiki.ic2.subpage.wrench.head": "Wrench",
  "wiki.ic2.translated": "",
  "wiki.ic2.translated_by": "Translated By"
}
