{
  "name": "First Ritual",
  "icon": "occultism:textures/gui/book/summoning.png",
  "category": "occultism:getting_started",
  "sortnum": 4,
  "pages": [
    {
      "type": "text",
      "text": "For your first ritual you will summon a spirit known as the $(thing)Ore Crusher$(), which converts ores to dusts, effectively doubling them. You will prepare sacrificial bowls, ritual chalk, craft a book of binding, draw your first pentacle and finally summon the spirit"
    },
    {
      "type": "spotlight",
      "item": "occultism:chalk_white",
      "text": "First, burn Otherstone in a furnace and burn Otherworld Logs in $(thing)Spiritfire$(), then craft the resulting ashes into impure white chalk, and finally purify it once more in $(thing)Spiritfire$(). The chalk can now be used to draw ritual glyphs to form pentacles. View the chapter on pentacles for possible options."
    },
    {
      "type": "text",
      "text": "The type of glyph does not matter, only the color. For decorative purposes you can repeatedly click a block to cycle through glyphs. $(br2)See $(l:pentacles/chalks)Chalk Types$(/l) for more info on chalk."
    },
    {
      "type": "crafting",
      "recipe": "occultism:crafting/brush",
      "text": "The brush can be used to easily remove chalk signs fom the ground."
    },
    {
      "type": "spotlight",
      "item": "occultism:candle_white",
      "text": "Candles provide stability to rituals and are an important part of almost all pentacles. To make candles, kill large animals like pigs, cows or sheep with a Butcher Knife to harvest their fat in the form of tallow and use that to craft candles. $(bold)Candles also act like bookshelves for enchantment purposes.$()"
    },
    {
      "type": "spotlight",
      "item": "occultism:golden_sacrificial_bowl",
      "text": "Craft Otherstone into the shape of a bowl to create a sacrificial bowl. These bowls are used to sacrifice items as part of a ritual and you will need a handful of them. Then take one of the bowls and craft it into a golden sacrificial bowl by surrounding it with gold ingots."
    },
    {
      "type": "text",
      "text": "This special sacrificial bowl is used to activate the ritual by right-clicking it with the activation item, usually a book of binding, once everything has been set up and you are ready to start."
    },
    {
      "type": "spotlight",
      "item": "occultism:purified_ink",
      "text": "In order to craft Books of Binding to summon spirits, you need purified ink. Simply drop any black dye into $(thing)Spirit Fire$() to purify it."
    },
    {
      "type": "crafting",
      "recipe": "occultism:crafting/book_of_binding_foliot",
      "text": "Craft a book of binding that will be used to call forth a foliot."
    },
    {
      "type": "crafting",
      "recipe": "occultism:crafting/book_of_binding_bound_foliot",
      "text": "Add the name of the spirit to summon to your book of binding by crafting it with this guide. The guide will not be used up."
    },
    {
      "type": "text",
      "title": "The Ritual",
      "text": "The ritual is described in $(l:rituals/summoning/summon_crusher)the section on rituals$(/l) but these pages will walk the gentle reader through the process step by step.$(br2)We start by placing the golden sacrificial bowl and drawing the appropriate pentacle, $(l:pentacles/summon_foliot)Aviar's Circle$(/l). $(br2)Next, place four sacrificial bowls close to the pentacle."
    },
    {
      "_comment": "exact duplicate of this is in pentacles/overview.json",
      "type": "image",
      "border": "true",
      "images": [
        "occultism:textures/gui/book/bowl_placement.png"
      ]
    },
    {
      "type": "text",
      "text": "$(thing)Sacrifical Bowls$() must be placed $(bold)anywhere$() within 8 blocks of the central $(thing)Golden Sacrifical Bowl$(). The exact location does not matter.$(br2)Now it is time to place the ingredients you see on the next page in the (regular, not golden) sacrificial bowls."
    },
    {
      "type": "occultism:ritual",
      "recipe": "occultism:ritual/summon_foliot_crusher"
    },
    {
      "type": "text",
      "text": "Finally, right-click the golden sacrificial bowl with the $(bold)bound$() book of binding you created and wait until the crusher spawns. $(br)Now all that remains is to drop appropriate ores near the crusher and wait for it to turn it into dust."
    }
  ]
}