{
  "name": "Base Set",
  "icon": "buddycards:pack.1",
  "category": "buddycards:sets",
  "sortnum": 0,
  "pages": [
    {
      "type": "text",
      "text": "The base set of Buddycards is the most common one you'll find around your world! There are 27 cards in this set in total, but many more when you consider shiny variants and grades. $(br2)In order to get base set cards, you must find base set packs."
    },
    {
      "type": "spotlight",
      "title": "Base Set Packs",
      "item": "buddycards:pack.1",
      "text": "Base set packs can be found in most vanilla structures: mineshafts, villages, dungeons, shipwrecks, buried treasure, and pyramids. $(br2)You can also find packs rarely when killing younger zombies, villagers, and zombie villagers.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "title": "Base Set Cards",
      "item": "buddycards:card.1.1",
      "text": "The base set packs, as with most packs, will give you 4 cards in total, with only one of them being a shiny variant. $(br2)The cards come in four rarities: common, uncommon, rare, and epic. You can tell them apart by the colors of their corners."
    },
    {
      "type": "spotlight",
      "title": "Base Set Cards",
      "item": "buddycards:card.1.26{\"foil\":true}",
      "text": "Cards number 1-12 are common with no colored corners, cards number 13-21 are uncommon with 2 yellow corners, cards number 22-25 are rare with 4 blue corners, and cards 26 and 27 are epics with 2 yellow and 2 purple corners. Both shiny and non shiny cards have the same odds for card rarity."
    },
    {
      "type": "spotlight",
      "item": "buddycards:medal.1",
      "title": "Base Set Medal",
      "text": "The base set medal can be earned by getting all 27 cards, shiny and not shiny, of the base set. When equipped, it will give you Speed I.",
      "link_recipe": true
    },
    {
      "type": "relations",
      "title": "Medal Enchantments",
      "entries": [
        "buddycards:enchantments/buddy_binding",
        "buddycards:enchantments/buddy_boost"
      ],
      "text": "The medal can also be enchanted with Buddy Binding and Buddy Boost. Buddy Boost I will upgrade the medal to give Speed II, and Buddy Boost II will upgrade it to give Speed III."
    }
  ]
}