{
  "flag": "mod:byg",
  "secret": true,
  "name": "Byg Set",
  "icon": "buddycards:pack.4",
  "category": "buddycards:sets",
  "sortnum": 3,
  "pages": [
    {
      "type": "text",
      "text": "The byg set of Buddycards is a trickier one to aquire... You must find four different byg items from around your world. There are 27 cards in this set in total, but many more when you consider shiny variants and grades. $(br2)In order to get byg set cards, you must craft byg set packs."
    },
    {
      "type": "crafting",
      "title": "Byg Set Packs",
      "recipe": "buddycards:byg/byg_pack",
      "text": "You must find these three items hidden around your minecraft world, and combine them with some Buddysteel and another pack. Each item comes from a byg biome in each dimension."
    },
    {
      "type": "spotlight",
      "title": "Byg Set Cards",
      "item": "buddycards:card.4.3",
      "text": "The byg set packs, as with most packs, will give you 4 cards in total, with only one of them being a shiny variant. $(br2)The cards come in four rarities: common, uncommon, rare, and epic. You can tell them apart by the colors of their corners."
    },
    {
      "type": "spotlight",
      "title": "Byg Set Cards",
      "item": "buddycards:card.4.21{\"foil\":true}",
      "text": "Cards number 1-12 are common with no colored corners, cards number 13-21 are uncommon with 2 yellow corners, cards number 22-25 are rare with 4 blue corners, and cards 26 and 27 are epics with 2 yellow and 2 purple corners. Both shiny and non shiny cards have the same odds for card rarity."
    },
    {
      "type": "spotlight",
      "item": "buddycards:medal.4",
      "title": "Byg Set Medal",
      "text": "The byg set medal can be earned by getting all 27 cards, shiny and not shiny, of the byg set. When equipped, it will give you Jump Boost I.",
      "link_recipe": true
    },
    {
      "type": "relations",
      "title": "Medal Enchantments",
      "entries": [
        "buddycards:enchantments/buddy_binding",
        "buddycards:enchantments/buddy_boost"
      ],
      "text": "The medal can also be enchanted with Buddy Binding and Buddy Boost. Buddy Boost I will upgrade the medal to give Jump Boost I & Speed I, and Buddy Boost II will upgrade it to give Jump Boost II & Speed I."
    }
  ]
}