{
  "flag": "mod:create",
  "secret": true,
  "name": "Create Set",
  "icon": "buddycards:pack.5",
  "category": "buddycards:sets",
  "sortnum": 4,
  "pages": [
    {
      "type": "text",
      "text": "The create set of Buddycards is a very easy to collect set, given you have the right machines. There are 27 cards in this set in total, but many more when you consider shiny variants and grades. $(br2)In order to get create set cards, you must craft create set packs."
    },
    {
      "type": "spotlight",
      "item": "buddycards:shredded_buddycard",
      "text": "In order to make create set packs, you must first make shredded Buddycards, you can make these by tossing a Buddycard into crushing wheels, but if you have a few extra packs, you can get more bang for your buck by recycling packs instead of the cards.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "title": "Create Set Packs",
      "item": "buddycards:pack.5",
      "text": "Once you have some shredded buddycards, buddysteel nuggets, and brass plates, throw them into a heated mixer in a ratio of 5:1:1 to make create set packs.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "title": "Create Set Cards",
      "item": "buddycards:card.5.5",
      "text": "The create set packs, as with most packs, will give you 4 cards in total, with only one of them being a shiny variant. $(br2)The cards come in four rarities: common, uncommon, rare, and epic. You can tell them apart by the colors of their corners."
    },
    {
      "type": "spotlight",
      "title": "Create Set Cards",
      "item": "buddycards:card.5.20{\"foil\":true}",
      "text": "Cards number 1-12 are common with no colored corners, cards number 13-21 are uncommon with 2 yellow corners, cards number 22-25 are rare with 4 blue corners, and cards 26 and 27 are epics with 2 yellow and 2 purple corners. Both shiny and non shiny cards have the same odds for card rarity."
    },
    {
      "type": "spotlight",
      "item": "buddycards:medal.5",
      "title": "Create Set Medal",
      "text": "The create set medal can be earned by getting all 27 cards, shiny and not shiny, of the create set. When equipped, it will give you Haste I.",
      "link_recipe": true
    },
    {
      "type": "relations",
      "title": "Medal Enchantments",
      "entries": [
        "buddycards:enchantments/buddy_binding",
        "buddycards:enchantments/buddy_boost"
      ],
      "text": "The medal can also be enchanted with Buddy Binding and Buddy Boost. Buddy Boost I will upgrade the medal to give Haste II, and Buddy Boost II will upgrade it to give Haste III."
    }
  ]
}