{
  "name": "End Set",
  "icon": "buddycards:pack.3",
  "category": "buddycards:sets",
  "sortnum": 2,
  "pages": [
    {
      "type": "text",
      "text": "The end set of Buddycards is quite difficult to find in vanilla, but quite simple in endgame. There are 27 cards in this set in total, but many more when you consider shiny variants and grades. $(br2)In order to get end set cards, you must find end set packs."
    },
    {
      "type": "spotlight",
      "title": "End Set Packs",
      "item": "buddycards:pack.3",
      "text": "End set packs can be found most commonly by killing the dragon, as he is guaranteed to drop a few. $(br2)You can also find packs when raiding end cities, both in chests and rarely as a drop from shulkers.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "title": "End Set Cards",
      "item": "buddycards:card.3.4",
      "text": "The end set packs, as with most packs, will give you 4 cards in total, with only one of them being a shiny variant. $(br2)The cards come in four rarities: common, uncommon, rare, and epic. You can tell them apart by the colors of their corners."
    },
    {
      "type": "spotlight",
      "title": "End Set Cards",
      "item": "buddycards:card.3.27{\"foil\":true}",
      "text": "Cards number 1-12 are common with no colored corners, cards number 13-21 are uncommon with 2 yellow corners, cards number 22-25 are rare with 4 blue corners, and cards 26 and 27 are epics with 2 yellow and 2 purple corners. Both shiny and non shiny cards have the same odds for card rarity."
    },
    {
      "type": "spotlight",
      "item": "buddycards:medal.3",
      "title": "End Set Medal",
      "text": "The end set medal can be earned by getting all 27 cards, shiny and not shiny, of the end set. When equipped, it will give you Resistance I.",
      "link_recipe": true
    },
    {
      "type": "relations",
      "title": "Medal Enchantments",
      "entries": [
        "buddycards:enchantments/buddy_binding",
        "buddycards:enchantments/buddy_boost"
      ],
      "text": "The medal can also be enchanted with Buddy Binding and Buddy Boost. Both levels will clear you of levitation every few seconds, and Buddy Boost II will upgrade your Resistance I to Resistance II."
    }
  ]
}