{
  "flag": "mod:farmersdelight",
  "secret": true,
  "name": "Farmer's Delight Set",
  "icon": "buddycards:pack.7",
  "category": "buddycards:sets",
  "sortnum": 6,
  "pages": [
    {
      "type": "text",
      "text": "The fd set of Buddycards is a set that is not hard to collect, as it is litterally farmable. There are 18 cards in this set in total, but many more when you consider shiny variants and grades. $(br2)In order to get fd set cards, you can find them rarely when breaking crops."
    },
    {
      "type": "spotlight",
      "title": "Buddybeans",
      "item": "buddycards:buddybeans",
      "text": "Buddybeans can also be found rarely when breaking with a buddysteel knife. The beans can be eaten, but it is not reccomended. You need the buddybeans to make fd set packs.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "item": "buddycards:shredded_buddycard",
      "text": "In order to make fd set packs, you must first make shredded Buddycards, you can get these by chopping up your spare cards using a knife and cutting board.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "title": "Fd Set Packs",
      "item": "buddycards:pack.7",
      "text": "Fd set packs have to be cooked with bacon, sugar, 2 shredded cards, and 2 buddybeans. Once it cooks, you must add the sugary substance to a canvas, which will turn into a pack.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "title": "Fd Set Cards",
      "item": "buddycards:card.7.1",
      "text": "The fd set packs, unlike most packs, will give you 3 cards in total, with only one of them being a shiny variant, as well as a buddygummy. $(br2)The cards come in four rarities: common, uncommon, rare, and epic. You can tell them apart by the colors of their corners."
    },
    {
      "type": "spotlight",
      "title": "Fd Set Cards",
      "item": "buddycards:card.7.10{\"foil\":true}",
      "text": "Cards number 1-7 are common with no colored corners, cards number 8-13 are uncommon with 2 yellow corners, cards number 14-16 are rare with 4 blue corners, and cards 17 and 18 are epics with 2 yellow and 2 purple corners. Both shiny and non shiny cards have the same odds for card rarity."
    },
    {
      "type": "spotlight",
      "title": "Buddygummies",
      "item": "buddycards:assorted_gummies",
      "text": "Every fd set pack also comes with an edible buddygummy, a card you can eat. They come in 6 flavors and can be chopped up into assorted gummies on a cutting board with a knife. Assorted gummies replenish the same hunger as normal buddygummies.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "item": "buddycards:medal.7",
      "title": "Fd Set Medal",
      "text": "The fd set medal can be earned by getting all 27 cards, shiny and not shiny, of the create set. When equipped, it will give you Nourished I.",
      "link_recipe": true
    },
    {
      "type": "relations",
      "title": "Medal Enchantments",
      "entries": [
        "buddycards:enchantments/buddy_binding",
        "buddycards:enchantments/buddy_boost"
      ],
      "text": "The medal can also be enchanted with Buddy Binding and Buddy Boost. If you have Buddy Boost, you will get bonus effects while at full hunger. With Buddy Boost I you will get Comfort I, and with Buddy Boost II you get Speed I & Comfort I"
    }
  ]
}