{
  "name": "Nether Set",
  "icon": "buddycards:pack.2",
  "category": "buddycards:sets",
  "sortnum": 1,
  "pages": [
    {
      "type": "text",
      "text": "The nether set of Buddycards is slightly harder to find than the base set, and is found in the nether. There are 27 cards in this set in total, but many more when you consider shiny variants and grades. $(br2)In order to get nether set cards, you must find nether set packs."
    },
    {
      "type": "spotlight",
      "title": "Nether Set Packs",
      "item": "buddycards:pack.2",
      "text": "Nether set packs can be found in most vanilla nether structures in the nether: fortresses, bastions, and ruined portals. $(br2)You can also find packs rarely when killing younger piglins or zombie piglins. Bartering for them is a harder yet safer approach.",
      "link_recipe": true
    },
    {
      "type": "spotlight",
      "title": "Nether Set Cards",
      "item": "buddycards:card.2.12",
      "text": "The nether set packs, as with most packs, will give you 4 cards in total, with only one of them being a shiny variant. $(br2)The cards come in four rarities: common, uncommon, rare, and epic. You can tell them apart by the colors of their corners."
    },
    {
      "type": "spotlight",
      "title": "Nether Set Cards",
      "item": "buddycards:card.2.23{\"foil\":true}",
      "text": "Cards number 1-12 are common with no colored corners, cards number 13-21 are uncommon with 2 yellow corners, cards number 22-25 are rare with 4 blue corners, and cards 26 and 27 are epics with 2 yellow and 2 purple corners. Both shiny and non shiny cards have the same odds for card rarity."
    },
    {
      "type": "spotlight",
      "item": "buddycards:medal.2",
      "title": "Nether Set Medal",
      "text": "The nether set medal can be earned by getting all 27 cards, shiny and not shiny, of the nether set. When equipped, it will give you Fire Resistance I.",
      "link_recipe": true
    },
    {
      "type": "relations",
      "title": "Medal Enchantments",
      "entries": [
        "buddycards:enchantments/buddy_binding",
        "buddycards:enchantments/buddy_boost"
      ],
      "text": "The medal can also be enchanted with Buddy Binding and Buddy Boost. If you have Buddy Boost, you will get bonus effects while on fire. With Buddy Boost I you will get Speed I, and with Buddy Boost II you get Speed I & Strength I"
    }
  ]
}