{
  "comment.ijsalldsajklkslsal": "注：本文件位置没错",
  "blue_skies.blue_journal.turn_page": "翻页",
  "blue_skies.blue_journal.back": "后退",
  "blue_skies.blue_journal.read_page": "阅读此页",
  "blue_skies.blue_journal.tagline": "旅人指南\n由守门人书写",
  "blue_skies.blue_journal.welcome": "这本日记可以帮助新手在永昼之地和恒晓之地的维度中更好生存。如果某样东西有特殊的作用，我可能会在这本书中提到。随着你步步深入，你会发现新的日记条目，所以记得定期翻开看看。我在书的侧面加上了书签来标记个个部分。",
  "blue_skies.section.search": "搜索",
  "blue_skies.section.everbright": "永昼之地",
  "blue_skies.section.everdawn": "恒晓之地",
  "blue_skies.section.general": "常规",
  "blue_skies.everbright.everbright_portal.title": "永昼之地传送门",
  "blue_skies.everbright.everbright_portal.lore": "通往永昼之地维度的入口。这个入口是由绿松石砖制成并需要用御风火石点燃。永昼之地似乎一直是白天，而且很寒冷。这个维度有许多大型厚皮目哺乳动物、大量白雪以及类似魂灵的敌人。特别在下雪时，更多敌人喜欢出来“晒太阳”，因为它们喜欢寒冷的天气。",
  "blue_skies.everbright.brewberry_bush.title": "酿莓丛",
  "blue_skies.everbright.brewberry_bush.lore": "一种在永昼之地发现的草本植物。当它成熟时，会长出酿莓。经过进一步调查，这种灌木长出浆果的类型受到种植的区块的影响，但是有时并不能保证得的到对应的浆果。樱桃草可影响灌木丛，使之长出粉色的酿莓，食用它可获得短暂的再生效果。把灌木丛种在菌丝上似乎能长出黑色的酿莓，这种酿莓对中毒效果有很好的治疗作用。我还发现，在肥沃的土壤上种植灌木，如耕地或灰化土，能让灌木产生更多的浆果。",
  "blue_skies.everbright.snowcap_mushroom.title": "雪帽菇",
  "blue_skies.everbright.snowcap_mushroom.lore": "由于这个维度比主世界要冷得多，所以热源难以找到。然而，我做了一点实验，发现某些植物可以作为燃料使用。最值得注意的是雪帽菇。它吸收热量，使附近的环境变冷。它偶尔可以达到十分寒冷的温度，让熔岩瞬间硬化。事实证明，这种热量可以在熔炉中释放，产生与煤炭类似的火焰。",
  "blue_skies.everbright.snowcap_pinhead.title": "雪帽针菇",
  "blue_skies.everbright.snowcap_pinhead.lore": "雪帽菇的一个变种。它可以被压缩成巨大的蘑菇块。就像雪帽菇一样，它也可以作为燃料使用。",
  "blue_skies.everbright.snowcap_oven.title": "雪帽熔炉",
  "blue_skies.everbright.snowcap_oven.lore": "通过这一发明，我能够利用雪帽菇的加热和冷却能力。通过吸取物体的热量，它可以烧炼放在里面的任何东西，偶尔也会留下燃料的副产品。甚至你可以把水等东西作为燃料，尽管效率不高。",
  "blue_skies.everbright.brumble.title": "龙须藻",
  "blue_skies.everbright.brumble.lore": "这是在永昼之地可以找到的少数海洋植被之一。它朱红的颜色与海洋其他的部分形成了鲜明的对比，看到这样的颜色交织在永昼之地的蔚蓝和神秘之中，是非常有趣的事情。我相信它将会被运用，成为漂亮的建筑材料。",
  "blue_skies.everbright.taratite.title": "碧石",
  "blue_skies.everbright.taratite.lore": "一种光滑的、薄荷色的石头。如果经过打磨，将成为一种不错的建筑材料。",
  "blue_skies.everbright.rimestone.title": "寒石",
  "blue_skies.everbright.rimestone.lore": "一种粗糙的冰质石头。如果经过打磨，将成为一种不错的建筑材料。",
  "blue_skies.everbright.ventium.title": "镰鼬铁",
  "blue_skies.everbright.ventium.lore": "一种红色的金属，可以在永昼之地的大多数非山区生物群落中找到。在这个维度里，它似乎承担着与铁相当的作用。镰鼬铁可以用来制造桶、剪刀和工具盒等东西。",
  "blue_skies.everbright.falsite.title": "缪铁",
  "blue_skies.everbright.falsite.lore": "这种奇特的金属可以在永昼之地的非山区生物群系中找到。它具有神秘的特性，你可以通过操作工具盒来加强永昼、恒晓两个维度几乎所有工具的耐久度。",
  "blue_skies.everbright.pearl.title": "珍珠",
  "blue_skies.everbright.pearl.lore": "从海蛎子的嘴里获得。这颗闪亮的珍珠有某种奇特的属性。大多数敌人都不喜欢我举着它。我也许能把它和缪铁结合起来，创造出更强大的东西。",
  "blue_skies.everbright.warding_pearl.title": "守护珍珠",
  "blue_skies.everbright.warding_pearl.lore": "通过将一颗珍珠、一片魂魄碎片与缪铁结合起来制造这个东西，它能够防止敌对生物在大范围内出现。它在这个维度里很有帮助，因为像月长石这样的光源并不能像在主世界那样防止敌对生物出现。",
  "blue_skies.everbright.soul_fragment.title": "魂魄碎片",
  "blue_skies.everbright.soul_fragment.lore": "一种邪恶魂魄的碎片。在永昼之地所有幽灵形态的敌人中十分常见。当我有了珍珠、一些缪铁时我就能利用它的力量。可能它还有更多的用途我没有发现。",
  "blue_skies.everbright.azulfo_horn.title": "阿祖福牛角",
  "blue_skies.everbright.azulfo_horn.lore": "壮硕的阿祖福牛的角。就像骨头一样，我能够用这些角制造骨粉。这让我的耕作效率大大提高。",
  "blue_skies.everbright.summoning_table.title": "召唤台",
  "blue_skies.everbright.summoning_table.lore": "在探索了惑乱高塔之后，我成功地得到了一个召唤台和一本召唤之书。有了这些，我就能改变召唤物。我可以选择发射一个波动球体，或者召唤一只人造傀儡协助我。",
  "blue_skies.everbright.soulbound_spear.title": "缚魂之矛",
  "blue_skies.everbright.soulbound_spear.lore": "当我探索惑乱高塔的时候，我发现了一把缚魂之矛。这根矛的功能似乎和普通的矛一样，但是它在被投掷后总是会回到我身上。在对付这个世界上的大多数敌人时，这根矛可能会派上用场。",
  "blue_skies.everbright.summoning_tome.title": "召唤之书",
  "blue_skies.everbright.summoning_tome.lore": "在惑乱高塔里，我找到了许多有用的工具，其中包括一本召唤之书。这本书让我能够抵御住召唤师的一些攻击。我可以使用它召唤出一个波动球体。球体有一个攻击范围，在此范围内的敌人都会受到攻击。然而，当我在召唤台上研究这本书时，我惊奇的发现它还有另一种能力！我可以使用它召唤出一只人造傀儡，让它与自己并肩作战。不过，这似乎是暂时的，只能维持一分钟左右，所以我最好把握使用它的时机！",
  "blue_skies.everbright.nature_dungeon.title": "自然城堡",
  "blue_skies.everbright.nature_dungeon.lore": "我设法在被雪掩盖的树林中穿行，偶然发现了一座巨大的绿色城堡。进去之后，居民向我“打了招呼”。他们似乎是完全由该结构的石头聚合而成的巨像，被星荧藤蔓捆绑在一起。当我攀登接近城堡的顶部时，我才意识到这座建筑的质量在不断提高！底层的建筑已非常陈旧——岩石破裂、被风化。而上层几乎处于早期的状态。这里的每层似乎都有一把城堡钥匙。我想，就像惑乱高塔一样，在最高处有钥匙孔。然而，由于某些原因，我可能不会亲自去验证。但我决定把这个巨大的结构称为§o自然城堡§r。",
  "blue_skies.everbright.crushing_hammer.title": "破碎之锤",
  "blue_skies.everbright.crushing_hammer.lore": "这把锤子似乎是星荧粉碎者的一部分！它的威力就如同星荧粉碎者一样——有抨击地面的力量。当我使用它时，它产生了范围伤害，使敌人高高震！这是我最喜欢的。这东西也有相当大的威力，能造成大量的近战伤害，不过它似乎很重。",
  "blue_skies.everdawn.everdawn_portal.title": "恒晓之地传送门",
  "blue_skies.everdawn.everdawn_portal.lore": "通往恒晓之地维度的入口，这个入口是由明月石砖制成并需要用御风火石点燃。这个世界总是炎热且潮湿，时间定格在日出时分。昆虫在这里肆意繁殖，尤其是在下雨的时候，更多的昆虫会外出觅食。这些昆虫已经长到了十分可怕的体型，有的已经是我身体一半大小！这里的雨似乎没那么大，通常只是微微细雨。这里的动物大多是爬行动物，只有少数例外。",
  "blue_skies.everdawn.baneful_mushroom.title": "邪恶菇",
  "blue_skies.everdawn.baneful_mushroom.lore": "我总是小心翼翼地在阴暗林地里探索。这次我发现了一只看似无害的紫色蘑菇，但经过仔细观察，我发现它具有毒性。当有人接触它时，它会散发出有毒孢子作为自身防御机制。我应当谨慎，避免接触这种蘑菇。",
  "blue_skies.everdawn.crystal_flower.title": "水晶花",
  "blue_skies.everdawn.crystal_flower.lore": "这种花的结构很奇妙。它在某种程度上是水晶和植物的混合体。进一步研究，如果用骨粉之类的东西施肥的话，也许它能够长成一棵树！",
  "blue_skies.everdawn.spider_webbing.title": "蜘蛛网纹",
  "blue_skies.everdawn.spider_webbing.lore": "一种有趣的蛛网。与普通的蛛网不同的是它可以附着在角落，但只能与同类型的连接。",
  "blue_skies.everdawn.crescent_fruit.title": "新月果",
  "blue_skies.everdawn.crescent_fruit.lore": "由于气候温暖，恒晓之地能够孕育出一些颇具热带特色的果实，像是新月果。我发现这种果实可以长在任何新月果叶上，只要叶子开花，就可以无限地采摘。",
  "blue_skies.everdawn.sunstone_crystal.title": "日长玉石",
  "blue_skies.everdawn.sunstone_crystal.lore": "这些晶体摸起来很热而且发出橙光。它们可以作为任何熔炉的燃料，也可以为炙铁熔炉供能。这些晶体可以在落日枫林和灼热草原的深处找到。",
  "blue_skies.everdawn.horizonite_forge.title": "炙铁熔炉",
  "blue_skies.everdawn.horizonite_forge.lore": "终于完成了！我可以利用炙铁内部的能量了！有了这个，我就能在没有任何燃料的情况下烧炼东西。只要等待，它就会自己充能，当然也可以用由炙铁组成的物品来瞬间充能。我还可以使用日长玉石来充能。但不足的是，熔炉只有在没烧炼东西的情况下才会充能。所以制作多个这样的熔炉可以提高效率。",
  "blue_skies.everdawn.cinderstone.title": "余烬石",
  "blue_skies.everdawn.cinderstone.lore": "这种类似岩浆硬化后的石头可以作为相当不错的建筑材料。我相信它也可以被打磨得更漂亮。",
  "blue_skies.everdawn.umber.title": "焦石",
  "blue_skies.everdawn.umber.lore": "一种光滑的棕色石头。它可以被打磨成更加光滑的建筑材料。",
  "blue_skies.everdawn.crystallized_tree.title": "水晶树",
  "blue_skies.everdawn.crystallized_tree.lore": "这种树具有令人难以置信的奇怪特性。它不能被制成木棍，也不会燃烧。树干似乎完全由水晶制成，甚至有些透明。凭借这样的特性，我可以利用这种原木制成的墙来代替栅栏。由于这种树并不长出真正的树叶，所以并不能获取树苗。我发现如果对着水晶花使用骨粉，它可以长成一棵完整的树。",
  "blue_skies.everdawn.horizonite.title": "炙铁",
  "blue_skies.everdawn.horizonite.lore": "我不敢相信这种在水晶沙丘中发现的炙热的金属居然没被熔化！我不知道它是如何储存这么多热量的。我发现用它制造的任何工具都可以直接烧炼矿石！我还能够用这些东西制造一个熔炉，我称之为炙铁熔炉。",
  "blue_skies.everdawn.moonstone_shield.title": "月长石盾牌",
  "blue_skies.everdawn.moonstone_shield.lore": "这个盾牌比普通的木制盾牌更耐用，它还具有像原生月长石一样的透明外观，让你可以透过它看东西。",
  "blue_skies.everdawn.fox_pelt.title": "狐皮",
  "blue_skies.everdawn.fox_pelt.lore": "杀死宇宙狐获得，可用于制作骆驼鞍和赃物袋。",
  "blue_skies.everdawn.spike_shield.title": "尖刺盾牌",
  "blue_skies.everdawn.spike_shield.lore": "探索了恒晓之地的惑乱高塔后，我获得一个尖刺盾牌。这个盾牌比木制盾牌和月长石盾牌更耐用。并且它似乎有额外的近战伤害，所以它可以兼作较弱的武器。",
  "blue_skies.everdawn.alchemy_table.title": "炼金台",
  "blue_skies.everdawn.alchemy_table.lore": "在我探索恒晓之地的惑乱高塔期间，我拿到了一张炼金台。我可以使用它来将一些最原始的恒晓之地材料转化为永昼之地的材料，反之亦然。很显然这在建筑时特别有用。当我有足够的明月石，我可以把它们转化为绿松石。我也可以把石头和我的饰品转化成地牢石头。我确信这将适用于其他饰品，要是我有它们就好了…",
  "blue_skies.everdawn.alchemy_scroll.title": "炼金术卷轴",
  "blue_skies.everdawn.alchemy_scroll.lore": "在探索了恒晓之地的惑乱高塔之后，我发现了一个炼金术卷轴。使用这个我可以模仿炼金师的腐朽尖刺攻击。无论我指向哪里，它都会在我上方的一条线上生成掉落的尖刺。我还可以通过蹲伏来使用另一种攻击，这会在我旁边产生面朝上的尖刺，将近距离的敌人从我身边击退。",
  "blue_skies.everdawn.poison_dungeon.title": "猛毒地牢",
  "blue_skies.everdawn.poison_dungeon.lore": "在探索落日枫林的过程中，我找到了一棵长相诡异的树。它的树干上缠绕着蛛网。令我惊讶的是，树洞里面竟然是一个巨大的蜘蛛巢！这个地方是许多毒蜘蛛的领地。我也很惊讶地看到主世界的洞穴蜘蛛居住在这个巢穴里。这里的每一层中有一把地牢钥匙，就像惑乱高塔一样，在地牢尽头处有一个钥匙孔。我听到这个地方的大厅里似乎有很响亮的嘶嘶声，我无法想象里面是什么…我称这个地方为§o猛毒地牢§r。",
  "blue_skies.everdawn.venom_sac.title": "毒刺",
  "blue_skies.everdawn.venom_sac.lore": "在穿过猛毒地牢之后，我获得了毒刺。有了这个，我可以使用它像幽咽蛛王一样喷出毒液。弹射物造成的伤害很小，但它可以使敌人中毒。",
  "blue_skies.everdawn.different_sword.title": "奇异之剑",
  "blue_skies.everdawn.different_sword.lore": "一把非常有趣的剑，快速挥砍是它的优点。这把武器似乎是为了尽快杀死目标而设计的。如果我在击中目标后等待太久，它们会恢复比我造成的伤害更多的生命值，所以要避免用这把剑来攻击大型生物。",
  "blue_skies.general.blinding_dungeon.title": "惑乱高塔",
  "blue_skies.general.blinding_dungeon.lore": "在我的旅行中，我找到一种巨大的塔式结构。我决定将其称为§o惑乱高塔§r。这个高塔好像有两种版本，一种在永昼之地，一种在恒晓之地。两者都是灾厄村民的营地。召唤师驻扎在永昼之地，炼金师驻扎在恒晓之地。这两个高塔内，可通过在惑乱钥匙孔上使用四把惑乱钥匙到达顶层。我本人不打算与他们中的任何一人进行过多的斗争。",
  "blue_skies.general.moonstone.title": "月长石",
  "blue_skies.general.moonstone.lore": "在两个世界的地下都可以找到，它似乎只是一种可利用的光源。它可以在水下发光，并且可以制成更大的可以发光的方块。我在这些世界的一些洞穴中还发现了变体，就像日长玉石那样，虽然没有什么特别之处，但看起来很漂亮。",
  "blue_skies.general.pyrope.title": "榴石",
  "blue_skies.general.pyrope.lore": "这种宝石可以在两个世界中任何一个世界的地下找到。用这种材料制作的工具似乎很轻，所以我可以很快地恢复状态使用它们。不过这些工具似乎不是很耐用，所以我最好谨慎使用它们。",
  "blue_skies.general.aquite.title": "水蓝石",
  "blue_skies.general.aquite.lore": "这种水蓝色矿物所制成的工具和盔甲似乎与主世界铁制的相似。在一些测试的基础上，它看起来不错的。",
  "blue_skies.general.diopside.title": "透辉石",
  "blue_skies.general.diopside.lore": "一种尖锐的、呈水晶状的、黄绿色的宝石。我在两个世界的地下深处都发现了它。这种材料制成的盔甲和工具§o非常§r坚固耐用。这些工具因沉重而有力，会对我击中的任何目标造成极大的伤害。不过需要注意的是，它们很重，比大多数工具更难挥动。所以在处理快速移动目标时，我必须更小心。这套工具和盔甲可以与绛紫晶媲美——虽挥动速度较慢但更强大。",
  "blue_skies.general.charoite.title": "绛紫晶",
  "blue_skies.general.charoite.lore": "一套更均衡的盔甲和工具，在大多数方面类似于钻石。这套工具和盔甲与透辉石媲美，是一种更快但更弱的替代品。",
  "blue_skies.general.star_emitter.title": "星辰放射台",
  "blue_skies.general.star_emitter.lore": "通常可以从观星者处获得，通过星盘可以使用这个有趣的装置。使用星盘会将星辰放射台的位置设置为传送点，让你可以传送到它的位置。",
  "blue_skies.general.trough.title": "料槽",
  "blue_skies.general.trough.lore": "一个简单的料槽。如果动物靠近这个，它们就有可能吃掉里面的食物。当动物从料槽中吃东西时，它们会更快地生长。它可以装满大多数动物繁殖物品，如胡萝卜、土豆、鳞果和褐松果。如果村民决定使用料槽，他们将成为牧人。",
  "blue_skies.general.tool_box.title": "工具盒",
  "blue_skies.general.tool_box.lore": "这个工作台可用于增强和升级工具。缪铁可以用来提高这个世界中的所有工具的耐久度。还有一个发现是这两个世界的任何木棍都可以替换工具中的木棍。所有的木棍都有不同的用途，我得看看每种木棍适合用在怎样的工具上。",
  "blue_skies.general.bag_of_spoils.title": "赃物袋",
  "blue_skies.general.bag_of_spoils.lore": "一个可以装任何东西的小袋子。它至多可存放5种物品。我发现我可以通过蹲伏并在村民不注意的情况下使用它来偷窃。似乎如果他们看到我这么做，会相当不高兴，村里的铁傀儡甚至攻击了我。我唯一不会也不能偷窃的村民是守夜人，因为是他把袋子给了我。",
  "blue_skies.general.food_prep_table.title": "小灶",
  "blue_skies.general.food_prep_table.lore": "为更好的食物而制作的工作台。它最多可以容纳5种食物材料，最少3种材料。通过搭配许多独特的食材，我能够做出比平时更香的食物。材料越丰富，这份餐的份量就越多。知道这一点，肉类拌饭似乎是上好的佳肴。\n\n将花草作为一种调味料加入拌饭似乎可以发挥其潜在的药水效果。我听说主世界的人叫它迷之炖菜，不过我觉得我的方法更胜一筹。\n\n为了获得更持久或更有效的效果，药水也可以像酱汁一样加入拌饭里。虽然似乎只能加入一种，但是不会造成不稳定…\n\n通过实验，我发现加入酿莓可以增强药水效果，延长其持续时间。所以只使用赋予效果的材料来制作一份拌饭是可行的。这样不会吃得很饱，某些情况下也正是我所需要的。如果我能找到一朵能让我的食物更好的花那就好了。",
  "blue_skies.general.astrolabe.title": "星盘",
  "blue_skies.general.astrolabe.lore": "通过与村子里的一位观星者交易，我得到这个有用的物品。通过将这个物品与星辰放射台结合使用，我可以在世界范围内进行短距离传送。当然，这是有代价的，因为星盘会根据我传送的距离进行时间冷却。",
  "blue_skies.general.spears.title": "矛",
  "blue_skies.general.spears.lore": "一种非常有用的工具，用于从远处投掷来伤害目标。它是主世界的三叉戟和弓的混合体，制造成本低，也可在水下使用。我发现矛可以被附魔上忠诚和穿透等。",
  "blue_skies.everbright.azulfo.title": "阿祖福牛",
  "blue_skies.everbright.azulfo.lore": "永昼之地规模最大的动物群。我在旅途中发现了很多这种生物。它们组成很庞大的牛群，并且会跟随一位首领。狩猎它们可能非常困难，因为与主世界的动物不同，它们不会坐以待毙。事实上，当你攻击一只牛时，整个牛群都会被激怒。我发现矛是用来猎杀它们的最有用的工具。",
  "blue_skies.everbright.stardust_ram.title": "星尘羊",
  "blue_skies.everbright.stardust_ram.lore": "永昼之地最常见的动物群。这些毛茸茸的生物与主世界的绵羊非常相似。你可以剪下它们的羊毛，也可以猎杀获取羊肉。",
  "blue_skies.everbright.reindeer.title": "雪鹿",
  "blue_skies.everbright.reindeer.lore": "雪鹿是我在永昼之地发现的最有用的动物之一。它们可以用褐松果驯服，并配备鞍。它们会以适中的速度奔跑，并且可以跳跃大约2个方块高。我只在开阔的多雪地区找到这种动物，例如极昼之地和覆雪松林。你也可以猎杀它们来获得鹿肉，但由于它们比较稀少，我通常会避免这样做。",
  "blue_skies.everbright.snow_owl.title": "雪鸮",
  "blue_skies.everbright.snow_owl.lore": "这些发出悦耳声音的生物能在霜冻森林中找到。它们通常生活在生物群落中树木的上部。它们的鸣叫声可以从很远的地方听到，这增加了霜冻森林的神秘感。",
  "blue_skies.everbright.grittle_flatfish.title": "深板比目鱼",
  "blue_skies.everbright.grittle_flatfish.lore": "作为海洋中最独特的鱼类之一，深板比目鱼非常胆小。它往往很容易受到惊吓，攻击靠近的任何人，并在不久之后逃跑。它的攻击并不痛，但每当我不小心吓到它时，我都会感到些许愧疚。但别说，这种鱼是真香，比任何其他鱼都更好吃。",
  "blue_skies.everbright.armored_frost_spirit.title": "裹冰霜灵",
  "blue_skies.everbright.armored_frost_spirit.lore": "裹冰霜灵是我在旅途中发现的最常见的敌人之一。这些生物并不像它们看起来的那样，它们或许是好斗和易怒的，但事实上在冰层外壳之下的是一只弱小无助的小霜灵。一旦冰层破裂，它就会试图逃跑，可能会躲避你对它的大部分攻击。当它被杀死时，你会得到一两片魂魄碎片。我发现镐子对裹冰霜灵会造成更大的伤害，特别在战斗刚开始的时候。",
  "blue_skies.everbright.crynocerous.title": "冰晶犀牛",
  "blue_skies.everbright.crynocerous.lore": "我并没有经常看到它们，冰晶犀牛似乎是一种更大、更强的裹冰霜灵变种，它们具有许多类似的特点。冰晶犀牛的攻击范围和力量都比裹冰霜灵要高。我只能在白雪皑皑的环境中找到这种野兽，比如极昼之地。就像冰霜之灵一样，用镐子对它造成的伤害更高。",
  "blue_skies.everbright.polargeist.title": "极地雪熊",
  "blue_skies.everbright.polargeist.lore": "在旅途中，我遇到了一只幽灵熊。这种生物速度惊人，大多数情况下跑得比我快。它的腹部挂着冰锥，长着冰做的獠牙。攻击时，它会站立起来，猛击目标。我发现如果你能很快地击退它，它就不会攻击，因为它需要时间才能站起来。",
  "blue_skies.everbright.whistleshell_crab.title": "哨兵蟹",
  "blue_skies.everbright.whistleshell_crab.lore": "这种大型螃蟹生物能够在陆地和水中移动。它的钳子看起来像一张长满尖锐牙齿的嘴巴。在陆地上，它移动得非常快，我几乎没有时间逃跑。但是虽然它们速度很快，攻击距离却不远，所以在陆地上可以很容易闪避它的攻击。在水中，它的速度要慢一些，但在海床上移动时会冲刺，所以在水中解决它最好的方法是保持一定的高度。",
  "blue_skies.everbright.shrumpty.title": "雪帽蘑菇人",
  "blue_skies.everbright.shrumpty.lore": "很多时候，当我探索雪帽菇地时，我会被一只雪帽蘑菇人吓到。这些鬼鬼祟祟的东西伪装成雪帽蘑菇，并在外来者靠近时发动攻击。接触它们会感到寒冷，并且伴随着冻结并减速。当它们攻击时还会发出阵阵诡异的笑声，这非常奇怪…",
  "blue_skies.everbright.diophyde_prowler.title": "徘徊雪狼",
  "blue_skies.everbright.diophyde_prowler.lore": "在永昼之地所面对的众多敌人中，没有一个的攻击方式类似徘徊雪狼。它会环绕猎物奔跑，并且在适当的时候猛扑过来。我发现躲避它攻击最简单的方法是朝着它移动的相反方向攻击。它的速度太快了，因此逃跑没有意义，与其搏一搏才更值得。我还发现盾牌可以阻挡它的攻击，给予我反击的时间。",
  "blue_skies.everbright.seclam.title": "海蛎子",
  "blue_skies.everbright.seclam.lore": "当我漫游永昼之地的深海时，我遇到一只海蛎子。这种安静的生物根本不动，只是炫耀它自己珍贵的珍珠。每当捕食者接近它时，它就会合上嘴，防止任何生物偷走它的珍珠。我发现在攻击它几次后，它的嘴会张开，我就可以安全地从它嘴里取出珍珠。但我必须小心，如果我的动作太慢，它就会靠近我，并造成大量的伤害。",
  "blue_skies.everbright.stonelet.title": "石人",
  "blue_skies.everbright.stonelet.lore": "在我探索自然城堡期间，我遇到了这些看起来很奇怪的敌人。它们是城堡的守护者，攻击任何胆敢闯入其中的人。和霜灵类似，这种生物受到镐子的伤害比其他武器都多。知道了这一点，我就可以轻松地探索城堡了。",
  "blue_skies.everbright.spewter.title": "吐射花",
  "blue_skies.everbright.spewter.lore": "在探索自然城堡的过程中，我发现了这些生长在顶层花园中有趣植物。每当我接近它们时，它们就会向我吐射种子炸弹，所以我必须保持距离。",
  "blue_skies.everbright.summoner.title": "召唤师",
  "blue_skies.everbright.summoner_pre.lore": "在永昼之地惑乱高塔的顶端，我和一位穿着紫色斗篷的人发生了争斗。他用魔力召唤了由地牢之石构成的傀儡。我发现大多数时候当我接近他时，他会将自己传送到房间的另一边。然而，如果他碰巧在施法，我便可以安全接近，并攻击他。我的探索高塔的旅途被这位强大的巫师打断了，我不得不尽早的逃跑。",
  "blue_skies.everbright.summoner_post.lore": "结合我自己的一手资料和当地人的故事，我终于可以更详细的描述这位被称呼为“召唤师”的巫师了。这位巫师住在永昼之地惑乱高塔的顶层。与炼金术士不同，他会召唤傀儡为他战斗。首先他使用魔法召唤傀儡，向胆敢踏进高塔顶层的人发射子弹。然后是几个近战的傀儡也开始攻击。这些傀儡被称为人造傀儡。我个人倾向于让这些人造傀儡留在那儿。如果在召唤师没有施法的情况下接近他，他也会传送到安全的地方。了解这些后，通过击败一些傀儡，召唤师在召唤更多傀儡的同时让自己暴露而被攻击。对于通常召唤师使用称为波动球的魔法球来攻击任何可能靠近他的敌人。必须知道的一点是，如果在他施放球体时靠得太近，他将释放强大的诡异闪电，产生鬼火。在学习并整理所有这些信息后，我不禁想起我以前竟与他交手过。",
  "blue_skies.everbright.starlit_crusher.title": "星荧粉碎者",
  "blue_skies.everbright.starlit_crusher_pre.lore": "我只听说过传说中的自然城堡守护者的传闻。他们说守护者用巨大的木墙保护自己，并且可以召唤其他类似植物的敌人来帮助它战斗。我听说人们发现能伤害它的唯一方法是向它掷尖锐的东西，比如长矛。如果是我，我肯定带着斧来砍它。",
  "blue_skies.everbright.starlit_crusher_post.lore": "我终于对星荧粉碎者有了足够的了解！我了解到它在战斗中会立起4堵木墙来保护自己免受任何攻击。当木墙竖起时，星荧粉碎者会长出树根、吐射花和星荧雪鸮等来协助它进行战斗。一旦受到足够的伤害，它的的根就会变大。一旦其中一堵墙被摧毁，它就会开始愤怒地捶打地面，让自己暴露在攻击下，例如长矛。一旦它被击晕，它可以被用任何武器攻击，据说斧是击败它的理想选择。",
  "blue_skies.everdawn.cosmic_fox.title": "宇宙狐",
  "blue_skies.everdawn.cosmic_fox.lore": "宇宙狐是我在恒晓之地中发现的最小的动物之一。我想在更开阔的地区找到了这种小动物，比如灼热草原和诡异山谷。我能够使用新月果驯服这只家伙，这样无论我走到哪里，它都会跟着我，甚至听从我的命令！",
  "blue_skies.everdawn.crystal_camel.title": "水晶骆驼",
  "blue_skies.everdawn.crystal_camel.lore": "美丽的水晶骆驼。这种令人难以置信的生物仅生活于沙漠生物群系中，它在沙漠中漫步，享受该地区的热量。我发现它喜欢吃褐松果，我可以用此驯服一只。在制作了骆驼鞍之后，我就可以骑上它了。我发现我可以在它的背上挂一只箱子，这样就可以轻松携带很多物品。但是骆驼并不是跑得最快的动物，所以我只能骑着它以较慢的速度移动。",
  "blue_skies.everdawn.shade_monitor.title": "岩蜥",
  "blue_skies.everdawn.shade_monitor.lore": "作为恒晓之地中最常见的动物，它们看起来是大多数人主要狩猎选择。它们可能到达的适应任何区域，根据生物群落具有不同的伪装外观。但是，如果你试图猎杀这种动物时，请注意，因为它们不会不战而退！虽然它们没有极昼之崖的阿祖福牛那么强大，但它们仍会造成相当多的伤害。",
  "blue_skies.everdawn.crogre.title": "克罗格蛙",
  "blue_skies.everdawn.crogre.lore": "克罗格蛙，我的最爱。一种几乎完全生活在月耀潭中的巨型青蛙。它们跳得非常高——大约4-5个方块的高度。恒晓之地的巨型昆虫似乎不太喜欢这个家伙，通常一靠近就会逃跑。我发现克罗格蛙可以被虫子驯服。喂食之后，我可以装上鞍并骑上它！我发现在水上也可以骑它，这样我就可以轻松地穿越沼泽和湖泊了！",
  "blue_skies.everdawn.nyctofly.title": "夜凌蜻蜓",
  "blue_skies.everdawn.nyctofly.lore": "夜凌蜻蜓是我在恒晓之地时遇到的最大的问题之一。这种会飞的昆虫生活在树木繁茂的地区，例如阴暗林地。它的视觉非常敏锐，能够从很远的地方看到目标。每当我听到它振翅的声音时，我就知道是时候要与之对战了。根据我的经验，在开阔的地方对战会困难得多，所以我建议选择在狭小的空间里。",
  "blue_skies.everdawn.venom_spider.title": "猛毒蜘蛛",
  "blue_skies.everdawn.venom_spider.lore": "猛毒蜘蛛是我在恒晓之地中面对的常见敌人之一。它们往往非常聪明，会根据你所在的位置改变它们的攻击策略。如果我选择正面攻击它，那么它会试图用毒牙咬我。如果我与之保持距离，它就会向我吐射毒液。在与这种生物战斗时，一块盾牌在大多数情况下都很有用处。",
  "blue_skies.everdawn.emberback.title": "余烬虫",
  "blue_skies.everdawn.emberback.lore": "在你不了解这种巨大的甲虫生物的情况下进行战斗是很有难度。余烬虫会径直飞向目标。一旦靠近，它就会下降，从甲壳中喷出炙热的气体。这种昆虫非常聪明，可以知道你是否使用了抗火药水，并且它会以较低的伤害输出咬你。对付这种昆虫的一种简单方法是使用盾牌，或者将它们引诱到水中。",
  "blue_skies.everdawn.infested_swarmer.title": "异化蚂蚁",
  "blue_skies.everdawn.infested_swarmer.lore": "这种罕见的昆虫只能在地下在或者晶体地区找到，例如水晶草原。地面上的其他地区很少出现。这些巨型蚂蚁没有太多的战斗方式，但它们以速度和体型为优势。我为它们身上发生的变异感到难过。",
  "blue_skies.everdawn.nested_spider.title": "巢穴蜘蛛",
  "blue_skies.everdawn.nested_spider.lore": "在我探索完猛毒地牢后，我遇到了像蜘蛛巢穴一样的地方。我偶尔会看到一只巢穴蜘蛛露出头来，所以我认为这应该是小蜘蛛们休息的地方。",
  "blue_skies.everdawn.alchemist.title": "炼金师",
  "blue_skies.everdawn.alchemist_pre.lore": "在恒晓之地的惑乱高塔顶部，我和一个穿着红色斗篷的人发生了战斗。他使用魔法变出了箭，聚合岩石变成尖刺。盾牌可以轻易挡住箭束。他在房间的角落处形成有药水效果的云体，这是他给自己留的退路。我注意到，那些看上去压根挡不住的攻击，实际上都很容易闪开。他最强的攻击方式似乎是使用尖刺刺击，因为它们可以穿透盔甲。这场短暂的战斗对我很不利，所以在我还没了解他更多之前我不得不逃跑。",
  "blue_skies.everdawn.alchemist_post.lore": "在听了当地人的故事后，我对炼金术士有了更多的了解。这个巫师驻扎在恒晓之地的惑乱高塔顶层。与永昼之地惑乱高塔顶层的召唤师不同，炼金术士本人会进行大部分战斗，投掷抛射物，并使用药水云等造成范围伤害。与召唤师类似，炼金术士会通过传送来避免被伤害。然而，他在施法时无法传送，这意味着每次他攻击的时候都是他最脆弱的时候。\n\n先说说抛射物，在我自己的战斗中，我发现腐朽尖刺可以穿透盔甲，造成相当高的伤害。但对于炼金术士来说，这些尖刺很容易躲避。如果你快速接近他，尖刺会从他的周围向上生成。对于其他的抛射物，炼金术士会使用箭。这些箭有着很大的冲击力，可以把你击退很远。据当地人说，炼金术士血量越低，他就更有可能释放火焰。庆幸的是，大部分战斗房间里都有喷泉。然而，这可能会有所不同，因为我还没有提到炼金师的另一个能力，流体转换。炼金术士能够将水转化为熔岩，反之亦然。如果你准备用熔岩杀死他，这个技能可能会改变战斗局势。\n\n现在我要讲炼金师会做的最后一件事。他可以让处于房间中的所有人暂时失明，传闻说这只会持续很短的时间，所以我不用太担心。最后，他会在虚弱时治愈自己。由于他一直处于可能被攻击的状态，只要有适当的武器，他的治疗效果就会失去作用。当我听完了这些故事在整理信息时，我不禁想起我以前见过这个人。",
  "blue_skies.everdawn.arachnarch.title": "幽咽蛛王",
  "blue_skies.everdawn.arachnarch_pre.lore": "我听说过一些关于这种巨型蜘蛛的传说，我害怕面对它。据我所知，它会在下落时利用其巨大的体型向目标进行冲击。根据从恒晓之地中大多数捕猎者处学到的知识，盾牌在与它对战时很有用处。我还听说，这只蜘蛛与世界上的大多数巨型蜘蛛不同的是它能够爬上天花板来避免大多数攻击。",
  "blue_skies.everdawn.arachnarch_post.lore": "有了一些新信息，我终于可以写一篇关于幽咽蛛王的完整介绍了。这个令人毛骨悚然的蜘蛛能够在天花板上爬行，这使其可以避免大多数攻击。如果这是真的，我建议要拖延时间，直到它不再在天花板上。当下落时，我还听说它可以利用其巨大的体型冲击目标。与大多数恒晓之地的敌人战斗时一样，我会使用盾牌来防御这样的攻击。据我所知，与盾牌的碰撞会导致它眩晕一段时间，使其容易受到攻击。"
}