{
    "name": "The Nature of Groves",
    "icon": "roots:grove_stone",
    "category": "basics",
    "advancement": "roots:root",
    "sortnum": 7,
    "pages": [
      {
        "type": "text",
        "text": "$(o)Extract from the writings of the Archdruid of the Silvered Glade, 0 AC:$()$(br2)... these large gateways previously used have been closed completely. Whether this is a result of the continued drifting of the realms or a distinct shutting down of diplomacy, the result is that trade with the Fey directly is no longer possible."
      },
      {
        "type": "text",
        "text": "The fey, well-known for curiosity, are ever interested in strange new worlds, such as our own. The most curious are also the smallest, and these motes of life & energy have found their way through the tiniest gaps and spaces. This proves that there are ways and potentially no major barriers.$(br2)Whether this can be leveraged or not remains..."
      },
      {
        "type": "text",
        "text": "$(o)Extract from the notes of the Master of Crafting, 241 AC:$()$(br2)... The combination of plentiful moss with our dwindling supply of wildroot have proven sufficient to imbue the correctly-shaped monolith, and allow it to act as an anchor for the Fey. The slightly larger spirits magnetized to this provide enough energy for a specially-created imbuer.$(br2)This current process is rough and simple, and much refinement..."
      },
      {
        "type": "text",
        "text": "$(o)Notes from the Grovespeaker Allura Vysoren, 286 AC:$()$(br2)... curious side-effect of the monolith is the continued growing of plants & other greenery around it, slower than a direct magical approach but faster than natural growth. Whether this is a bleed-through from the Fey, the activities of the attracted spirits, or something more..."
      },
      {
        "type": "multiblock",
        "name": "Grove Stone",
        "multiblock": {
          "mapping": {
            "0": "roots:grove_stone",
            "M": "roots:grove_stone[half=middle]",
            "T": "roots:grove_stone[half=top]"
          },
          "pattern": [
            [" ", "T", " "],
            [" ", "M", " "],
            [" ", "0", " "],
            [" ", " ", " "],
            [" ", " ", " "]
          ]
        },
        "enable_visualize": false,
        "text": "$(o)A sketch of a more refined monolith, 322 AC$()"
      },
      {
        "type": "multiblock",
        "name": "Fey Crafter",
        "multiblock": {
          "mapping": {
            "0": "roots:fey_crafter"
          },
          "pattern": [
            [" ", "0", " "]
          ]
        },
        "enable_visualize": false,
        "text": "$(o)A hand-woven Fey Crafter, 356 AC$()"
      },
      {
        "type": "relations",
        "entries": [
          "basics/crafting",
          "basics/introduction"
        ]
      }
    ]
  }