{
  "name": "Spellcraft & Imbuing",
  "icon": "roots:staff",
  "category": "basics",
  "advancement": "roots:root",
  "sortnum": 4,
    "pages": [
    {
      "type": "text",
      "text": "The most basic power available to a druid is spellcraft. To make, each spell requires specific components, which are broken down in a $(l:apparatus/mortar)Mortar & Pestle$() into spell dust. This dust can then be imbued into a staff.$(br2)In addition to the creation, casting spells require material components in the form of herbs."
    },
    {
      "type": "text",
      "text": "Once the spell dust has been crafted, it is imbued into the staff with an Imbuer. During the process, further reagents can be added to permanently modify the spell.$(br2)Imbuement will never override a old spell slot, instead placing the new spell in the first available empty slot, if there is one.$(br2)Place both staff and spell dust into the imbuer to begin the process."
    },
    {
      "type": "crafting",
      "recipe": "roots:imbuer",
      "title": "Imbuer",
      "text": "It will take a short amount of time before the staff is returned, with the new spell ready for use.$(br2)Spell dust $(info) $(l:basics/spells#augmentation)can be augmented with other reagents before$() being imbued into the staff."
    },
    {
      "type": "crafting",
      "recipe": "roots:staff",
      "title": "Staff",
      "text": "The staff can be made from any wood, as the wildroot allows the imbued spells to activate freely. In addition, herbs must also be provided from $(l:apparatus/component_pouch)a suitable container$().$(br2)$(info) You may craft larger containers in the future."
    },
    {
      "type": "text",
      "title": "Augmentation",
      "anchor": "augmentation",
      "text": "It is possible to augment some spells by placing their dusts in the imbuer without the stuff, and then apply one of the reagents specified in the entry for that spell.$(br2)After this is done, the dust may be imbued as usual.$(br2)$(info) Not all spells accept modifiers."
    },
    {
      "type": "text",
      "title": "Manipulating the Staff",
      "text": "The staff is capable of holding up to 5 spells. The currently selected spell is always displayed in the tooltip, while holding shift will allow show all imbued spells.$(br2)Sneaking while right-clicking will cycle through to the next available spells.$(br2)Additional key-binds exist, should you need them."
    },
    {
      "type": "text",
      "title": "Casting",
      "text": "One selected, the staff mey be held in either hand.$(br2)If the spell is instantaneous, simply right-click to activate. Otherwise, requires your concentration: hold right-click for as long as you wish to activate it.$(br2)If the correct components are available, they will be consumed, the spell cast, and a visual alert will show you your remaining stock of herbs."
    },
    {
      "type": "text",
      "title": "Removing Spells",
      "text": "As the power of the staff is limited and can only maintain 5 spells, it may become necessary for you to remove a spell.$(br2)Simply select the spell you wish to void, and then $(info) imbue the staff with $(l:resources/runic_dust)Runic Dust$().$(br2)The staff returned will have an empty slot where the spell once was."
    },
    {
      "type": "relations",
      "entries": [
        "basics/other_kmbuer",
        "apparatus/mortar"
      ]
    }
  ]
}