{
  "name": "Crushing",
  "icon": "rankine:wooden_hammer",
  "category": "mechanics",
  "pages": [
    {
      "type": "text",
      "text": "Crushing is a process that involves breaking blocks and items into smaller components. This is typically achieved by using a new tool, the $(l:tools/hammers)hammer$(). Crushing, and by association the hammer, work differently than the typical mining process."
    },
    {
      "type": "text",
      "text": "To crush a block in-world, you must swing your hammer at the right time. When the attack speed indicator (the sword that appears underneath your crosshair) is filled, you may swing your hammer to crush the block. Trying to swing before the attack speed indicator is filled will result in nothing happening. This means that a hammer with a faster attack speed stat will be able to break blocks at a quicker rate."
    },
    {
      "type": "text",
      "text": "The main thing that you need to consider when crushing a block is the crushing/harvest level of your tool. Similar to pickaxes, hammers cannot break blocks greater than its harvest level. However, the hammer's harvest level also influences what drops from the block you crush. JEI is the best source of information on the potential drops of any block when crushing it."
    },
    {
      "type": "text",
      "text": "Each block can have up to 6 possible outputs, with each output corresponding to a certain harvest level. This means that crushing a block with a tool that has a harvest level of 3 will give you the chance to obtain the outputs from crushing level 3, 2, 1, and 0. Drops from crushing are determined by random chance."
    },
    {
      "type": "text",
      "text": "Each output has two types of chances. The innate chance represents the chance you obtain the drop provided your harvest level is greater than or equal to the crushing level of the drop. The additional chance is a bonus chance that is added if your harvest level is equal to the crushing level of the drop."
    },
    {
      "type": "crafting",
      "recipe": "rankine:piston_crusher",
      "text": "If you want to automate the crushing process, there are currently two machines that you can use"
    },
    {
    "type": "text",
    "anchor": "piston_crusher",
    "text": "Crushing materials is the best method of obtaining resources for refinement. Simply place materials into the input slot and fuel the machine. The Piston Crusher acts as an automated Iron Hammer and is considered to have a crushing level of 3 (Invar)."
    },
    {
      "type": "text",
      "text": "This means that the Piston Crusher can only obtain up to three drops from the block. The Piston Crusher can crush blocks with a crushing level greater than 3, but only the outputs requiring a crushing level equal to or less than 3 can be obtained."
    },
    {
      "type": "spotlight",
      "item": "rankine:gyratory_crusher",
      "link_recipe": true,
      "text": "Similar to the Piston Crusher, simply place materials into the middle slot and ensure the installation of a battery and crushing head. The tier of the crushing head will determine the crushing level of the machine."
    },
    {
      "type": "crafting",
      "header": "Crushing Heads",
      "item1": "rankine:crushing_head_h0",
      "item2": "rankine:crushing_head_h1",
      "item3": "rankine:crushing_head_h2",
      "item4": "rankine:crushing_head_h3",
      "item5": "rankine:crushing_head_h4",
      "item6": "rankine:crushing_head_h5"
    }
  ]
}