{
  "item.hexways.portal_staff": "Portal Staff",
  "entity.hexways.hexportal": "Hex Portal",
  "hexcasting.action.hexways:twowayportal": "Summon 2 Way Portal",
  "hexcasting.action.hexways:onewayportal": "Summon 1 Way Portal",
  "hexcasting.action.hexways:removeportal": "Remove Portal",
  "hexcasting.action.hexways:rotateportal": "Rotate Portal",
  "hexcasting.action.hexways:moveportalinput": "Move Portal",
  "hexcasting.action.hexways:moveportaloutput": "Alter Destination",
  "hexcasting.action.hexways:summonscry": "Summon Scry",
  "hexcasting.action.hexways:getoutputinfo": "Chell's Purification",
  "hexcasting.action.hexways:resizeportal": "Resize Portal",
  "hexcasting.action.hexways:setportalsides": "Set Portal Sides",

  "hexways.entry.hexways": "Hex Ways",
  "hexways.page.hexways.onewayportal": "Accepts the arguments of 2-way portal, but constructs a portal restricted to unilateral traversal. Strangely, Nature offers no discount for this lesser portal.",
  "hexways.page.hexways.twowayportal": "Accepts a vector for the portal's input, one for output, a third for rotation, and a number for its initial radius. Costs increase logarithmically with distance.",
  "hexways.page.hexways.summonscry": "Works as a 1-way portal, but does not provide travel, only sight. Costs increase with distance, though noticeably less than for other portals.",
  "hexways.page.hexways.moveportalinput": "Takes a portal and location vector, and moves its input to that location. The cost is slightly lesser than portal creation, and is reduced for scrying portals.",
  "hexways.page.hexways.moveportaloutput": "Takes a portal and location vector, and moves its output to that location. For a two-way portal, this also moves the portal on the other side, as expected. Costs are similar to the previous pattern.",
  "hexways.page.hexways.removeportal": "Alas, if a portal provides the visage of too much for my eyes to handle, this spell may cut the string, banishing a portal pair. Costs no _media.",
  "hexways.page.hexways.portalambit": "Astoundingly, these portals... the range of my _Hexes may flow through them, albeit diminished. It seems my influence stretches outside to the other end of a portal, at half the remaining distance from me. As such, I may find the equation \"(32 - my location)/2\" to suffice for the added reach.",
  "hexways.page.hexways.setportalsides": "As, well, $(italic)familiar/$ as I am with hexagons, sadly they don't fit every situation. But with this spell, I may alter the count of a portal's sides and roll, free of cost.",
  "hexways.page.hexways.resizeportal": "Passing a portal, height, and width, I may change the size of the portal, reverting it to a hexagonal shape, curiously. Costs no _media.",
  "hexways.page.hexways.getoutputinfo": "This nifty pattern returns a portal's output location as a vector (which will be the location of the output portal, for a 2-way portal). This could be useful combined with Portal Ambit. Costs no _media.",
  "hexways.page.hexways.getoutputinfocont": "After confusion, I concluded that this pattern works the best with Move Portal, due to getting the output portal, if it is a 2-way portal. Another use for this pattern may be for raycasts, since the casts don't pass through portals, but with this, I can emulate the raycast.",
  "hexways.page.hexways.rotateportal": "Ah, fickle rotation vectors. To my luck, I may use this spell to change the rotation of a given portal. The final argument determines whether the rotation is limited to one side, for a 2-way portal.",
  "hexways.page.hexways.portalambittitle": "Portal Ambit",
  "hexways.page.hexways.pageintro": "I have come across a method by which I can imitate the phenomenon of wormholes (or perhaps, electron tunneling?), using media. This discovery was powered by the presence of another modification, \"Immersive Portals\". How exciting! I shall utilize this revelation posthaste.",
  "hexways.page.hexways.pageintrotitle": "Hex Portals?",

  "hexways.page.hexways.getoutputinfoconttitle": "Chell's Purification, Cont."
}