{
  "name": "Pyres",
  "icon": "roots:reinforced_pyre",
  "category": "crafting_devices",
  "read_by_default": true,
  "pages": [
    {
      "type": "crafting",
      "recipe": "roots:pyre",
      "text": "The primary use of a pyre is the execution of rituals, and the use of the pyre in this context is described in $(l:rituals/introduction)the rituals introduction$().$(br2)Other uses include the creation of certain herbs, as described in the $(l:herbs/introduction)herbs$()"
    },
    {
      "type": "text",
      "text": "$(l:herbs/introduction)introduction$(). Further uses include specific types of crafting, which are outlined in later pages, as well as a $(l:crafting/decorative_pyre)decorative variant$().$(br2)$(info) All rituals, including herb crafting and regular item crafting & cooking recipes, can be ended early by pouring a bucket of water upon it. Alternately, a pyre can be broken.$(br2)$(info) Breaking a pyre with items inside it will spill those on the ground."
    },
    {
      "type": "text",
      "title": "Pyre Crafting",
      "text": "Crafting rituals beyond those in the entries for individual $(cat:herbs)herbs$() cannot be listed in full in this guide.$(br2)Additionally, many of these may have been altered or changed or even removed by a modpack.$(br2)$(info) Thankfully, you can see a full listing of these crafting ritual recipes (including herbs) that is up-to-date and relevant to your environment $(uses:roots:pyre)in JEI$()."
    },
    {
      "type": "crafting",
      "recipe": "roots:reinforced_pyre",
      "title": "Reinforcement",
      "text": "It's possible to reinforce the pyre (which is not resistant to explosions and is weak to Vanilla bosses) with $(l:resources/runed_obsidian)runed obsidian$().$(br2)$(info) This reinforced pyre is immune to bosses and explosions."
    },
    {
      "type": "relations",
      "anchor": "related",
      "entries": [
        "rituals/fire_starter",
        "rituals/automation",
        "rituals/introduction",
        "crafting/decorative_pyres"
      ]
    }
  ]
}