{
	"tne.data_tablet.tabs.tempad.name": "Spatiotemporal Conveyances",
	"tne.data_tablet.pages.knowledge_projector.name": "Knowledge Projector",
	"tne.data_tablet.pages.knowledge_projector.flavor": "⛭ Ouroboros wishes he had this",
	"tne.data_tablet.pages.knowledge_projector.page.text": "A private set of notes and information in a format unapproved for proper Data entry.",
	"tne.data_tablet.pages.chronon_cell.name": "Chronon Cell",
	"tne.data_tablet.pages.chronon_cell.flavor": "⛭ Time in a Box?",
	"tne.data_tablet.pages.chronon_cell.page.text": "Stores a moderate amount of Chronic Energy for later use.",
	"tne.data_tablet.pages.chronon_generator.name": "Chronon Generator",
	"tne.data_tablet.pages.chronon_generator.flavor": "⛭ Wait, this isn't a Procrastinator...",
	"tne.data_tablet.pages.chronon_generator.page.text": "Gradually siphons unused bits of time from the local area in the form of Chronic Energy, for usage in spatiotemporal devices, but has neligible amounts of storage.",
	"tne.data_tablet.pages.location_card.name": "Location Cards",
	"tne.data_tablet.pages.location_card.flavor": "⛭ That'll be $27.59",
	"tne.data_tablet.pages.location_card.page.text": "Can store the spatiorealmic location of a dedicated marker object for use in temporal linkage generators.",
	"tne.data_tablet.pages.location_card.page2.text": "Use on a Marker to store its location for later usage.",
	"tne.data_tablet.pages.location_card.page3.text": "For convenient storage of numerous cards.",
	"tne.data_tablet.pages.location_card_other.name": "Location Cards 2",
	"tne.data_tablet.pages.location_card_other.page.text": "The cards are tough enough to to press out more cards in a Metal Shaper, out of Chronite.",
	"tne.data_tablet.pages.timedoor_marker.name": "Timedoor Markers",
	"tne.data_tablet.pages.timedoor_marker.flavor": "⛭ Marking your place",
	"tne.data_tablet.pages.timedoor_marker.page1.text": "Used to provide a spatiorealmic location to receptory devices, such as Location Cards.",
	"tne.data_tablet.pages.timedoor_marker.page2.text": "Each Marker is has a unique identifier, and may be renamed in an anvil for organization.\nThis is kept upon placing and breaking the Marker.",
	"tne.data_tablet.pages.timedoor_marker.page3.text": "To clear a Marker of its identifier and name, simply strip it away with standard crafting tools.",
	"tne.data_tablet.pages.timedoor_projector.name": "Timedoor Projector",
	"tne.data_tablet.pages.timedoor_projector.flavor": "⛭ Swipe here, please", 
	"tne.data_tablet.pages.timedoor_projector.page1.text": "A working prototype. Useful for simplistic, monopoint transportation, but rather clunky to use and has habit of opening doors behind the user.",
	"tne.data_tablet.pages.timedoor_projector.page2.text": "By inserting a Location Card into a Timedoor Projector, a set of spatial coordinates may be set. Activating it via a redstone signal or by holding it in your arms whilst directing it onto a nearby area creates a Timedoor to the designated coordinates.",
	"tne.data_tablet.pages.chronite.name": "Chronite",
	"tne.data_tablet.pages.chronite.flavor": "⛭ Those happy golden days",
	"tne.data_tablet.pages.chronite.page1.text": "By infusing a sizable quantity of Essence into an ingot of mundane Gold, it takes on a darker, brassy sheen, and gains incredible resistance to Chronic Energy.\nThis makes it the ideal material for use in advanced spatiotemporal devices.",
	"tne.data_tablet.pages.chronite.page2.text": "A full block of gold can be used for significantly increased Essence effiency, although some material cannot withstand the strain.",
	"tne.data_tablet.pages.chronon_battery.name": "Chronon Battery",
	"tne.data_tablet.pages.chronon_battery.flavor": "⛭ Saving the minutes",
	"tne.data_tablet.pages.chronon_battery.page.text": "Stores a significant quantity of Chronic Energy for later use",
	"tne.data_tablet.pages.chronometer.name": "Chronometer",
	"tne.data_tablet.pages.chronometer.flavor": "⛭ Whiling away the hours",
	"tne.data_tablet.pages.chronometer.page.text": "Siphons unused time from the local area to generate Chronic Energy.\nWorks roughly twice as fast as the §lChronon §lGenerator§r.",
	"tne.data_tablet.pages.chronomark.name": "Chronomark",
	"tne.data_tablet.pages.chronomark.flavor": "⛭ Enter here, please",
	"tne.data_tablet.pages.chronomark.page1.text": "Used to mark a spatiorealmic location for valid receptory devices\nAccess may be restricted to the creator only, or broadcast to all valid devices. Projected data shows the possibility of \"team based\" restrictions as well, but no there are no known methods of creating such a team, and research is unpromising.",
	"tne.data_tablet.pages.chronomark.page2.text": "Unlike the more primitive Timedoor Marker, the angle and base height of the generated Timedoor can be customized.\nThey still have a unique identifier, which is kept upon placing and breaking the Chronomark.",
	"tne.data_tablet.pages.chronomark.page3.text": "Clearing a Chronomark of its identifier and associated customization is done identically to that of a Timedoor Marker.",
	"tne.data_tablet.pages.chrono_reverter.name": "Chronological Reverter",
	"tne.data_tablet.pages.chrono_reverter.flavor": "⛭ What a twist!",
	"tne.data_tablet.pages.chrono_reverter.page1.text": "The Chronological Reverter tracks the bearers chronospatial history, and is uniquely capable of warping Chronic Energy to revert them to an earlier location",
	"tne.data_tablet.pages.chrono_reverter.page2.text": "Opening the Reverter displays a radial menu of up to eight significant events, such as interrealmic changes.\nCollected data shows that if the user was somehow capable of reviving after death, it would track the location of both their death and resurrection.",
	"tne.data_tablet.pages.metronome.name": "Metronome",
	"tne.data_tablet.pages.metronome.flavor": "⛭ Making time",
	"tne.data_tablet.pages.metronome.page1.text": "Metronomes are stationary devices uniquely capable of §ogenerating§r Chronic Energy, without skimming off of the local temporosphere.\nThey can store a large amount of Chronic Energy, as well as generating it faster than any other known method.\nIn addition, Metronomes seem to be able to link with other Metronomes set up by the same user, combining both their storage and generation per pulse.\nThey can also supply Chronic Energy to other stationary devices place adjacent to the Metronome.",
	"tne.data_tablet.pages.metronome.page2.text": "Metronomes require a moderately large quantity of Chronic Energy to jumpstart their production. This can be achived by simply transferring it from a Chronon Battery or Cell into to Metronome.\nAfter the first Metronome, this will be unnecessary, as they will utilize the link to pull from other Metronomes.",
	"tne.data_tablet.pages.tempad.name": "Tempad",
	"tne.data_tablet.pages.tempad.flavor": "⛭ \"Anywhere?\" \"Yes, sir, §lanywhere§r!\"",
	"tne.data_tablet.pages.tempad.page1.text": "The ultimate creation of the Chronospatial Initiative, a Tempad is capable of freely storing and opening a seemingly-limitless number of Timedoors to any location, without need for any sort of marker.",
	"tne.data_tablet.pages.tempad.page2.text": "The Tempad has a wide range of capabilities.\nFirst and formost of these is the ability to store the spatiorealmic location of any point in existence, without the need of a marker. Markers and Chronomarks (set to public) broadcast their location to all Tempads, so Location Cards are made obsolete; however they can still be used from a Card Wallet.\nA secondary function of the Tempad is made available when a Chronological Reverter is slotted in, done by placing one on the other. This function allows the Reverter to rewind to more granular points in the users chronospatial history, instead of \"just\" major events.\nOther capabilities are covered in separate entries.",
	"tne.data_tablet.pages.location_broadcaster.name": "Location Broadcaster",
	"tne.data_tablet.pages.location_broadcaster.flavor": "⛭ I'm right here!",
	"tne.data_tablet.pages.location_broadcaster.page.text": "The Location Broadcaster does exactly as it says - broadcasts your location. Anyone with a working Tempad can open a Timedoor to your spatiorealmic coordinates from anywhere, provided they have a Signal Enhancer upgrade.",
	"tne.data_tablet.pages.screening_device.name": "Screening Device",
	"tne.data_tablet.pages.screening_device.flavor": "⛭ Authorized Personnal Only",
	"tne.data_tablet.pages.screening_device.page.text": "The Screening Device seems to function identically to the Location Broadcaster, but appears to be able to encrypt its broadcasts in a way that can limit access to only members of a \"team\".\nUnfortunately there does not currently appear to be a way to create such a team, and no additional resources will be expended researching this matter.",
	"tne.data_tablet.pages.workstation.name": "Workstation",
	"tne.data_tablet.pages.workstation.flavor": "⛭ Upgraded potential",
	"tne.data_tablet.pages.workstation.page.text": "A Tempad can be docked with a placed Workstation, and provides the necessary tools and external software to upgrade it via an §lEnhancement Spool§r, giving the Tempad additional capabilities.\nIn addition, it can be used to hijack the docked Tempad's Timedoor creation abilities, and used to make a higher-variance, redstone-operated Timedoor station that can keep a Timedoor open indefinitely, at the cost of Chrononic Energy.",
	"tne.data_tablet.pages.enhance_spools.name": "Enhancement Spools",
	"tne.data_tablet.pages.enhance_spools.flavor": "⛭ Making the best, better",
	"tne.data_tablet.pages.enhance_spools.page1.text": "Enhancement Spools can be applied to a Tempad via §lWorkstation§r to increase its capabilities. At the moment there is two - the Signal Enhancer Spool and the Repository Conversion Spool.",
	"tne.data_tablet.pages.enhance_spools.page2.text": "The Signal Enhancer Spool attaches a finely-tuned antenna to the inside of the Tempad, allowing it to pick up signals from a Location Broadcaster that previously would be too weak to detect.\nThe Repository Conversion Spool downloads the entirity of the Knowledge Projector into the Tempad for easy access.",
	"tne.file.labs_radio.log1": "Director Nikikia is shutting down our department. \"Lack of production\" he says. If we get these fully operational then imagine! Retrieving field researchers, instant reinforcements, the ability to meet with anyone anywhere within seconds! But no, he says. \"Too few advancements\" he says, \"Only a couple devices of interest\". Aruians are all the same, never see them getting §ltheir§r feathers dirty or needing help right here, right now.",
	"tne.file.labs_energy.log1": "Chronic Energy production is coming along well, however it is noticably slow despite being essentially free. Chronite allows for greater stresses and containment, but even that can only take us so far. Further research into this area is warranted to see if Essence can be used to fuel production of such energy. Perhaps the relatively new transformative variety...?",
	"tne.file.labs_spatial.log1": "Creating a timedoor is, relatively, an easy task, but keeping it open for any length of time is both expensive and dangerous. Large quantities of Chronic Energy are consumed for every second it stays open, without which it rapidly destabilizes. As a side note, somebody stole my reminder codes and hide them again. I'm no Aruian, how am I supposed to remember what sequence to continue without them",
	"tne.file.labs_chrono.log1": "Chronite... Wonderous metal. Gold, but yet not. Essence thrums within it, a sheen on its surface, but at the same time it is empty, as though nothing was ever there. Chronic energy flows through it like Essence through copper, but when used as a casing it is more resistant than the hardest obsdian. If only we had just a bit more time to study it...",
	"tne.advancement.root.title": "Time and Essence",
	"tne.advancement.root.description": "Look for a Laboratory to begin",
	"tne.advancement.find_labs.title": "Not the Nevada",
	"tne.advancement.find_labs.description": "Find the Chronospatial Labs, hidden away from the world in the dryest of deserts",
	"tne.advancement.basic_chronon_stuff.title": "Chronic Pain",
	"tne.advancement.basic_chronon_stuff.description": "Obtain basic tools for Chronic Energy usage",
	"tne.advancement.markercard.title": "Plus Marks The Spot!",
	"tne.advancement.markercard.description": "Obtain basic spatiorealmic marking tools",
	"tne.advancement.projector.title":"You're Projecting!",
	"tne.advancement.projector.description":"Obtain a Timedoor Projector, the simpliest of spatiotemporal conveyances",
	"tne.advancement.chronite.title": "Steeling Time",
	"tne.advancement.chronite.description": "Infuse some bars of gold with Industrial Essence to make Chronite, a metal both attuned and resistant to the power of time",
	"tne.advancement.chronomark.title": "It's crooked!",
	"tne.advancement.chronomark.description": "Craft a Chronomark, allowing you to make timedoors appear at a specific angle and height",
	"tne.advancement.advanced_chronon_stuff.title": "Chronal Countdown",
	"tne.advancement.advanced_chronon_stuff.description": "Obtain advanced tools for Chronic Energy usage, capable of storing and generating much more Chronic Energy than simplistic iron ones",
	"tne.advancement.reverter.title": "Time for Twister!",
	"tne.advancement.reverter.description": "Obtain the Chronological Reverter, a device capable of sending you back through space via time",
	"tne.advancement.metronome.title": "Researcher, use Metronome!",
	"tne.advancement.metronome.description": "Create a Metronome, which can sync with others of the same to form a power web of Chronic Energy",
	"tne.advancement.tempad.title": "Through All Time, Always",
	"tne.advancement.tempad.description": "Assemble a Tempad.\nNow you can go anywhere, free of markers, at any time",
	"tne.advancement.improvments.title": "Hackerman",
	"tne.advancement.improvments.description": "Make a Workstation to install enhancements to the Tempad, and the spools to go with it",
	"tne.advancement.broadcasting.title": "I'm over here!",
	"tne.advancement.broadcasting.description": "Fabricate a Location Broadcaster, allowing other Tempad users with the corrosponding Enhancement to hone in on your location"
}