{
  "name": "Curse",
  "icon": "minecraft:wither_skeleton_skull",
  "category": "reactive:intro",
  "advancement": "reactive:be_cursed",
  "secret": true,
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(o)Welcome. You've felt it, haven't you? That dark power. Like the chilling air in the deepest recesses of the earth. $(br2)I believe it to be something from the Nether, but it is not bound to that dimension alone. Indeed, I have reason to believe it would have even greater abilities in the Overworld."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)The $(4)nearby death of undead creatures$(0) would create this power, unless it is protected by a certain $(l:reactive:intro/symbols)ward$(/l)."
    },
    {
      "type": "patchouli:spotlight",
      "item": "minecraft:chiseled_red_sandstone",
      "text": "$(o)Ruins of red sandstone depict a being beyond our comprehension. Alongside them, we found a prophecy. 'When the Wither wakes, the Overworld's shadows will wake in turn.' The Pig-lords do not believe the prophecy, at least not outwardly. Normally, I wouldn't either, but recent results have... broken the doubt a bit."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)I do not know the circumstances of your world, but if you found this chapter, it is likely the Curse has taken hold of it. Monsters would emerge from shadows, or deep in the earth. Sensitive life-forms would be turned upon touching the Overworld's air."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)If this dreadful thing has come to pass, we are likely long gone. All you can do is make the most of what we left behind; this book, our mineshafts, and whatever became of the Nether. I request only one thing. As you attempt to exploit even this Curse to your advantage... be careful."
    },
    {
      "type": "patchouli:empty",
      "draw_filler": false
    },
    {
      "type": "patchouli:empty",
      "draw_filler": false
    },
    {
      "type": "reactive:transmute",
      "recipe": "cursed_symbol"
    }
  ]
}