{
  "name": "Fundamental Principles",
  "icon": "reactive:scroll",
  "category": "reactive:intro",
  "turnin": "reactive:make_crucible",
  "priority": true,
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Alchemy, more formally Reactive Alchemy, is the exploration of the various $(l:reactive:intro/powers)Alchemical Powers$() latent throughout the world.$(br2)These Powers are responsible for many of the bizarre effects and apparitions that we observe in our daily lives, from the magic of Enchantment to the spontaneous movement of the Endermen."
    },
    {
      "type": "patchouli:text",
      "text": "In truth, the Powers are raw ontological forces that interact with materials based on their essential properties. $(br2)Outside of special containers, they quickly degrade into various particles and effects. As such, they can only bind to particular objects."
    },
    {
      "type": "patchouli:text",
      "text": "However, throughout ages, it has been thought that these $(l:reactive:intro/powers)Powers$() might be released and captured by another material. Indeed, an $(thing)aqueous solution$(0) has proven suitable for this purpose. $(p)However, Powers will not enter solution without some inducement. The $(l:reactive:intro/crucible)Crucible$(/l) will provide that."
    },
    {
      "type": "patchouli:text",
      "text": "The interactions between Powers are based on $(item)fundamental properties unique to this World$(0). These properties, themselves, derive from a Fixed Number I would call the $(item)Alchemy Seed$(0). $(p)$(6)(If you want to change the alchemy seed, see the server config file.)"
    },
    {
      "type": "patchouli:text",
      "text": "$(o)Before you go any further, you should make the Crucible. To do so, follow this procedure:$(br2)Transcribe the following, using glowing ink mixed with redstone, onto a clean paper. A simple crafting operation will suffice.$(br2)Then, simply apply the result to a Cauldron."
    },
    {
      "type": "patchouli:image",
      "images": ["reactive:textures/gui/scroll_glyph.png"]
    },
    {
      "type": "patchouli:crafting",
      "recipe": "reactive:alchemy_scroll_crafting",
      "text": "$(o)Do not fear: the risk of damaging or losing this journal in the process is slim to none."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "reactive:alchemy_scroll_alt_crafting",
      "text": "$(o)An alternate recipe."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "reactive:alchemy_scroll_alt2_crafting",
      "text": "$(o)Another alternate recipe."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)The meaning of the glyphs is not important. Know only that the scroll's power is not derived from its writing, but in equal parts from the intrinsic properties of the ink, and from you. By taking the effort to transcribe these words, you bring about everything that will happen from now on."
    }
  ]
}