{
  "name": "Points of Technique",
  "icon": "reactive:litmus_paper",
  "category": "reactive:intro",
  "advancement": "reactive:make_crucible",
  "priority": true,
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(o)Here are a few noteworthy features to keep in mind."
    },
    {
      "type": "reactive:transmute",
      "recipe": "litmus_paper",
      "anchor": "litmus",
      "text": "$(item)Litmus Paper$(0) is a Specially-Treated Sheet of Paper that can be used to Measure the Strength of Powers in the Crucible. $(p)$(o)Use it on a Crucible to take the measurement, and use it elsewhere to read it."
    },
    {
      "type": "patchouli:text",
      "text": "$(o)$(item)Litmus Paper$(0) also shows whether the Powers in the Crucible are causing reactions, and if not, why not. The messages are relatively self-explanatory, but keep in mind that they only refer to $(4)reactions possible with the current combination of Powers$(0)."
    },
    {
      "type": "patchouli:text",
      "text": "$(thing)Transmutations$(0) (transforming an item into another) can only be Performed if a Certain Threshold of Total Power has been reached. Specifically, a Transmutation may occur if all Reagents are present and at least One crosses the unseen Threshold."
    },
    {
      "type": "patchouli:spotlight",
      "item": "reactive:body_bottle",
      "text": "$(o)The $(#AF5220)Body Power$(0) inhibits reactions from taking place. If you need an unfortunate combination of Powers for something, add some Body. $(p)Litmus Paper will present the status '$()(Reaction Name) Inhibited$(o)' if something, including Body Power, is preventing a reaction."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "reactive:shulker_crucible_crafting",
      "text": "$(o)I found this recipe in an book from long ago. Something about a movable Crucible? $(br2)Might be worth trying if you can figure out what that purple thing is supposed to be."
    },
    {
      "type": "patchouli:text",
      "text": "In Making the $(item)Staff of Power$(0), the Order follows that of the Reactions of the Secret Powers under a Golden Sign. $(p)$(4)$(bold)BLASTING$(br)FOAMING$(br)GRID BREAK$(p)$()This is the Order."
    }
  ]
}