{  "name": "Where is Dynamics?",  "icon": "thermal:iron_gear",  "read_by_default": true,  "category": "thermal:storage_and_transport",  "flag": "mod:thermal_expansion",  "pages": [    {      "type": "text",      "text": "Dynamics is currently on hold as other features of the Thermal series are being fleshed out. Please be patient! The following pages will have other recommended pipe mods."    },    {      "type": "link",      "title": "XNet",      "url": "https://www.curseforge.com/minecraft/mc-mods/xnet",      "link_text": "Curseforge Link",      "text": "XNet is a powerful mod that can transport items, fluids, RF, and more in one cable. Every network requires a controller, through which the network can be configured to control inputs, outputs, filtering, stack size, etc on multiple channels. There is a slight learning curve involved, but the degree of control is almost unmatched."    },    {      "type": "link",      "title": "Refined Pipes",      "url": "https://www.curseforge.com/minecraft/mc-mods/refined-pipes",      "link_text": "Curseforge Link",      "text": "For an experience more reminiscent of 1.12 dynamics, try Refined Pipes. Pipes and extractors come in distinct tiers with varying speeds. For those already acquainted with 1.12 dynamics, this mod should feel like home."    },    {      "type": "link",      "title": "Integrated Tunnels",      "url": "https://www.curseforge.com/minecraft/mc-mods/integrated-tunnels",      "link_text": "Curseforge Link",      "text": "Integrated Dynamics is an extremely powerful mod that can assess a variety of qualities about mobs, inventories, etc. Tunnels is an addon that allows networks to also im/export items from inventories. Combined, these two allow for extreme precision, filterability, and control. Beware, this mod is harder to pick up than most."    },    {      "type": "text",      "title": "Content Mods with Pipes",      "text": "The following mods have a variety of transport options, but also add a lot of other great content that you may be interested in. If you are looking for a mod that $(o)only$() adds item/fluid/energy transfer options, refer to the previous pages.$(li)$(l:https://www.curseforge.com/minecraft/mc-mods/mekanism)Mekanism$()$(li)$(l:https://www.curseforge.com/minecraft/mc-mods/create)Create$()$(li)$(l:https://www.curseforge.com/minecraft/mc-mods/immersive-engineering)Immersive Engineering$()$(li)$(l:https://www.curseforge.com/minecraft/mc-mods/rats)funny rat mod$()"    }  ]}