{
	"name": "Circuit Debugging",
	"icon": "rs_ctr2:probe",
	"category": "rs_ctr2:basics",
	"pages": [
		{
			"type": "patchouli:text",
			"text": "It's relatively normal for complex contraptions to not work as intended on first try. Be it overlooked edge cases or components behaving differently than you thought, there are many things that can go wrong.\\pThe following pages explain some useful tools to help you in such situations."
		}, {
			"type": "patchouli:spotlight",
			"item": "rs_ctr2:probe",
			"text": "Most components are opaque without any visual effects indicating their state, so you will need a \\iGate Probe\\d to see what's going on inside them.\\pRight click the tool on a component to link it. After that, it will show a miniature model of the linked component with real-time state information as text below."
		}, {
			"type": "patchouli:text",
			"text": "The 3D-model is oriented the same way as the real part, and will rotate as you turn your view. All \\oports\\d on the component are marked with white numbers that correspond to the numbers at the start of each text line below. Blue or green indicate the port direction: \\binput / slave\\d or \\goutput / master\\d.\\pThe state of each port is then written in a color according to its $(l:connecting)type$(/l) with optional description in gray."
		}, {
			"type": "patchouli:image",
			"images": ["rs_ctr2:textures/gui/manual/probe.png"],
			"border": true,
			"title": "Gate Probe readout",
			"text": "Example of what you might see."
		}, {
			"type": "patchouli:text",
			"title": "Debug Commands",
			"text": "In case you have command permission in your world, you can:\\+$(c:/gateUpdater pause)halt all circuit updates$(/c)\\+$(c:/gateUpdater step)run single update ticks$(/c)\\+$(c:/gateUpdater resume)resume normal ticking$(/c)\\pThese are very useful for debugging signal timing issues, because you can run circuits slowly and analyze their state tick by tick, which might otherwise go too fast to follow."
		}, {
			"type": "patchouli:text",
			"text": "Note that when circuit ticks are halted, all devices from Redstone Control will stop responding while everything else in the world continues normally.\\nThis can have unwanted side-effects, so be careful!"
		}
	]
}