{
	"name": "Placement Tips",
	"icon": "cd4017be_lib:microblock",
	"category": "rs_ctr2:basics",
	"pages": [
		{
			"type": "patchouli:text",
			"text": "To remove components from a placed \\iMicroblock Structure\\d, you have to hit it with another microblock component in hand (\\iGate Probe\\d works too). If you break a \\iMicroblock Structure\\d with regular tools or by hand, it will drop the entire block as item instead.\\pThis item can be put in a \\iMicroblock Workbench\\d to be disassembled into its components or be replicated."
		}, {
			"type": "patchouli:text",
			"text": "When placed down again, it will be in the same orientation it was when broken, regardless how you place it. But you can change the orientation of a \\iMicroblock Structure\\d via a GUI that opens when right-clicking the item without aiming at a block.\\pThe placement of microblock components works mostly like regular blocks but on a 4 times smaller grid. But non-opaque parts like cables can be covered in \\iBlock Bits\\d placed over them."
		}, {
			"type": "patchouli:text",
			"title": "Oriented Components",
			"text": "Many microblock components can be placed in different orientations:\\pWhen placed \\*without crouching\\., the right face of the item model will point towards you and the front face will point away from the wall you placed against. Or when looking straight at the wall, it will point towards the nearest grid edge from your aim point."
		}, {
			"type": "patchouli:text",
			"text": "In \\*crouch placement\\. mode, the right face on the item model will always point towards the wall you clicked against and the front face will point towards the nearest grid edge from your aim point.\\p\\/Tools for in-place rotation may be added in the future."
		}, {
			"type": "patchouli:text",
			"title": "Cable Placement",
			"text": "A cable piece always connects between two different faces, one of which is the face you placed it against.\\p\\*Without crouching\\. the other end will point towards you, which is most convenient for fast-placing longer cable lines."
		}, {
			"type": "patchouli:text",
			"text": "\\*With crouching\\. the other end will either point towards the nearest grid edge from your aim point or go straight to the opposite side of the first end if you aim mostly at the center.\\nThis mode is most useful for precision placement in tight spaces."
		}
	]
}