{
  "name": "On Ascension",
  "icon": "",
  "category": "soulogy",
  "advancement": "elementaristics:progress_ascension_identification",
  "pages": [
    {
      "type": "text",
      "text": "In occultist circles, it is generally accepted that sanity can be seen as a wall. $(br)It keeps things we should not understand out and thus keeps our mind and soul intact. $(br)However, in order for one to ascend, which is the goal of oh so many, one must break boundaries."
    },
    {
      "type": "text",
      "text": "This breaking and rearranging of boundaries is considered the $(l)Great Work$(). This entry will try to assist the reader with their ascension. Additional pages will appear once an ascension stage is reached, so this entry should always be checked."
    },
    {
      "type": "spotlight",
      "item": "elementaristics:incantation_light",
      "title": "Identifying the Soul",
      "text": "The fist step of an ascension, also known as the step of knowing, is not an actual ascension stage. However, knowing a soul is often required. This is why each occultist must have used the $(l:souls/entry_identification)Rite of Enlightenment's Sighing$()."
    },
    {
      "type": "spotlight",
      "item": "elementaristics:block_silver_thread",
      "title": "Killing the Silver Thread",
      "text": "Next, the Silver Thread, or at least a part of it, must be slain. $(br)This fight will generally take place in $(l:souls/entry_mind)The Mind$(), where the cultist can find anomalies to summon the Silver Thread. $(br)For further information, view the corresponding entry.",
      "advancement": "elementaristics:progress_ascension_identification"
    },
    {
      "type": "spotlight",
      "item": "minecraft:bed",
      "title": "Meditation",
      "text": "In the step of rethinking, a deeper sentiment is taken and intensified, until it becomes one with the body. This process is fully mental whatsoever and requires no rites. The cultist may be aided with potions to affect the mental state.",
      "advancement": "elementaristics:progress_ascension_4"
    },
    {
      "type": "spotlight",
      "item": "elementaristics:incantation_reforging",
      "title": "Reforging",
      "text": "The step of reforging centers around getting the body ready for the energies that it will have to hold. This step is finalized with the $(marked)$(l:shaping/entry_reshaping)Reshaping Rite$().",
      "advancement": "elementaristics:progress_ascension_5"
    }
  ]
}