{
	"name": "General Info",
	"icon": "nuclearcraft:fission_casing",
	"category": "nuclearcraft:fission",
	"sortnum": 0,
	"pages": [
		{
			"anchor": "intro",
			"type": "text",
			"text": "Fission reactors generate heat from the self-sustained nuclear reaction of fission fuel. This heat is ultimately transformed into useful energy, and the way this is achieved depends on the type of reactor being built."
		},
		{
			"anchor": "casing",
			"type": "blocks/2",
			"header": "Reactor Casing",
			"block1": "nuclearcraft:fission_casing",
			"block2": "nuclearcraft:fission_glass",
			"text": "The reactor's interior components are contained within a cuboidal structure. The edges must consist of reactor casing, while reactor glass can be used instead of casing for the walls. When the multiblock forms, the casing blocks on the edges will be given a new frame texture."
		},
		{
			"anchor": "controller",
			"type": "blocks/3",
			"header": "Reactor Controllers",
			"block1": "nuclearcraft:pebble_fission_controller",
			"block2": "nuclearcraft:solid_fission_controller",
			"block3": "nuclearcraft:salt_fission_controller",
			"text": "The type of reactor is given by the controller, installed in one of the reactor walls. Without a controller, the multiblock will not form. Its GUI will show information about the reactor as a whole, such as the averages of relevant components' stats."
		},
		{
			"anchor": "conductor",
			"type": "blocks/1",
			"header": "Conductor Blocks",
			"block": "nuclearcraft:fission_conductor",
			"text": "If the structure contains groups of components disconnected from the casing, the multiblock can not form. Conductor blocks can be used to join these blocks to the reactor's walls. $(l)Clusters$() can also be connected together with the use of these blocks."
		},
		{
			"anchor": "clusters",
			"type": "text",
			"title": "Reactor Clusters",
			"text": "Clusters are simply connected groups of heat-conducting components. Components which can be in an active or idle state only conduct heat when functional, while passive blocks such as conductor blocks always do. Moderator and reflector blocks do $(l)not$() make up clusters. The components share a combined heat level, so will collectively overheat if they get too hot."
		},
		{
			"anchor": "monitor",
			"type": "blocks/1",
			"header": "Reactor Monitors",
			"block": "nuclearcraft:fission_monitor",
			"text": "Monitors are used to get more localised information about the reactor, particularly the stats of individual clusters."
		},
		{
			"anchor": "fuel_component",
			"type": "blocks/3",
			"header": "Fuel Components",
			"block1": "nuclearcraft:pebble_fission_chamber",
			"block2": "nuclearcraft:solid_fission_cell",
			"block3": "nuclearcraft:salt_fission_vessel",
			"text": "Each type of reactor has an associated fuel component which houses the fission fuel."
		}
	]
}