{
  "name": "Hijacked Enchanting",
  "icon": "srpcotesia:hi_enchanting_table",
  "category": "blocks",
  "pages": [
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:hi_enchanting_table",
      "text": "$(#630000)With a bit of encouragement, a Gnat can 'renovate' an Enchanting Table to dramatically alter its behavior (give a Gnat a normal Enchanting Table).$(br)The Hijacked Enchanting Table is capable of providing any enchantment, even treasures and curses, at any valid level, and can even enchant already enchanted items."
    },
    {
      "type": "text",
      "text": "$(#630000)There's a catch, though. The table sources its enchantments from the surrounding chunks, rather than at random. Each chunk can only provide a single enchantment for an item, so you'll need to search to find a specific one. Furthermore, the process of enchanting can only add one enchantment at a time. Thankfully, the enchantment names are readable."
    },
    {
      "type": "text",
      "text": "$(#630000)Adding enchantments costs experience, biomass, and lapis. The lapis determines the enchantment's level (Ex. Protection IV will cost 4 lapis). A flat experience cost is added for each existing enchantment (this doesn't make any particular enchanting order cheaper, it all costs the same in the end).$(br)For the more tech-savvy reader, the table doesn't actually use levels. Raw experience is used internally."
    },
    {
      "type": "spotlight",
      "link_recipe": false,
      "item": "srpcotesia:bleeding_tome",
      "text": "$(#630000)If you wish to bring a particular chunk's enchantment back to your base, you can place a $(l:items/bleeding_tome)Bleeding Tome$()$(#630000) in the designated table slot to bind it. Placing a bound Bleeding Tome in the slot of any table will cause it to use the book's enchantments.$(br)In other words, put this in the book slot to save, do it again to load."
    },
    {
      "type": "text",
      "text": "$(#630000)Expect any things you do to make a normal Enchanting Table cheaper to work here too (bookshelves, gold tools, etc.)"
    }
  ]
}