{
    "name": "Starter Spells",
    "icon": "ars_nouveau:glyph_break",
	"sortnum":3,
    "category": "getting_started",
    "pages": [
        {
            "type": "text",
            "text": "Starting out, you will only have access to a few effects and forms. Once you have access to the Glyph Press, you will be able to craft any spell. To help you in your decision, here are a few spells to start with."       
        },
		{
            "type": "spotlight",
			"item":"ars_nouveau:glyph_break",
            "title":"Break",
			"text":"A starter effect, combine this with Projectile -> Break or Touch -> Break to harvest iron and lower materials."
        },
		{
            "type": "spotlight",
			"item":"ars_nouveau:glyph_harm",
            "title":"Harm",
			"text":"A starter effect, combine this with Projectile -> Harm or Touch -> Harm to damage enemies a small amount."
        },
		{
            "type": "spotlight",
			"item":"ars_nouveau:glyph_haste",
            "title":"Haste",
			"text":"A tier 1 effect that can be crafted using the Glyph Press. Grants the target a speed boost. Try Self -> Haste"
        },{
            "type": "spotlight",
			"item":"ars_nouveau:glyph_light",
            "title":"Light",
			"text":"A tier 1 effect that can be crafted using the Glyph Press. Creates a permanent light source when used on a block. Cast on entities to grant night vision."
        },
		{
            "type": "spotlight",
			"item":"ars_nouveau:glyph_amplify",
            "title":"Amplify",
			"text":"A tier 1 augment that can be crafted using the Glyph Press. Increases the power of most spells. Try Projectile -> Break -> Amplify -> Amplify for breaking obsidian, or apply to Harm for better damage."
        },
		{
            "type": "spotlight",
			"item":"ars_nouveau:glyph_ignite",
            "title":"Ignite",
			"text":"A tier 1 effect that can be crafted using the Glyph Press. Ignites entities and blocks. A cheap way to increase damage. Try Projectile -> Harm -> Ignite"
        },
		{
            "type": "spotlight",
			"item":"ars_nouveau:glyph_summon_steed",
            "title":"Summon Steed",
			"text":"A tier 1 effect that can be crafted using the Glyph Press. Summons a temporary, tamed, and saddled horse."
        },
		{
            "type": "relations",
            "entries":["machines/glyph_press"],
			"text":"To learn about creating new glyphs, see the section on the Glyph Press."
        }
    ]
}