{
  "name": "Guandao",
  "icon": "srpcotesia:icon_guandao",
  "category": "items",
  "pages": [
    {
      "type": "text",
      "text": "$(#630000)A Guandao is a polearm weapon similar to a Glaive. It sports a long blade with some extra reach and a hook to catch an opponent's weapon. This one, however, is special."
    },
    {
      "type": "text",
      "text": "$(#630000)This parasitic version of the standard weapon emits a defensive cloud of gas which reduces damage taken by nearby parasites, reaching its apex if the foe in question was struck previously. The weapon is also modular, sporting a replaceable blade and blade coating. It is advised to keep it in the hotbar."
    },
    {
      "type": "text",
      "text": "$(#630000)These properties also give it a particularly strong AOE attack, which triggers as long as the strike is fully charged. This tends to only hit other mobs of the same type, but will make an exception for any mobs targeting parasites. It tends to not benefit from enchantments, however."
    },
    {
      "type": "text",
      "text": "$(#630000)The coating determines Tag Damage, a damage additive that applies to any parasite that strikes a foe hit with this weapon. Generally, the stronger the material (i.e. Iron vs Diamond), the more Tag Damage it will deal.$(br)Parasites that attack faster will benefit far less from this!"
    },
    {
      "type": "text",
      "text": "$(#630000)The blade itself determines several other attributes, such as the maximum parasite tier it can buff, among other things. Generally, if a material is from stronger parasites, it's better."
    },
    {
      "type": "text",
      "text": "$(#630000)Crafting the weapon will require a Blood Lotus, Mirewood Pole, 1 Blade material, and 3 of the same Coating material. The latter few change depending on what you choose. Some sort of recipe guide will be useful if this is your first time making one."
    },
    {
      "type": "image",
      "images": ["srpcotesia:textures/book/guandao_example1.png"],
      "text": "$(#630000)Ex. a Gold Ingot is used as the Coating, and Sparse Chitin (Top right) is used for the Blade."
    },
    {
      "type": "text",
      "text": "$(#630000)Generally, any material you can make a standard tool out of will work as a coating, with the addition of Flint as a starter option, but coatings cannot be mixed. The blade materials always have special tooltips, unlike coatings. Feel free to experiment with what you can find."
    },
    {
      "type": "text",
      "flag": "mod:iceandfire",
      "text": "$(#630000)Dragonbone also works as a coating, and can be additionally covered in dragon blood for special effects. The recipe for the latter is as you'd expect from other dragonbone weapons, the weapon itself and a single bottle of blood."
    },
    {
      "type": "text",
      "text": "$(#630000)If you want to swap out your Guandao's blade for a better one, just place it in a crafting grid with the new blade material and it will be replaced. A similar process is used to replace coatings, however 3 of the same material is required instead. Again, use a recipe helper. The previous materials cannot be recovered."
    }
  ]
}