{
  "name": "The Pact and Scent Gland",
  "icon": "srpcotesia:pact",
  "category": "items",
  "pages": [
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:pact",
      "text": "$(#630000)The Pact is a useable item which heralds every parasite within loaded chunks to travel elsewhere, effectively despawning them. It has a few notable exceptions, however:"
    },
    {
      "type": "text",
      "text": "$(#630000)- It will usually avoid Nexus versions, such as Beckons or Dispatchers. If the item is used on a Nexus, however, it will remove all other Nexus versions that are at or below its stage.$(br)- Factories of all kinds are exempt.$(br)- Parasites that specifically cannot despawn, such as those created by a Factory or named with a Name Tag. Anything that heralds persistence."
    },
    {
      "type": "crafting",
      "recipe": "srpcotesia:pact",
      "text": "$(#630000)The item differs in behavior depending on if the Vagrant using it is sneaking. If they are, the item is not consumed and Evolution Cooldowns will not interfere."
    },
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:scent_gland",
      "text": "$(#630000)Otherwise, it will be consumed and produce a Scent Gland marked with the highest ranking parasites dismissed."
    },
    {
      "type": "text",
      "text": "$(#630000)Attacking an entity with a Scent Gland will release an aggressive Scent in the air, as well as apply Prey II to cause it to follow the afflicted.$(br)The created Scent will spawn the dismissed parasites offensively using Worms. This can include any non-deterrent parasite, excluding nexus versions as well."
    },
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:pact_resolute",
      "text": "$(#630000)Additionally, there is a variant of the item which is not consumeable. This replicates the behavior when using the original item without sneaking, without the possibility of accidental usage. That also means no cooldown, other than that on the item itself."
    },
    {
      "type": "crafting",
      "recipe": "srpcotesia:pact_resolute"
    }
  ]
}