{
  "name": "Parasitic Gear",
  "icon": "srparasites:weapon_scythe",
  "category": "items",
  "pages": [
    {
      "type": "text",
      "text": "Samples obtained from parasite species, despite their dangerous nature, can be used to create weaponry and armor."
    },
    {
      "type": "text",
      "text": "There is a wide variety of parasitic equipment that can be forged.$(br2)$(#630000)Many of the pages in this section were torn out."
    },
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:tool_pickaxe",
      "text": "A select few Vagrants were found carrying gear of unknown origin. One of those was the Living Pick-axe, a versatile mining tool. Its serrated edge appears to be capable of mangling both block and armor, and it can harvest most blocks easily."
    },
    {
      "type": "text",
      "text": "As for how they created such a tool, its penchant for armor seems to mirror that of the Living Axe. It is likely these two weapons are related somehow.$(br2)$(#630000)I'll try using a Factory."
    },
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:scalpel",
      "text": "A select few Vagrants were found carrying gear of unknown origin. One of those was the Living Scalpel, a small dagger-esque weapon. Whenever any Vagrant opted to create samples using a Factory, they would always use this tool, possibly due to it being more efficient than a standard Sword."
    },
    {
      "type": "text",
      "text": "This tool does not appear to be craftable from standard samples, although the internal structure of the hilt appears to resemble Infested Dirt.$(br2)$(#630000)I'll try using a Factory."
    },
    {
      "type": "text",
      "text": "For all Living weapons excluding the Scalpel, it appears that a second stage can be reached, that being Sentient. Sentient equipment is generally stronger than Living equipment, requiring that a Living weapon take tens of thousands of lives in order to be created.$(br)As an unfortunate side effect, however, Sentient gear may call out to other parasites, emitting a dangerous scent via the Prey effect."
    },
    {
      "type": "text",
      "text": "$(#630000)That doesn't seem right. Whenever I use a piece of Sentient gear, I feel empowered."
    }
  ]
}