{
  "name": "Fey Crafter",
  "icon": "roots:fey_crafter",
  "category": "crafting",
  "pages": [
    {
      "type": "crafting",
      "recipe": "roots:fey_crafter",
      "text": "The fey crafter was created as a device to channel energy into the construction of powerful objects.$(br2)$(l:concepts/groves)History does not say$() if it was created before or after the $(l:crafting/grove_stone)grove stone$() but one is needed for it to function."
    },
    {
      "type": "text",
      "title": "Grove Stone",
      "text": "The grove stone must be placed within 10 blocks of the crafter, and it must also be activated using the $(l:rituals/ritual_grove_supplication)Grove Supplication ritual$().$(br2)If these steps are correctly performed, bursts of leaves will billow forth from it.$(br2)Some of these leaves will stream toward nearby crafters.$(br2)Working in tandem, great things can now be crafted."
    },
    {
      "type": "text",
      "title": "Recipes",
      "text": "While most objects which are created in the fey crafter have entries in this book, it is possible to view a complete list through JEI (if it is installed).$(br2)You can $(uses:roots:fey_crafter)click here to view this list$() of items.$(br2)$(info) Output items are inserted into adjacent inventories that are not blacklisted, or into the world as an item."
    },
    {
      "type": "text",
      "title": "Automation",
      "text": "While it's possible to use a Vanilla dispenser with a $(l:crafting/knives)knife$() inserted into it to trigger the crafting process, there are limitations.$(br2)$(info) You cannot automatically insert ingredients into the fey crafter, but you can with the $(l:crafting/runic_crafter)runic crafter$().$(br2)$(info) The fey crafter will output a comparator signal of 15 if it is ready to crafter, otherwise 0."
    },
    {
      "type": "text",
      "title": "Movement",
      "text": "A fey crafter can be moved without requiring a new $(l:rituals/ritual_grove_supplication)Grove Supplication ritual$() being performed.$(br2)$(info) So long as the crafter is placed within ten blocks of an active grove stone, it will function properly.$(br2)On the other hand, breaking a grove stone or otherwise moving it will require that you complete the ritual again."
    },
    {
      "type": "relations",
      "anchor": "related",
      "entries": [
        "concepts/groves",
        "concepts/the_fey",
        "crafting/grove_stone",
        "crafting/runic_crafter",
        "crafting/introduction",
        "automation/crafting"
      ]
    }
  ]
}