{  "name": "Introduction - Machines",  "icon": "thermal:iron_gear",  "category": "thermal:machines",  "sortnum": -2,  "read_by_default": true,  "flag": "mod:thermal_expansion",  "pages": [    {      "type": "text",      "text": "Machines use power, in the form of Redstone Flux (RF), to process items and/or fluids. The other entries in this chapter will provide detailed explanations on the function of each one. Brief descriptions are available in a collapsible panel in the GUI of each block. Unupgraded machines use up to 20 RF/t."    },    {      "type": "text",      "text": "In order to improve or modify various aspects of their functionality, machines accept $(l:thermal:technology/augments/introduction)augments$(/l) in the 'Augment' panel. The 'Redstone Control' and 'Configuration' panels set the redstone behavior and side configuration of the machine. By default, machines will work regardless of redstone signal and come with a blank side configuration when first placed, meaning no sides will accept items or fluids."    },    {      "type": "text",      "text": "In the 'Configuration' panel, each side of the block is represented by a square that will cycle through configurations when clicked. Blue and orange represent input and output, respectively. The arrow buttons configure automatic transfer to/from adjacent inventories. Black means that the side will accept in/outputs, but will not automatically transfer. Side configurations are saved when the block is picked up."    },    {      "type": "text",      "text": "The 'Energy' panel offers RF information on the block, such as current RF usage. Every machine has a maximum rate it can use RF, and every recipe a certain RF cost associated with it. These two values, which may be affected by $(l:thermal:technology/augments/introduction)augments$(/l), can be divided to determine the speed a given recipe will be processed. In order to speed up a machine's operation, either the max RF usage can be increased using certain $(l:thermal:technology/augments/machine_speed)augments$(/l) or the RF needed for a recipe can be decreased using $(l:thermal:world/materials/catalysts)catalysts$(/l)."    },    {      "type": "crafting",      "recipe": "thermal:machine_frame",      "text": "These pages contain recipes for common components in machines and devices."    },    {      "type": "crafting",      "recipe": "thermal:redstone_servo",      "recipe2": "thermal:rf_coil"    }  ]}