{
    "type": "manual_content",
    "lang": "en_US",
    "category": "decoration",
    "content": [
        {
            "content_type": "heading",
            "text": "Decoration Blocks",
            "level": 1
        },
        {
            "content_type": "heading",
            "text": "Structure Aesthetic Blocks",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Ancient Warfare has an ever expanding amount of aesthetic blocks designed for use with the default Faction and Structure pack, but they can be used however you like, for whatever you like. \nFirepits: There are Firepits of three different types: Wood only, Circle Firepit, and Square Firepit, and come in unlit and lit versions in creative. Unlit Firepits may be lit using a flint and steel.\n \nTotems and Irminsuls: Totems and Irminsuls are based on off Native American Totem Poles and Germanic/Nordic Irminsul, respectively, and consist of Base Blocks, Middle blocks, and Top blocks. These may be arranged however you like, to whatever height you like.\n \nAltar Pieces: There are Altar pieces with their cloths in every vanilla color, and in two variations: Short and Long Cloths. There are also Altar Candles in every vanilla color, which provide the same light as a torch. Finally, there is the Altar Lectern, which simply provides a book on a lectern for completing your Church aesthetic.\n \nStompi-Lumpa: Stompi-Lumpa is the Elephant God Idol of the Zimba faction, but you may use his majestic presence however you wish.\n \nThe Xoltec Treasures: The Altar Sun piece, the Xoltec Idol Statue, and the Golden Idol are the centerpieces of the Xoltec Nations’s temples, use them however you like.\n \nBraziers: The Braziers are used mainly for lighting and decoration, and come in two variants, Flame and Ember. The Flame Brazier is the more open full flame style, and has a higher light output, useful for outdoor use. The Ember Brazier is much more for decoration, and has a lower light output, useful for dungeons.\n"
        },
        {
            "content_type": "image",
            "path": "/images/Structure_Aesthetics1.jpg",
            "width": 756,
            "height": 413
        },
        {
            "content_type": "text",
            "text": "\n\n\n\n\n\n\n "
        },
        {
            "content_type": "heading",
            "text": "Furniture Blocks",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "In an effort to avoid requiring other mods for AW’s base structure pack, Ancient Warfare provides many general and more specific furniture blocks. There are tables, chairs, and stools in all the vanilla wood types, of which the chairs and stools can be sat on by right clicking them."
        },
        {
            "content_type": "image",
            "path": "/images/Furniture1.jpg",
            "width": 750,
            "height": 410
        },
        {
            "content_type": "heading",
            "text": "Aesthetic Loot Containers",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "AW loots containers are expanding past the simple chest, now including Wooden Coffins with six variants, Stone Coffins with four variants, Gravestones with five variants, Runestones with three variants, a woven Basket chest, and a Urn. All these blocks act similarly to standard loot chests, simply right click them to access the loot."
        },
        {
            "content_type": "image",
            "path": "/images/Loot_Containers1.jpg",
            "width": 750,
            "height": 410
        },
        {
            "content_type": "heading",
            "text": "Dungeon Props",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "AW offers a number of props to be used for dungeon aesthetics, such as the Gallows, the Iron Cage, the Stake, and the Stretching Rack. At the time of this writing, only the Stake offers full functionality of being able to choose an entity to be shown in the prop, along with other specific options. This entity is not actually there is an interactable entity, but simply shown as a part of the block."
        },
        {
            "content_type": "image",
            "path": "/images/Dungeon_Props1.jpg",
            "width": 750,
            "height": 410
        },
        {
            "content_type": "heading",
            "text": "Coin Stacks",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "AW offers a number of props to be used for dungeon aesthetics, such as the Gallows, the Iron Cage, the Stake, and the Stretching Rack. At the time of this writing, only the Stake offers full functionality of being able to choose an entity to be shown in the prop, along with other specific options. This entity is not actually there is an interactable entity, but simply shown as a part of the block."
        },
        {
            "content_type": "image",
            "path": "/images/Coin_Stacks1.jpg",
            "width": 750,
            "height": 410
        }
    ]
}
