{
    "type": "manual_content",
    "lang": "en_US",
    "category": "factions",
    "content": [
        {
            "content_type": "heading",
            "text": "Tribes and Nations",
            "level": 1
        },
        {
            "content_type": "heading",
            "text": "Player Teams and Relations with Factions",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Every Machine, Warehouse, and NPC placed by a Player belongs to that Player, and by default, are not accessible by other Players. In order to allow your friends to access your owned blocks and NPCs, you must add them to your team. This can be done by adding yourself and them to the same team using the vanilla scoreboard commands. Essentially, the commands you need are “/scoreboard teams add YOUR_TEAM_NAME” and “/scoreboard teams join YOUR_TEAM_NAME”. The command to add the team is only needed to be done once, and then you and any others may use the second join command to join the team. More advanced team options can be found out by looking up the usage of the scoreboard commands on the Minecraft Wiki. You can also join a team by using the Team features in the FTBUtils mod.\nThere is no way to join a Nations or Tribes, and this is an intended feature. The factions in the world are meant to be a present, independent force in your world, not something you can just join or take over from the inside."
        },
        {
            "content_type": "heading",
            "text": "Nations",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "“Civilised” factions are categorised as Nations because beside their structures appearing in normal world gen, they will also generate their own unwalled towns and walled cities – plus they will frequently use artillery siege engines to defend them. \nNoggs - Colour (Emerald Green) \nEmpire - Colour (Purple) \nWitchbane - Colour (White) \nXoltec - Colour (Orange) \nNorska - Colour (Light Blue) \nSarkonids - Colour (Red)"
        },
        {
            "content_type": "heading",
            "text": "Tribals",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "“Tribal” factions are categorised as Tribal because they do not generate unwalled towns or walled cities and generally have smaller tribal villages - and usually have no artillery siege engines. \nZimba - Colour (Yellow) \nKongs - Colour (Dark Green) \nBuffloka - Colour (Green) \nPirates - Colour (Ochre) \nBrigands - Colour (Brown) \nOrcs - Colour - (Dark Grey) \nDemons - Colour - (Scarlet) \nThe Undead - Colour - (Light Grey) \nThe Malice (Evil) - Colour (Black) \nThe Guardians (Good) - Colour (Light Green)"
        },
        {
            "content_type": "text",
            "text": "\n\n\n "
        },
        {
            "content_type": "heading",
            "text": "Norska",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Light Blue) \nNorska warriors are tough as nails and dwell in the harsh Snow lands of the north. Their settlements are well fortified and defended, often having guard and beacon towers, and their towns are walled with stout logs. \nNorska Nobles – called Jarls - have Jarls Halls filled with the treasure they have accumulated on their raids across the lands. The Berserker warriors who serve them are ferocious in battle and can sustain damage that would kill any ordinary man five times over. Norska live to fight and battle for them is the purpose of life, dying by brave deeds to earn a place at Odin’s side in Valhalla. \nIn the lands of the Norska, the old Norse Gods hold sway and woe to the traveller who trespasses into the Temples of Odin, Thor and Freya, though great reward awaits the warrior who can complete the Test of the Warriors in the temple of Odin. \nNorska Runecasters are priests of fearsome power – being able to summon Valkyries against intruders.\nNorska raiders may be encountered at sea in their terrible dragon prowed Longships. Norska raiding parties may be discovered everywhere, especially near rivers or coasts - perhaps they are on their way to loot your own humble dwelling even as you read? \nNorskas are enemies of almost everyone, having no love for Orcs, Empires or Witchbaners in particular. \nNorska traders specialise in northern woods, furs and leathers, amber and weapons."
        },
        {
            "content_type": "heading",
            "text": "Bufflokas",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Green) \nOn the plains and prairies and the redwood and maple forests of the world, the wandering clan villages of the noble Bufflokas may be discovered. Proud and tenacious horse warriors, the Bufflokas hunt buffalo and beaver and cultivate corn and rice. Buffloka camps are made up of wigwams and lodges and are heavily defended, not by fortifications, but by the great numbers of warriors each camp supports and can call for reinforcement. \nBuffloka Chieftains are valiant and hard to kill warriors, and Buffloka Shaman have healing abilities and may summon the Totem spirits to defend a village. \nBuffloka traders specialise in furs and leathers beef steaks and accept tools and weapons in exchange."
        },
        {
            "content_type": "heading",
            "text": "Xoltecs",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Orange) \nXoltecs are found in the arid Mesa lands where they raise vast and massy ziggurats to the glory of their dark gods – the Demons of the Nether who they worship with blood sacrifice. \nXoltec settlements are often found perched high on Mesa plateau where complex irrigation systems allow them to grow crops. They are also skilled miners and Xoltec settlements are often riddled with mines and tunnels exploiting rich veins of minerals and metals. \nThe Xoltecs are a military society having many castes of warriors belonging to different orders – the Jaguar Knights and Eagle Knights being amongst the most skilled and ferocious. Xoltec weapons are made from obsidian and can inflict great damage. \nXoltecs are insular and are rarely encountered outside their high barren Mesa’s. \nXoltec Death Priests are the true rulers of Xoltec society and are greatly feared. Those of highest power can often summon Demons from the Nether to attack intruders, and their temples are often filled with treasures offered to their Demonic Gods. However, travellers and adventurers should beware, for they also are protected by many guardians and tricks and traps. \nXoltecs are feared by other tribes and kingdoms due to their habit of sacrificing travellers to their Demonic Gods and are consequently at war with everyone. \nXoltec traders specialise in gems, obsidian, colourful dyes and the produce of their intensive farming."
        },
        {
            "content_type": "heading",
            "text": "Kongs",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Dark Green) \nDeep in the steaming fetid jungles the frenetic sound of beating drums warns the traveller that he is entering the tribal lands of the fearsome Kongs. The Kongs sharpen their teeth to points, the better to eat up the victims the capture, for the Kongs are cannibals who look upon travellers and adventurers as their next lunch, served up perhaps with guava beans and a nice chianti. \nThe Kongs dwell in tree houses concealed amidst the lofty branches of great jungle trees and unwary travellers may find themselves caught in one of their many covered pits beneath them that they use as traps. \nWhilst little is known of the Kongs, they are said to worship a giant Ape of some kind and to sacrifice maidens to him at full moons. \nThe Kongs are primitive warriors and rely on bows and arrows and spears to fight from a distance. But beware – sometimes their arrows can be poisoned. \nKong Shaman are said to be able to summon giant apes to protect their sacrificial sites, and perhaps the highest powered amongst them may even be able to summon their terrible God himself – the King of Kongs! \nKong traders specialise in jungle woods, cocoa and leather and have a fondness for rotten flesh of any kind in return."
        },
        {
            "content_type": "heading",
            "text": "Zimba",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Yellow) \nOn the broad Savannas, amidst the roving herds of elephants, buffalo and zebra are to be found the tribal villages of the mighty Zimba. Although renowned as a peace loving agricultural people, nevertheless the Zimba have many skilled and courageous warriors – their Leopard Warriors are greatly feared by those who have encountered them. \nThe Zimba may be met in their villages and their warrior patrols may be encountered on the savanna and savanna plateau. Zimba horsemen are swift and their bow shots long ranged and accurate -  they are wary of intruders into their lands and may or may not attack them. \nZimba Witchdoctors have healing powers and may summon lions to assist their warriors against intruders. \nZimba traders specialise in wheat, animal meat. Leather and hides and like metals in return."
        },
        {
            "content_type": "heading",
            "text": "The Empire",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Purple) \nThe Empire is eternal, or so its Lords proclaim, and many across the world believe it to be so. The Empire is the dominant power in the world, and its settlements, towns, cities and castles are firmly planted in meadows, plains, birch woods and orchards, holding the land for the Emperor and his court. Empire lands are well populated and rich in farms, mills, smithies, merchant houses and churches. \nEmpire troops consist of the Empire Guards – the elite fighting men of the Emperors Legions and Empire Knights whose lance armed armoured prowess is thought by many to be invincible. They are supported by staunch Halberdiers and Longbowmen and by mounted border guard horse archers. \nEmpire castles, outposts and towers protect their lands and have a seemingly inexhaustible supply of soldiers. \nThe Empire is allied to the Witchbane faction and neutral towards the Guardians and Nogg factions. Everyone else, they are at war with and see as objectives to be conquered and ground beneath their heel. \nEmpire Traders have a wide range of goods and materials; however, they only accept other materials or Empire Coin in return."
        },
        {
            "content_type": "heading",
            "text": "Noggs",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Emerald Green) \nNogg settlements are found far and wide and are perhaps the friendliest people that a traveller may ever meet. The Noggs are a farming and mining race, with a proud lumberjack tradition. Their settlements are most often well-fortified hamlets or small trading towns. \nNoggs make average warriors and rely on a plentiful citizen militia of spearmen, swordsmen and bowmen. Nogg nobles, known as Noggins, are skilled horsemen and their retainers are horse archers. \nNogg priests are noted for their cheerful and happy disposition and their healing powers are good. \nNogg traders will often have a wide range of materials and goods for exchange and will often accept many odd things in return."
        },
        {
            "content_type": "heading",
            "text": "Witchbaners",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (White) \nThe religion of the Empire is the Holy Church and it forms a separate allied faction of the Empire. Always seeking to destroy evil, the undead and anything non-human, it also attempts to destroy the temples and worship places of any other gods. In a sense, the Witchbane is the aggressive crusading arm of the Empires expansion. Witchbane fortifications are usually castles and can be vast affairs with many, many defenders. \nWitchbaners are the military arm of the Empire Church intended to conquer and convert the heathen tribes and nations. They are armoured and efficient warriors and tough to overcome. \nWitchbane priests have strong healing abilities and can resurrect fallen Witchbaners in battle. Those of the highest power may also summon an Angelic warrior to assist them. \nWitchbane traders specialise in books, paper, feathers and ink sacs. They accept Empire Coins and some materials in exchange."
        },
        {
            "content_type": "heading",
            "text": "Sarkonids",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Red) \nIn sweltering deserts may be encountered the desert strongholds of the Sarkonids. These fierce desert warriors defend their sun-parched territories with determination. Sarkonids can be found in isolated villages, outpost towers and in castles and walled cities. \nSarkonids are a friendly nation and try to live peaceably but will defend themselves forcefully if attacked. \nSarkonid Emirs are skilful and cunning fighters and are difficult to beat because of their speed. \nSarkonid priests can resurrect fallen Sarkonids in battle and may call upon desert Djinns to aid them. \nSarkonid traders have a very wide range of materials and items to trade and Sarkonid bazaars are legendary places to visit and trade."
        },
        {
            "content_type": "heading",
            "text": "Pirates",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Ochre) \nWhen the Empire began its expansion and founded its military colonies across the world, the fleets of ships it built to transport its colonists were numerous and strong. Sometimes however, the crews would mutiny against the harsh and oppressive rule of the Empire Captains, and thus the Pirate Brotherhood was born. \nPirates may be encountered at sea in ships, or on coastlands or island pirate strongholds. Pirates take no prisoners, wanting only loot and mayhem and perhaps to drink rum and sing and dance over your cold dead bodies. \nPirate Chieftains can be notoriously hard warriors to beat, often possessing magical weapons and armour looted from previous victims. \nWorst of all, Pirates long ago discovered the secrets of gunpowder so their ships and strongholds are well equipped with cannons. \nPirate Voodoo Priestesses have strong healing powers to restore their warriors, and can sometimes summon undead pirate comrades to assist them. \nPirate traders specialise in selling off the valuables from their ill-gotten gains – so gems, gold, weapons and artefacts they will exchange for often quite mundane items like wood – with which to repair their ships. Pirate traders will always trade for gunpowder."
        },
        {
            "content_type": "heading",
            "text": "Brigands",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Brown) \nIn all lands there are those who seek to prey upon their fellows, or the unwary traveller to rob and steal and murder. Such men are known as Brigands. Brigands can be found just about anywhere and everywhere, though they tend to prefer lonely and isolated places for their bases as they are hunted and killed by all other tribes and kingdoms. \nBrigands can be found in tented camps, ruined towers, caves, abandoned villages and old tombs. \nBrigands are not tough warriors, but often appear in large numbers. \nBrigand Priests are heretics and whilst the are able to heal their own followers, they are also able to throw poison flasks at their enemies.\nBrigand Traders sell off the items they loot and steal from travellers in return for gold, for Brigands are greedy in the extreme and gold is all they desire."
        },
        {
            "content_type": "heading",
            "text": "Orcs",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (dark grey) \nWherever the land is dismal and foggy, where it is barren or wasted, or in long abandoned ruins and deep underground places the horrible sub-human race of Orcs may be found, infesting and polluting the land with the verminous diseased warrens they create. \nDespised by all other races, frequently enslaved and used as warriors by Evil or Demonic factions, the Orcs worship their saviour God Bhaal’ Rogh who it is said will one day give them power over the whole world – a time when all other tribes and kingdoms will be their slaves, thus the brutish Orcs dream. \nOrc Warlords can be unstoppable warriors, destroying their enemies with brute strength, powerful blows and the ability to absorb damage that would slay a man seven times over. Berserker Uruks are ferocious and deadly – often wielding two weapons in attack, whilst Orc archers are sneaky and cunning, often using fire arrows when raiding. \nOrcs hate all others equally, but have an especial loathing of horsemen and horses, who they will always attack on sight. \nOrc Traders will trade metals and stone in return for animal flesh or rotten flesh."
        },
        {
            "content_type": "heading",
            "text": "Demons",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Scarlet) \nIn the dark regions beyond the real world, known to many as the Nether, dark forces lurk and await their chance to break into the world of men once more. These beings are known as Demons – creatures of foul evil and chaos, creatures of fire, and smoke and brimstone. \nAdventurers should beware of finding Demonic Portals to their Nether Cities, or of Sorcerers and Dark Lords who may summon them for a limited time, to do their bidding in the world of men. \nDemons are powerful and almost unkillable creatures of great power and not to be treated lightly."
        },
        {
            "content_type": "heading",
            "text": "Undead",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Light Grey) \nIn decaying deserted tombs. In ancient crypts and mausoleums. In door sealed vaults with verdigris crumbling doors, and long forgotten graveyards, the unquiet dead linger and remain. In abandoned ancient places, concealed in the dark, Lich Lords and Ghost Kings, Wraith Lords and the yet living Mummies of those who once ruled long vanished empires seethe and fester with their hatred of the living and marshal their undead hosts to make war. \nUndead warriors can be hard to beat, yet their weakness to the sun’s rays and gold and silver weapons can be their undoing. \nThe undead have no traders as none will buy the only thing they offer – death."
        },
        {
            "content_type": "heading",
            "text": "The Malice",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Black) \nIn dark forests, festering swamps, brooding ruins and deep lightless underground caverns, Malice lurks and schemes and plots to destroy the world. The creatures of Malice are found everywhere – Evil Sorcerers, Black Knights, Killer Klowns, Servants of Evil, Possessed Scarecrows, Cultists, Vampire Lords, Wights, Spectres and Wraiths all await the unlucky adventurer. \nMalice creatures can be found in Haunted or Ruined castles, in the mountain top strongholds of Vampire Lords and the wasteland towers of Dark Lords. \nEvil Sorcerers and Dark Lords can often summon Demons from the Nether. Malice temples and tombs can be rich in treasures, but are haunted terrifying places, infested with guardians, monsters, traps and trickery. \nThe Malice is at war with everyone, but often allied with the Demon, Orc and Undead factions. \nMalice Traders specialise in potions of harm, poisons and evil magical weapons. But their prices are high and often paid in blood."
        },
        {
            "content_type": "heading",
            "text": "The Guardians",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flag Colour (Light Green) \nTo combat the Malice many forces of good have come together and allied to thwart their evil plans for domination. Elves of the greenwoods, Forest rangers of the North, Questing Knights, Druids and Wizards will always aid and assist the weary traveller beset by the Malice. \nGuardian settlements may be found in many places, from thriving elf holds, to lonely moorland towers, to clifftop wizard’s towers and the sacred tree rings of the Druids. \nGuardian traders will stock useful things and potions for adventurers, and ask for food, weapons and coins in exchange."
        }
    ]
}
