{
    "type": "manual_content",
    "lang": "en_US",
    "category": "research",
    "content": [
        {
            "content_type": "heading",
            "text": "Research System",
            "level": 1
        },
        {
            "content_type": "text",
            "text": "Ancient Warfare has an in-depth research system that only allows access to blocks and items once the associated research is completed. Researches are tied to the player, and accessible through the Research Book"
        },
        {
            "content_type": "item",
            "name": "ancientwarfare:research_book"
        },
        {
            "content_type": "heading",
            "text": "Research Book",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Research Book can be assigned to the player by holding it in your hand, and right clicking. A text message will appear saying that the Researcher is set for the Book. Right click again to open the Research Book. \nBy default, the Research Book displays a list of all the Researches, and if a research is clicked on, what can be unlocked by completing that research. This can be changed to an Item list by clicking the checkbox on the upper left hand corner. The Item list displays a list of all the items in Ancient Warfare, and if the item is clicked on, it will display the recipe and the research needed for the item. Copies of the Research Book can be made by making another Book and assigning it to the player, it will contain all the Researches the player has unlocked."
        },
        {
            "content_type": "item",
            "name": "ancientwarfare:research_station"
        },
        {
            "content_type": "heading",
            "text": "Research Bench",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "In order to begin researching, place your assigned Research Book inside a Research Bench in the slot in the upper left hand corner. Once the book is placed, the “No Researcher” should change to the name of the player who owns the book. The Open button directly next to this slot will open up the Research Book. \nNext, click on the “Research Queue” button directly to the right of the book will open up a menu where you can add Researches to the queue. You can add as many Researches to this queue as you like, and as you add Researches, other Researches will begin to appear. \nOnce you have your Researches queued, hit the ESC key to return to the Research Station menu, and you can see the items necessary to complete the first research in the queue is displayed in the “Needed” grid. Place the items into the “Input” grid to begin research, which should begin as soon as all the minimum item amounts are placed into the grid. NOTE: AW uses OreDict for many of the ingredients in the researches, so be aware that many items shown in the “Needed” grid can change between opening of the Bench, but the items will be accepted as long as they match the category. Progress on the Research will be displayed by a green progress bar. The items do not need to be placed in the same exact orientation as the “Needed” grid. \nThe “Adj Inv” checkbox enables using an adjacent inventory, such as a chest, to input items directly to the “Input” grid. The two buttons directly below the progress bar are used to determine the position of the Adjacent Inventory. The left button can be changed to the four cardinal directions and Up and Down, which tell the Research Bench where to look for the Adjacent Inventory. The right button should be left alone, except in special circumstances."
        },
        {
            "content_type": "item",
            "name": "ancientwarfare:engineering_station"
        },
        {
            "content_type": "heading",
            "text": "Engineering Bench",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Because of the Research System, you cannot craft Ancient Warfare items and blocks unlocked by researches in a crafting table. Instead, the Engineering Bench is needed. \nTake your Research Book out of the Research Bench, or make a copy, and put it into the Engineering Bench. Now, items unlocked through researches can be crafted in there. \nThe Engineering Bench crafting grid works like a template, meaning you only need to put in the recipe for the item/block into the grid, and because of this, the Table has a small inventory space. The Table will draw from this inventory space as you take from the output slot. "
        }
    ]
}
