{
    "type": "manual_content",
    "lang": "en_US",
    "category": "torque",
    "content": [
        {
            "content_type": "heading",
            "text": "Torque Energy system",
            "level": 1
        },
        {
            "content_type": "text",
            "text": "Ancient Warfare has its own power system, known as Torque, to allow Ancient Warfare to have a fully stand-alone power system, while remaining compatible with other power systems such as RF. Torque is based on the real life physics principle of Torque and the power that entails. This means it is also affected by friction, and every Torque tile will incur loss of Torque due to it. \nRF is converted into Torque at a 10:1 ratio, and works as if it were a native connection, i.e, full input and output connectivity. This should work on any RF enabled mod, but the RedstoneFlux mod itself must be in your setup, and mods that only use the label RF will not function correctly without external converters."
        },
        {
            "content_type": "text",
            "text": "\n\n "
        },
        {
            "content_type": "item",
            "name": "ancientwarfare:diamond_hammer",
            "data": 3
        },
        {
            "content_type": "heading",
            "text": "Torque Generation",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Ancient Warfare Hammer item can be used by the player to produce torque, to rotate blocks including Torque tiles and machines, or as a weapon. You can use the “Z’ key to toggle mods, and use left click to attack, and right click to perform the special operations. Hover over the Hammer to view the tooltip. \n \n \n \n \n"
        },
        {
            "content_type": "image",
            "path": "/images/Windmill1.jpg",
            "width": 756,
            "height": 425
        },
        {
            "content_type": "image",
            "path": "/images/Windmill2.jpg",
            "width": 756,
            "height": 425
        },
        {
            "content_type": "heading",
            "text": "Windmill",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Windmill is a multi-block structure for generating torque. It consists of a windmill control block and windmill blade blocks. The size of the windmill blade blocks being a full sqaure of any odd size from a minimum of 5x5 to a maximum of 17x17, one block thick. Once the blade blocks are correctly arranged, they will render into the actual blades of a windmill. Place the windmill controller block on either side of the central shaft of the blades. Two control blocks will provide no benefit, only one controller will receive power. The larger the windmill, the more Torque is outputted."
        },
        {
            "content_type": "image",
            "path": "/images/Waterwheel1.jpg",
            "width": 756,
            "height": 425
        },
        {
            "content_type": "heading",
            "text": "Waterwheel",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Waterwheel consists of the Waterwheel controller block, and some source of flowing water. The Waterwheel must face towards the source of flowing water, and once it is correctly oriented, the waterwheel will render and begin spinning. The waterwheel requires at least 3x3 blocks centered about the controller to render."
        },
        {
            "content_type": "item",
            "name": "ancientwarfareautomation:stirling_generator"
        },
        {
            "content_type": "heading",
            "text": "Sterling Generator",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Sterling Generator generates Torque by burning fuel, producing 1 Torque per tick as long as it has fuel. Anything registered as fuel can be used, and it will generate a constant power amount regardless of what the fuel is. Burn time is determined by vanilla burn time, or if it is a modded fuel, the burn time set by the mod."
        },
        {
            "content_type": "item",
            "name": "ancientwarfareautomation:hand_cranked_generator"
        },
        {
            "content_type": "heading",
            "text": "Hand-Cranked Generator",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Hand-Cranked Generator produces Torque from player or NPC input. The Craftsman and Worker NPC will view it as a worksite, and the player may produce power through it by right-clicking with a Hammer in work mode."
        },
        {
            "content_type": "heading",
            "text": "Torque Transfer and Storage",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Ancient Warfare provides a method of transferring Torque power from any of the generators to the Torque consuming machines or Torque Storage blocks. The Hammer can be used to rotate these blocks, but as a general rule of thumb, build your transfer system FROM the consumers TO the producer. The amount of Torque inside a Torque tile can be found by right clicking on a Torque tile with an empty hand. This will show the amount of power stored, the amount of power coming in, the amount of power going out, and the amount of power lost due to friction."
        },
        {
            "content_type": "item",
            "items": [
                {
                    "name": "ancientwarfareautomation:torque_shaft",
                    "data": 0
                },
                {
                    "name": "ancientwarfareautomation:torque_shaft",
                    "data": 1
                },
                {
                    "name": "ancientwarfareautomation:torque_shaft",
                    "data": 2
                }
            ]
        },
        {
            "content_type": "heading",
            "text": "Torque Shafts",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Torque Shafts serve as the most common part of a Torque transfer system. It has a single input and output side, and can only transfer Torque in a straight line. It has the least Torque loss, is cheaper to make, and is the simplest transfer block."
        },
        {
            "content_type": "item",
            "items": [
                {
                    "name": "ancientwarfareautomation:torque_junction",
                    "data": 0
                },
                {
                    "name": "ancientwarfareautomation:torque_junction",
                    "data": 1
                },
                {
                    "name": "ancientwarfareautomation:torque_junction",
                    "data": 2
                }
            ]
        },
        {
            "content_type": "heading",
            "text": "Torque Junctions",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Torque Junctions allow for turns and bends in the Torque Transfer system. It has a five inputs and a single output side, allow it to not only act as single direction turn, but also as a merger of other Torque Shaft lines into a single one. The output side is denoted by a slightly off color side of the cube, a dark square bordering the edge of it. When properly connected, the Junction will connect with adjacent Shafts, other Junctions, and Distributors."
        },
        {
            "content_type": "text",
            "text": "\n\n "
        },
        {
            "content_type": "item",
            "items": [
                {
                    "name": "ancientwarfareautomation:torque_distributor",
                    "data": 0
                },
                {
                    "name": "ancientwarfareautomation:torque_distributor",
                    "data": 1
                },
                {
                    "name": "ancientwarfareautomation:torque_distributor",
                    "data": 2
                }
            ]
        },
        {
            "content_type": "heading",
            "text": "Torque Distributors",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Torque Distributors are used to split a single Torque Shaft lines into multiple ones. It has a single input, and five output sides, so it can be used to distribute power to multiple directions from a single input."
        },
        {
            "content_type": "text",
            "text": "\n\n\n\n\n "
        },
        {
            "content_type": "image",
            "path": "/images/Flywheel_Storage1.jpg",
            "width": 756,
            "height": 425
        },
        {
            "content_type": "heading",
            "text": "Flywheel Storage",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "The Flywheel Storage system can be used for temporary energy storage, but as they do have high power loss in comparison to the Shafts, Junctions, and Distributors, Flywheels are used mostly for medium term energy storage needs, but the loss will eventually drain the stockpile. Flywheels are a multiblock structure consisting of a Flywheel Controller block, and at least one Flywheel Energy Storage block. The Controller block should be placed on top of the Energy Storage block, which can be a maximum of 21 blocks tall. The Energy Storage blocks can also be arranged in a 3x3 multiblock, with the Controller on the top middle block. When properly set up, and with enough power in the Controller block, the Flywheel will begin to spin."
        },
        {
            "content_type": "heading",
            "text": "Tiers",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Each of the above Transfer and Storage blocks come in three different tiers. These tiers are Light, Medium, and Heavy, each progressively more efficient than the previous. Lower tiers have lower Torque transfer ability, and higher Torque loss, while higher tiers have higher Torque transfer ability and lower Torque loss."
        }
    ]
}
