{
    "name": "Your First Reactor",
    "icon": "bigreactors:basic_reactorcasing",
    "category": "bigreactors:intro",

    "pages": [
        {
            "type": "patchouli:text",
            "text": "The Reactor is a multiblock machine whose primary job is to produce energy, and a lot of it.$(br2)A multiblock machine is composed by many different blocks that you will place in the world next to each others.$(br2)To craft and power the Reactor you need Yellorium ingots, so go mine some Yellorite Ore and smelt it right away!"
        },
        {
            "type": "bigreactors:zcmultiblock",
            "multiblock_id" : "bigreactors:bookfirstbasicreactor"
        },
        {
            "type": "patchouli:text",
            "text": "To build your first Reactor you need to craft the following Basic Reactor blocks:$(br2)$(li)22x Casing$(li)1x Controller$(li)1x Control Rod$(li)1x Fuel Rod$(li)1x Solid Access Port$(li)1x Active Forge Energy Power Tap$(br2)The Glass block is actually optional and can be replaced by another Casing block."
        },
        {
            "type": "bigreactors:crafting1x",
            "title1": "Casing",
            "recipe1": "bigreactors:reactor/basic/casing",
            "title2": "Glass",
            "recipe2": "bigreactors:reactor/basic/glass"
        },
        {
            "type": "bigreactors:crafting1x",
            "title1": "Controller",
            "recipe1": "bigreactors:reactor/basic/controller_ingots_uranium",
            "title2": "Control Rod",
            "recipe2": "bigreactors:reactor/basic/controlrod"
        },
        {
            "type": "bigreactors:crafting1x",
            "title1": "Fuel Rod",
            "recipe1": "bigreactors:reactor/basic/fuelrod_ingots_uranium",
            "title2": "Access Port",
            "recipe2": "bigreactors:reactor/basic/solidaccessport"
        },
        {
            "type": "bigreactors:crafting-text",
            "title": "Forge Power Tap",
            "recipe": "bigreactors:reactor/basic/activetap_fe",
            "text": "Once you have crafted all the required blocks, you are ready to build your first Reactor.$(br2)Place the blocks in your world using the following diagram, putting the Fuel Rod in the center with a Casing below."
        },
        {
            "type": "bigreactors:zcmultiblock",
            "multiblock_id" : "bigreactors:bookfirstbasicreactor"
        },
        {
            "type": "patchouli:text",
            "text": "If all goes well, when you place the last block the Reactor will form and you can now open the Controller interface by right-clicking on the Controller block.$(br2)If nothing happens, right click on any block you placed down: you will get an error message that should explain what the problem is. Once you have fixed it, you should have a formed Reactor or another error message waiting for you."
        },
        {
            "type": "patchouli:text",
            "text": "Now that your Reactor is ready, it's time to put some fuel in it.$(br2)Pick up more Yellorium ingots and right-click on the Solid Access Port. Set the Port to Inlet mode and place your ingots in the input slot.$(br2)The ingots will be quickly consumed by the Reactor and turned into fuel.$(br2)Open the Controller interface and turn your Reactor on!"
        },
        {
            "type": "patchouli:text",
            "text": "As the Reactor heats up, energy is slowly being produced and the internal energy buffer filled.$(br2)To use the energy stored inside the Reactor you need to connect some sort of energy pipe or a machine to the Active Forge Power Tap.$(br)The Power Tap will send out energy to the connected block (if it can accept it)"
        },
        {
            "type": "patchouli:text",
            "text": "Congratulations, you have built your first Reactor!$(br2)Use it to generate all the energy you need for your early game needs and them move on to build other Reactors and Turbines after you have read the remainder of this handbook."
        }
    ]
}