{
  "name": "Minerals",
  "category": "world",
  "icon": "bewitchment:amethyst",
  "pages": [
	{
	  "type": "text",
	  "text": "While inorganic, minerals, from gems to stones to metals, are just as important in Witchcraft."
	},
	{
	  "type": "empty",
	  "draw_filler": false
	},
	{
	  "type": "text",
	  "title": "Coquina",
	  "text": "A type of sedimentary stone found on Beaches. This stone has a powerful connection to the oceans and is in fact composed of the remains of shellfish."
	},
	{
	  "type": "image",
	  "images": [
		"bewitchment:textures/gui/patchouli/coquina.png"
	  ],
	  "border": true
	},
	{
	  "type": "text",
	  "title": "Amethyst",
	  "text": "An incredibly popular purple crystal. It is used to help boost offensive magics, and some claim it can affect health positively."
	},
	{
	  "type": "image",
	  "images": [
		"bewitchment:textures/gui/patchouli/amethyst.png"
	  ],
	  "border": true
	},
	{
	  "type": "text",
	  "title": "Garnet",
	  "text": "A gemstone with a deep red-purple hue. This gem is very good at protecting from evil magics, and as such, has defensive properties."
	},
	{
	  "type": "image",
	  "images": [
		"bewitchment:textures/gui/patchouli/garnet.png"
	  ],
	  "border": true
	},
	{
	  "type": "text",
	  "title": "Opal",
	  "text": "A whitish gem known for its “play of colour” or “fire”, a brilliant light show that changes based on how its held. This gem aids support-based magic, such as enhancing powers."
	},
	{
	  "type": "image",
	  "images": [
		"bewitchment:textures/gui/patchouli/opal.png"
	  ],
	  "border": true
	},
	{
	  "type": "text",
	  "title": "Salt",
	  "text": "A mineral found fairly shallow underground. While seeming rather inconspicuous, salt is used to protect against all forms of supernatural creatures, acting as a physical barrier of sorts towards them."
	},
	{
	  "type": "image",
	  "images": [
		"bewitchment:textures/gui/patchouli/salt.png"
	  ],
	  "border": true
	},
	{
	  "type": "text",
	  "title": "Silver",
	  "text": "A brilliant metal, next to only gold. Representing the moon as well as purity, silver is a coveted metal used in many magical devices. It also finds widespread use in slaying supernatural beings, commonly werewolves, but vampires and other undead are also harmed by it."
	},
	{
	  "type": "image",
	  "images": [
		"bewitchment:textures/gui/patchouli/silver.png"
	  ],
	  "border": true
	}
  ]
}
