{
  "name": "Trees",
  "category": "world",
  "icon": "bewitchment:elder_sapling",
  "pages": [
	{
	  "type": "text",
	  "text": "Commonly seen in all manners of forests, trees are the backbone of most witchcraft."
	},
	{
	  "type": "empty",
	  "draw_filler": false
	},
	{
	  "type": "text",
	  "title": "Cypress",
	  "text": "A tall and dark tree found in coniferous settings, such as Taigas. This tree is associated with death and the afterlife, and is vital to creating the Ebb of Death fume. Despite this, brooms made from its wood give the rider temporary resistance when in flight."
	},
	{
	  "type": "image",
	  "images": [
		"bewitchment:textures/gui/patchouli/cypress.png"
	  ],
	  "border": true
	},
	{
	  "type": "text",
	  "title": "Elder",
	  "text": "Elder is a tree that is commonly seen in lush forests, including common Forests and Birch Forests. This tree is associated with wisdom and its saplings produce the Drop of Wisdom fume. Magic brooms made from this tree's wood are among the fastest. This tree also produces juicy berries, which your father smelt of."
	},
	{
	  "type": "image",
	  "images": [
		"bewitchment:textures/gui/patchouli/elder.png"
	  ],
	  "border": true
	},
	{
	  "type": "text",
	  "title": "Juniper",
	  "text": "A tree mostly found in arid settings, most commonly in the Savanna. This tree is renowned for its great magic powers, and extracts from young trees are used to make Liquid Witchcraft. Brooms of this wood type have innate magic powers, and do not need ME to fly. It produces small blue berry-like cones that are a popular spice."
	},
	{
	  "type": "image",
	  "images": [
		"bewitchment:textures/gui/patchouli/juniper.png"
	  ],
	  "border": true
	},
	{
	  "type": "text",
	  "title": "Dragon's Blood",
	  "text": "A rare tree valued for its resin, having many uses but most commonly used for Sigils. This tree is extinct in the wild, however certain Alchemists are known to cultivate this tree in private, and may give out saplings to those they trust. Slashing a mature log with a Boline taps it, allowing its blood-red resin to leak out. Brooms made from this rare tree are faster than all but Elder brooms,"
	},
	{
	  "type": "image",
	  "images": [
		"bewitchment:textures/gui/patchouli/dragonsblood.png"
	  ],
	  "border": true,
	  "text": "but in turn they can have Sigils applied to them, which it will then apply to the rider."
	}
  ]
}
