{
  "name": "Extruder Module Mk1",
  "category": "modules",
  "icon": "modularrouters:extruder_module_1",
  "pages": [
    {
      "type": "text",
      "text": "This module extends and withdraws a row of blocks (from the router's buffer) in the module's configured direction.$(p)By default, the module extends blocks when the router has a redstone signal, and withdraws them when the router has no signal, but a Redstone Enhancement can be added to the module to customise this behaviour."
    },
    {
      "type": "text",
      "text": "Using this module, it's possible to build large extending bridges and doorways. (If you ever used the Tinker's Drawbridge from the Tinker's Mechworks mod in 1.7.10, the functionality will be familiar).$(li)See also the $(l:upgrades/camouflage)Camouflage Upgrade/$, which may be useful to hide the router.$(li)The default range (i.e. number of blocks which can be placed) is 12, but this can be increased up to 24 with $(l:augments/range_up)Range Up Augments/$."
    },
    {
      "type": "text",
      "text": "$(li)If you change the module's direction while it has blocks extended, you may get the router a little confused. In this case, breaking and replacing the router will help.$(li)If you break the router while blocks are extended, it won't remember that, and you'll need to manually remove those blocks."
    },
    {
      "type": "text",
      "text": "$(li)If you have multiple routers together with Extruder Modules installed (e.g. for a wide door or bridge), you may find the $(l:upgrades/sync)Sync Upgrade/$ useful to ensure they all run on the same tick.$(li)The Extruder (like the $(l:modules/placer)Placer/$) can also plant crop seeds on farmland, and cocoa beans on an adjacent jungle log."
    },
    {
      "type": "text",
      "text": "It is important to note that the $(l:modules/breaker)Breaker Module/$ used to craft this module will transfer its harvest level (and enchantments) to this module. So if you want your Extruder Module to be able to break $(item)Obsidian/$, for example, make sure you use a Breaker Module crafted with a $(item)Diamond Pickaxe/$!"
    },
    {
      "type": "crafting",
      "recipe": "modularrouters:extruder_module_1"
    }
  ]
}
