{
  "name": "The Dimensional Nexus",
  "icon": "elementaristics:nexus_dimensional",
  "category": "matter_manipulation",
  "pages": [
    {
      "type": "text",
      "text": "The $(item)Dimensional Nexus$() is one of the more curious devices. When sent into the world, it will create a connection to the Outer and the Inner Threshold, the borders of Beyond and the Mind respectively."
    },
    {
      "type": "crafting",
      "recipe": "elementaristics:nexus_dimensional",
      "text": "$(o)Does this count as reverse Inception?$()"
    },
    {
      "type": "text",
      "text": "In order to take advantage of this connection, a \"qualified user\" must use an $(item)Incantation$() in close proximity of the nexus. A qualified user is everyone who either is the owner of the nexus, or is in the same cult as the owner (see: $(l:lessons/entry_cult)Cults$()). $(br)An active rite will drain the Magan of all qualified participants. Further information on how much energy is required for the rite is written on the incantation."
    },
    {
      "type": "text",
      "text": "Additionally, each rite needs a certain minimal amount of $(marked)item power$() and certain $(marked)aspects$(), both of which are specified on the incantation.$(br)In order to get certain aspects for a rite or to push up the amount of item power, $(item)Rite Tools$() or $(item)Materials$() must be used, tools or materials with aspects and power. $(br)These must be held by the cultists close to the altar. Materials will get consumed, tools will not."
    },
    {
      "type": "text",
      "text": "Additionally, the tool power will only increase if the tool's aspects are relevant. $(br)Once all aspects are present and the item power of the rite tools is greater or equal to the power needed, the rite will be finished. $(br)It should be noted, that some rites have an effect during the performing of the rite and that sometimes a certain soul type is required."
    },
    {
      "type": "text",
      "text": "If a certain soul type $(o) is$() required, it is written on the incantation.$(br2)Rites can always be stopped by using the same incantation again, and the Nexus can always be removed by the owner. This is done by hitting it while sneaking."
    }
  ],
  "advancement": "elementaristics:progress_ascension"
}