{
    "type": "manual_content",
    "lang": "en_US",
    "category": "structures",
    "content": [
        {
            "content_type": "heading",
            "text": "Introduction and Commands",
            "level": 1
        },
        {
            "content_type": "text",
            "text": "Ancient Warfare has a in-depth and expansive structure creation system, both for Survival use, Creative use, and for creating World gen structures that spawn on chunk load like vanilla villages. It also includes decorative blocks and items for use in structures, such custom sized Gates, Advanced Mob Spawners, Loot Chests, Sound Blocks, Builder Tools, Fire pits, Totem Poles, and Irminsul.  \nAW comes with some very useful commands that help you identify blocks, biome and entities in your current game set up. \n/awutils exportblocks \nThis command will dump a .csv list of all blocks, from every mod you currently have in your own personal game set up. \n/awutils exportbiomes \nThis command will dump a .csv list of all biomes that are currently in your world set up from every mod you currently have in your own personal game set up. \n/awutils exportentities \nThis command will dump a .csv list of all mobs that are currently in your world set up from every mod you currently have in your own personal game set up. This is vitally important for setting up AW NPC faction lists of mobs to target or not. \n/awutils exportloottables\nThis command will export a list of all loot tables in your game, from vanilla, and all mods that use them. \nThe resultant .csv docs that AW dumps can be found in the export folder in your AW Config folder."
        },
        {
            "content_type": "item",
            "name": "ancientwarfarestructure:gate_spawner"
        },
        {
            "content_type": "heading",
            "text": "Gates",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Gates can be opened by right clicking them, near the sides or the top if possible. They can also be controlled via redstone mechanisms at the bottom right and left corners, via blocks next to that. Gates can only be opened with the right click by their owners or players on their team. Owners or teammates can repack a Gate or Drawbridge by shift right clicking the Gate and clicking repack in the GUI that pops up. Shift right clicking will also allow you to change the owner of the Gate. Leaving that field blank will make it a public gate, able to be opened by anyone. \nThere are six different styles of Gates, all of which are named very self explanatory, and one drawbridge style. In order to place a Gate, simply follow these steps. \nChoose top left of where you want the gate to be, a 1 block wide white bounding box will appear. By default, press the Z key. \nNow choose bottom right of where you want your gate to be and the same white bounding box will appear again. Press the Z key. \nThen, click the right mouse button on the floor of the center of the gate. The Gate should appear."
        },
		{
            "content_type": "image",
            "path": "/images/Gates1.jpg",
            "width": 756,
            "height": 425
        },
        {
            "content_type": "text",
            "text": "To place Drawbridges is a very similar process, but has some key differences, follow the steps below to do it properly. \nFirst, we will start with this practice construction, and note that on both sides of the structure where the drawbridge is to start and end, the floor is sunk one block below the road on the end side, and the tower floor on the start side. This is so that when the drawbridge is in the down position, it is seamless with the two sides."
        },
		{
            "content_type": "image",
            "path": "/images/Drawbridge1.jpg",
            "width": 756,
            "height": 393
        },
        {
            "content_type": "text",
            "text": "Now the most important thing when constructing the drawbridge gateway frame (the bit stuck up from the rest of the tower – made of stone bricks) is to understand that it must be as tall in blocks high, as the length of the blocks you intend it to span. In this case the length from the drawbridge start position to its end position, including the stone brick blocks it will sit in either side, is 11 blocks. This means that the “empty” part of the gateway the drawbridge will fit into has to be 11 blocks tall."
        },
		{
            "content_type": "image",
            "path": "/images/Drawbridge2.jpg",
            "width": 756,
            "height": 393
        },
		{
            "content_type": "text",
            "text": "Now, the next steps are mostly the same as regular Gates. First, look at the lower left corner of where you want to put the Drawbridge, and the 1 block bounding block should appear. Press the Z key. Next, go to the top left corner, and see the bounding box appear, then press the Z key. Looking over the whole gateway, you should see the bounding box in proper setting. Next, go to the bottom of the gateway, and press right click on the floor of the gateway. \nNOTE: Make sure to be facing out towards the way you want the Drawbridge to rotate down towards, if you’re facing the wrong way, the Drawbridge will open the wrong way."
        },
		{
            "content_type": "image",
            "path": "/images/Drawbridge3.jpg",
            "width": 756,
            "height": 392
        },
        {
            "content_type": "heading",
            "text": "Loot Chests",
            "level": 2
        },
		{
            "content_type": "text",
            "text": "Stocking structures with NPCs and Mobs is vital to make them interesting and challenging for players to explore and conquer. But when they have conquered your build, they must be rewarded! This is where loot chests have always been the traditional Minecraft reward system. AW is no different, but for structure builders we provide a handy tool called The Loot Chest Placer wand. \nBefore we look at how to use it, its important to understand a .cfg file that controls it.  In your AW config folder you will find  “AncientWarfareStructures.cfg” – within this doc is this section:"
        },
		{
            "content_type": "image",
            "path": "/images/LootChest1.jpg",
            "width": 756,
            "height": 465
        },
		{
            "content_type": "text",
            "text": "The AW loot chest placer is designed to register all loot chests and lists provided by Minecraft and by every Mod you have loaded in your personal game. But besides the standard dungeon and blacksmiths chests you will find the drops for individual mobs, as many mods list their mob drops this way. Because this makes a very long list for the tool, we have “excluded” a whole host of mob drops – and they appear as in the pic above, on the exclusion list, so will not appear in the selection GUI for the tool in game. \nIf you are finding that mods we have not covered are also adding too many irrelevant or unneeded entries, you can add those items to the list above too. (post your additions on the AW forum or discord if you wish us to add them to the mod as standard exclusions) If you find you actually want to be able to select mob drops we have excluded – simply delete the entry in the list above, and it will reappear in the Loot Placer tool selection list in game. \nNow we can begin to use the Loot Chest Placer Tool, available only in Creative. Right clicking with the tool in your hand will open its GUI, which displays all the available loot chest types. You can select the it by simply clicking on the type you want, and then adjust the amount of loot rolls you want. Loot rolls simply adjust the amount of loot will be placed in the chest. 0 means nothing will be placed there, 1 will apply the amount the loot chest is set to by default, 2 is double, 3 is triple, and so on. Once you have your type and amount of loot rolls selected, simply exit the GUI, and then you can right click with the tool to place the loot chest. You can place double chests by simply right clicking again next to an existing loot chest of the same type. You should NOT open these chests, since it will not spawn the loot properly if you have opened it."
        },
		{
            "content_type": "image",
            "path": "/images/LootChest2.jpg",
            "width": 756,
            "height": 423
        },
		{
            "content_type": "image",
            "path": "/images/LootChest3.jpg",
            "width": 756,
            "height": 423
        },
        {
            "content_type": "heading",
            "text": "Advanced Spawner",
            "level": 2
        },
		{
            "content_type": "text",
            "text": "AW has method of ensuring mobs spawn in certain places for your builds, in both an advanced mode of placing them in one offs, and more traditional vanilla constant spawning. \nThe vanilla mob spawner has a default first spawn delay of 20 ticks. But this delay will only start ticking away, if a player (creative included) is within a 16 blocks range. \nIts minimum spawn delay is 200. \nIts maximum spawn delay is 800. \nIts maximum entities is 6. \nIts spawn range is 4 blocks. \nAll vanilla mob spawners simply check each tick on the entire player list to see if any is within activation range. Then they wait the delay, then they do other checks to spawn groups of mobs. Which means that the more players, the more spawners, the more server cpu time is spent on trying to activate mob spawners, multiplicatively. \n\nThe AW 'Advanced spawners' wait the delay, then check players within range (if any is set), then do the other checks to spawn a group of mobs. Since a delay is much faster to process than player and other checks, it is much more optimized. And with a randomized delay, the load of the other checks are diluted over the blocks, making a much smoother game. Most checks are also optional, to further improve the efficiency of each spawner. \nKnowing these original Minecraft vanilla values, and how the AW ones differ, allows you to make good estimates on what changing those values in the AW Mob Spawner will do. \nMost entities whether vanilla ones or mod made want to have a final say in whether they can spawn or not. For example, a 'Pig' requires grass blocks and a clear area, or it simply will not spawn. Many creatures, including AW NPCs, will not spawn in any liquid, such as water or lava. Some mobs will not spawn on wooden planks, or slabs, and others have difficulty on BOP terrain blocks. There are also conditions set by the modders whose mods the mobs are coming from – for example some mobs will only spawn in the Nether, creatures from Dungeon Mobs mod have level underground height restrictions etc. \nBut here is the good news; the AW mob spawner block completely overrides all these conditions and forces the entity to spawn where you want it to. However, this comes with a certain drawback – namely, you must leave enough open space for the mob to spawn at the location you place the spawner. It is advised to set both a big 'spawnRange' value, and have a large clear space, for big mobs (such as the ender dragon). \nSimilarly, even small mobs need a clear area to spawn in, relevant to their size – so for example, a mob spawner set in a 1 block wide x 2 block high tunnel will have difficulty spawning a LOTR Troll for example, but could spawn a LOTR Orc.\nMobs that spawn in too small a space will embed into blocks and be killed. \n\nBefore we look at how to use spawner blocks, it’s important to understand a .cfg file that controls it.  In your AW config folder you will find  'AncientWarfareStructures.cfg' – within this doc is this section. \nThe AW spawner blocks are designed to register all mobs, creatures and NPC’s provided by Minecraft and by every Mod you have loaded in your personal game. Because many entities are registered in this class by mods, that are not really mobs at all, this makes a very long list for the tool, so we have “excluded” a whole host of such entities from various mods – and they appear as in the pic above, on the exclusion list, so will not appear in the selection GUI for the spawner in game. If you are finding that mods we have not covered are also adding too many irrelevant or unneeded entities to your mob spawner, you can add those items to the list above too. (post your additions on the AW forum or discord if you wish us to add them to the mod as standard exclusions) If you find you actually want to be able to select entities we have excluded – simply delete the entry in the list above, and it will reappear in the tools selection list in game."
        },
		{
            "content_type": "image",
            "path": "/images/Spawning1.jpg",
            "width": 756,
            "height": 466
        },
		{
            "content_type": "text",
            "text": "There are two methods of using the AW Spawning Tools. The first is by using the mob spawner placement tool (wand), and the second is manually placing the block, which will require putting the entity in manually. \nThe placement tool method, which allows for rapidly stocking a structure with many of the same type of a mob, is the easiest method. To start, grab the mob spawner wand tool, only in creative, and the spawn egg or NPC item for the mob you want to set the spawner for. Spawn the mob, and right click it with the wand; the mob will disappear and the wand will be set to place down a spawner of that mob."
        },
		{
            "content_type": "image",
            "path": "/images/Spawning2.jpg",
            "width": 756,
            "height": 423
        },
		{
            "content_type": "image",
            "path": "/images/Spawning3.jpg",
            "width": 756,
            "height": 423
        },
		{
            "content_type": "image",
            "path": "/images/Spawning4.jpg",
            "width": 756,
            "height": 423
        },
		{
            "content_type": "text",
            "text": "With an empty hand, you can access the GUI of the spawners you’ve placed down. This GUI has all the control options for the block, which will explained in detail in below. \n\nPhysical Properties \nDebug Mode \nWhether creative players are 'visible' for player checking by the spawner. This means that if you want to watch your players getting slaughtered by your spawner block creations, your presence in Creative Mode, whilst they are battling in survival mode, will not contribute to their misery by spawning more monsters because of your presence. \nLight Sensitive \nIf this box is ticked, spawns are cancelled from this spawner if the light level is 8 or more. This ensures that some spawners will only operate at night. \nXP To Drop \nYou can assign an amount of xp orbs to drop when the block breaks after its last spawn. This is good for rewarding players after any difficult spawner groups you may have put together. Also useful for rewarding them when you’ve used Mobs whose creators have neglected to assign them any experience drops. \nBlock Hardness \nMakes the block harder to destroy, and can be made invulnerable. This is particularly useful if you want the players to see the spawner and challenge to destroy it before more mobs spawn – as in the traditional Minecraft vanilla fashion. \nTransparent \nThis tick box determines whether the spawner block will be “invisible” (it has no texture but can still be made out by faint black bounding lines, and it is still solid) to players. Good for concealing spawners to prevent players pick axing them before they can spawn anything. \n\nDetection Properties \nRequired Player Range \nRequired player range is the spawner blocks detection range in which the spawner looks for players, within the set number of blocks from the spawner. If a player is within its range it spawns mobs if it can. It will cancel spawning if there are no players are within this range, or if they leave its range. So, for example, if required player range is set to 7, it will only check for players in a 7 block area around the spawner. By using this range feature a structure builder can craft his monster spawns in successive encounters, rather than have everything spawn at once and rush the players. (Remember - as a guide - a vanilla minecraft spawner blocks Required Player Range is 16 blocks). \nMax Nearby Entities \nThis is the maximum number of living entities within the mobRange, (see above) over which the spawn is cancelled. This prevents too many mobs from being spawned in the given area. (Remember - as a guide - a vanilla minecraft spawner blocks maximum entities is 6). \nEntities Detect Range \nThis is the entity detection range, which only triggers on living entities. This is the range at which the spawner will check for the maximum number of mobs in play, before it spawns more. For example, if mob range is set to 12, it will only check for maximum mobs in a 12 block area around the spawner. \nSpawn Range \nThis is the area within which the spawner will try to spawn its mobs, centered around the spawner block. Setting it to 0 means the spawned mob will replace the spawner block in its position and the spawner will disappear – so it only really works for single mob spawns. (This is the standard setting for the Mob Placer Tool)So, for example, set to 6, the spawner could spawn mobs from 1 to 6 blocks away from the spawner block. (Remember - as a guide - a vanilla minecraft spawner blocks spawn range is 4 blocks). \n\nSpawning Properties \nNext Spawn Delay \n(number) -> if delay matters, the delay before next spawn attempt, picked at random between minDelay and maxDelay each time it runs out. This means that if you want another mob to spawn after the original one, how long the time will be in between spawns. So, for example, say you want a spawner block to spawn its contents instantly when a player comes within range, you would set minDelay to 0 and maxDelay and spawnDelay to 20. \nMin Spawn Delay \n(number) -> if delay matters, the min amount. This means the minimum amount of delay between a player activating the spawner, and when it first spawns it mob. (Remember - as a guide - a vanilla minecraft spawner blocks minimum spawn delay is 200) \nMax Spawn Delay \n(number) -> if delay matters, the max amount. This means the maximum amount of delay possible between a player activating the spawner, and when it first spawns it mob.(Remember - as a guide - a vanilla minecraft spawner blocks maximum spawn delay is 800) \n\nSpawn Groups \nThe AW mob spawners are capable of spawning different groups of mobs, and randomising, by a weight given to each group, which group it spawns. \nSpawn Groups (custom data) \n(custom data) -> the list of spawn groups, within which a group is picked according to its relative weight, if empty, spawner block will disappear inventory (custom data)-> the list of items to drop on block broken (not accessible) \nMin = minToSpawn -> the min number of entities to spawn per attempt \nMax = maxToSpawn -> the max number of entities to spawn per attempt remainingSpawnCount -> if positive, the total number of entities to spawn, after which this group will be removed from the list \nEach spawn attempt will make a number of entities spawn between 'minToSpawn' and 'maxToSpawn', one by one trying to spawn within 'spawnRange' blocks range, for a 'spawnRange'+5 number of tries each. Only when a spawn is successful will the 'remainingSpawnCount' be decreased (if it is positive, of course). \n\nSetting Up Spawners \nWith all of this information, we will now go over how to actually use it. At the bottom of the first GUI screen when clicking on the spawner is the entity spawn list. When placed in the manual way, there will be a default entry of a Pig mob. You can remove this by clicking the minus button. \nClick the 'Add Entry' button to bring up the selection GUI. Here you can select the entity you want, the Min, Max, and Total values. For example, setting the Min value to 2, the Max value to 4, and the Total value to 8 means that the spawner can spawn between 2 and 8 entities, but never more than 4. When it has spawned 8 entities, it will disappear. \nTo select the entity you want, click the 'Selected Entity' button, defaulted, again, to Pig. The GUI that opens will have every mob loaded in the game available to you. Clicking done will revert back to the previous GUI. You can add more entities to the list, from different mods, vanilla, and AW or divide them into groups. \nA group is just as it sounds, a group of mobs designed to spawn at the same time right next to one another. Simply click the 'Add Group' button to open a small extension that works exactly the same way as the Entity list described above. \nKeep in mind that when a spawner is set to use a modded mob, and that mod is not loaded, the spawner will load, but since the mob does not exist in game, the spawner will simply disappear when activated."
        },
		{
            "content_type": "heading",
            "text": "Building Tools and Blocks",
            "level": 1
        },
		{
            "content_type": "text",
            "text": "AW has a few building tools to assist in large scale construction. The AW team also recommends using MCEdit, WorldEdit, and Torojimas Build Helper. Any other building tools mod shouldn’t cause any issues in conjunction with AW. \nAlso adds a number of Aesthetic Blocks that can add some flavor to your builds"
        },
        {
            "content_type": "heading",
            "text": "Construction Tool",
            "level": 2
        },
        {
            "content_type": "item",
            "name": "ancientwarfarestructure:construction_tool"
        },
		{
            "content_type": "text",
            "text": "The Construction tool has four different modes: Solid_Fill, Box_Fill, Lake_Fill, and Layer_Fill. You can change modes by holding the wand in your hand and, by default, pressing the Z key. To see the mode, enter your inventory and hover over the wand to see what mode you are in. \nSolid Fill \nSolid Fill mode is very simple, allows you to set the wand to a block type, set a bounding box, and changing all blocks within the box to the set block type. To select the block type, hover the wands bounding box on the type of block you want, and hit, by default, the X key. Next, you can set the bounds by using, by default, the C key for one corner, and the V key for the other corner. Then, you simple right click, and all blocks within the bounds will be changed. You can use the B key to clear the bounds. \nBox Fill \nBox Fill follows the same exact method as Solid Fill, but instead only does the outer edge of the bounds with the selected box, leaving the inside hollow. \nLake_Fill \n Lake Fill is very useful to eliminate pools of water. Simply right click any top layer of water to replace all water blocks with the selected block. \nLayer_Fill \nLayer_Fill is useful to rapidly swap all blocks in a certain contiguous layer of blocks. Simply select the block type you want with the wands bound box and the X key, then right click on the layer to change all blocks in a large area to that block, in the same layer and type as the block that was right clicked on."
        },
        {
            "content_type": "heading",
            "text": "Lake Construction Tool",
            "level": 2
        },
        {
            "content_type": "item",
            "name": "ancientwarfarestructure:construction_tool_lakes"
        },
		{
            "content_type": "text",
            "text": "AW has a very nice Lake Creator wand that will fill an area by replacing all air blocks with water. But be warned – practise on a test world before using the lake gen wand – it’s very easy to make a mistake. (Which is where Torojima’s water deletion wand comes in handy). \nSimply right click with the lake gen wand on the top surface of the block above which you wish the water to replace all air blocks. It will fill ALL connected air blocks for a considerable distance, so ensure the area you want to fill is COMPLETELY enclosed."
        },
		{
            "content_type": "heading",
            "text": "Structure Scanning and Building Mechanics",
            "level": 1
        },
		{
            "content_type": "text",
            "text": "Now that you know how to use everything to make your builds as you want them, Ancient Warfare offers a way to scan your structures and include them in the World Generation or make it possible to have it be built by your NPCs in survival mode (see Drafting Bench section below). \nTo begin, we will go over how to use the Structure Scanner Item and the Structure Block. First, the Scanner can only scan in cubes and rectangular prisms, so pick out corners of structure, and ensure the outline of these corners include the whole structure. On one of these corners, build a 1x1 block pillar of any material up to the maximum height of the structure, again, ensuring that it includes all parts of the structure you want to include. AW automatically removes overhanging trees and other things that “float” above during World Gen. Remove the bottom portion of this pillar before you start scanning."
        },
		{
            "content_type": "image",
            "path": "/images/Scanning1.jpg",
            "width": 756,
            "height": 393
        },
		{
            "content_type": "image",
            "path": "/images/Scanning2.jpg",
            "width": 756,
            "height": 393
        },
		{
            "content_type": "text",
            "text": "Now, if you want to be able to update this structure and update the template, place the Structure Scanner Block on the side of the structure area, level with the “floor” level"
        },
		{
            "content_type": "image",
            "path": "/images/Scanning3.jpg",
            "width": 756,
            "height": 393
        },
		{
            "content_type": "text",
            "text": "Now, with the Structure Scanner Item in your hand, go to the opposite corner of your structure and go down to the lowest block to include all you want to. Hovering over this block, a white bounding box will appear around it, and you can press “Z” to start scanning. The bounding box will now stick there, and a message saying, “Set First Position (1/4)” will appear. Now fly up to the opposite corner and fly to where the pillar used to be, and hovering over the upper block, the bounding box will expand to the whole area. Now press “Z” again on this block, and a message will appear “Set Second Position (2/4)”. Now, you MUST destroy the blocks you used to for this upper pillar area, or they will be included in the structure, just floating there."
        },
		{
            "content_type": "image",
            "path": "/images/Scanning4.jpg",
            "width": 756,
            "height": 393
        },
		{
            "content_type": "image",
            "path": "/images/Scanning5.jpg",
            "width": 756,
            "height": 393
        },
		{
            "content_type": "text",
            "text": "Once you have added the second point, you may fly around and make use of the white bounding box to make sure everything you want included is included. A green bounding box will appear, and this shows “ground level” or what the structure will consider when spawning as ground. When you hover a block in this level, it will show a green bounding box around that block, and this is also the “offset” position. When you spawn a structure using the Structure Builder item or the Survival Structure builders, the structure will be created with this block being right in front of you. Once you are happy with your offset, press “Z”, and you will receive the message “Set Third Position (3/4)”."
        },
		{
            "content_type": "image",
            "path": "/images/Scanning6.jpg",
            "width": 756,
            "height": 393
        },
		{
            "content_type": "text",
            "text": "Now, you can right click with the Scanner Item anywhere in the air to open a GUI. You can also at this time, place the Scanner Item inside the Scanner Block, by opening it with right click. The GUIs for both are essentially the same, with the Scanner Block just serving a physical way in a Structure World to save the Scanner item, and enable quick updating of the structure template."
        },
		{
            "content_type": "image",
            "path": "/images/Scanning7.jpg",
            "width": 756,
            "height": 413
        },
		{
            "content_type": "text",
            "text": "Now, starting in this GUI, the first thing you must do is input a name, such as the example “RuinGenericSmall” in the above image. It could be useful to create a naming convention, since it is easier to find the structure later, and to organize them. \nNext, you can choose to check or not check the “Include in Game Immediately?” option, which determines whether or not the structure will be loaded up into your current game. If you leave it unchecked, the structure template will still be created, but it will not appear in your current session, instead being placed in the “export” folder in the “Structure” folder inside the AW config folder. \nNow will we look at the “Setup Validation” button, which will determine how structures spawn in, enabling world gen, enabling survival building, etc."
        },
		{
            "content_type": "image",
            "path": "/images/Scanning8.jpg",
            "width": 756,
            "height": 393
        },
		{
            "content_type": "text",
            "text": "Along the top of this GUI, you will see the various generation types, Ground, Underground, Sky, Water, Underwater, Island, and Harbor (Currently WIP and disabled). Ground is the most common, so it is alright to leave that there for most structures. \nNext, you can see the tick boxes, the first of which is Dynamic Block Reassignment, which will spawn blocks in your structures for the appropriate biome it spawns in, such as Oak Wood Logs being replaced with Birch Wood Logs in a Birch Forest. \nEnable World Gen will set the structure as being able to spawn during World Generation. \nChecking the Survival box will allow the structure to be used in the Drafting Bench and the Survival Structure Builders, see that section for more details. \nThe Border Size input bar controls the area around your scanned structure that will be cleared and levelled when it spawns. Border size will set an area between the edge of your structure and the world it is spawning in, to terraform and try and make the structure sit in the world properly. It will also clear it of trees and leaves and other objects.  A very big border makes it more difficult for the structure to choose a spawn site. No border at all may make a structure easier to blend into forests and woods, but it may then have some sharp edges at its base where it joins the ground imperfectly. \nNote: For the following options, it is important to understand that AW structure placement logic actually goes from the top of the world downwards, looking for the first solid ground block that can be built on. \nMax Fill will fill any air beneath where the structure spawns – so that structures do not appear hanging on hill sides etc. Max Fill works on the principle that it takes ground level at the spawn position of the structure + max fill as a base Y to count down from. So for example, setting this at “0” means that the structure will always try to spawn at sea level. \nMin Duplicate Distance controls sets the minimum distance away that the structure can spawn again. This is so you don’t get too many of the same thing next to each other. Note that the main structures config sets the overall ‘minDuplicateDistance’ so even if your individual template specifies a higher value, the overall value from the main config will still be used as a maximum. This does not apply to Unique Structures, for obvious reasons. \nMax Leveling determines how far down or up, any blocks at the bottom of the structure can be placed. It controls how much of the spawn site can be levelled to allow the structure to spawn. So, for example if this is set to 3 - if the placement logic hits anything at the bottom of the structure that’s more than 3 blocks higher or lower, then the block where the checking started the placement will fail, and the structure cannot spawn. Setting the value higher – say at 18 to 20 allows spawns on hilly terrain. \nUnique will only spawn this structure in ONCE per world. \nSelection Weight’s number is compared to all other structure weights that you might have set to spawn in the biomes the structure will spawn in. The higher the number, the more chance it might spawn. \nCluster Value controls the weight for possibly clustering with other structures that spawn around it. In game, when attempting to generate a new structure, AW adds up the values of structures already spawned in neighbouring chunks (radius configurable in world-gen config), and will not exceed the maximum total 'cluster' value specified in the config file. The default Cluster Value in the mod is 500. \nPreserve Blocks means that when your structure spawns the ground and foliage blocks of the world it spawns into are not removed and are left to mix with the blocks of your structure, wherever there is an “air” block in your structure. You can use this feature to create ruins with no ground attached to them, and scan and set a nominal ground height without any ground present in the model - this way the program buries them naturally into the ground at the nominal height you select as ground level, but does not delete or flatten underlying terrain, or remove trees and bushes, so the ruins look very natural. \nOnce you have this set to your liking, hit the “Done” button in the upper right hand corner, which will return you to the main GUI.  \nNext we will take a look at the Biome Selection GUI "
        },
		{
            "content_type": "image",
            "path": "/images/Scanning9.jpg",
            "width": 756,
            "height": 393
        },
		{
            "content_type": "text",
            "text": "You will notice a very long list as the main object in this GUI, and it contains every biome in your setup, including any modded biomes loaded in the game at that time. The checking the “Biome Whitelist” tickbox enables selecting individual biomes, by scrolling through the list, or search for it in the search bar above. Not checking the tickbox will cause this structure to spawn in EVERY possible biome. Once you have selected the biomes you like, click “Done” in the upper right hand corner, which will return to the main GUI. \nWe will now look at the Dimension Selection GUI."
        },
		{
            "content_type": "image",
            "path": "/images/Scanning10.jpg",
            "width": 756,
            "height": 393
        },
		{
            "content_type": "text",
            "text": "This GUI allows you to select dimensions that the structure should spawn in. If you want your structure to spawn in the Overworld only, simply ignore this section. Otherwise, simply enter the ID number of the dimension and click the “+” box – this will add it to the list below. Add as many as you wish and then hit “done”, which will return you to the Main GUI. Next, we’ll look at the Mod Selection GUI"
        },
		{
            "content_type": "image",
            "path": "/images/Scanning11.jpg",
            "width": 756,
            "height": 413
        },
		{
            "content_type": "text",
            "text": "This GUI allows you to specify which mods are necessary for this structure to work properly. Simply type in the name of the mod into the bar, and click the “+”, which will add it to the list below. Click the option to remove it. Add as many are needed, then hit “done”, which will return you to the Main GUI. \nNow that we’ve gone over every option, and you have them setup as you like, hit “Export” to finish the structure, and it should be in-game if you selected the “Include immediately” tick box. You can check your structure out using the Structure builder, check its section to learn more. If you’re using the Scanner Block, you can make changes to your structure, and then hit “Export” again to copy the changes over the template. If you made changes and want to revert the structure back to how it was in the template, hit “Restore”."
        },
        {
            "content_type": "heading",
            "text": "Structure Builder",
            "level": 2
        },
		{
            "content_type": "text",
            "text": "The Structure Builder item allows anyone in Creative mode to spawn in any structure in an instant. It works very simply, right click to open the GUI, select the Structure in the list you’d like, and then hit “Done” to close the GUI. You can use the search bar to find the structure in longer lists. Along the right side of the GUI, structures that are enabled for Survival building will display the required items."
        },
		{
            "content_type": "image",
            "path": "/images/Creative_Builder1.jpg",
            "width": 756,
            "height": 413
        },
		{
            "content_type": "text",
            "text": "With the Structure Builder in your hand, anytime you hover it over any block, it will begin to display a preview of the structure you selected. For larger structures this may cause lag as it does this; avoid having the Item in your hand while moving, if necessary. If you shift right-click while selecting a block with the Builder Item, that block will be selected as the spawn point, and the preview will be tied to this point. You may now fly around and observe the preview and how it will look when it is placed. You may hit the “Z” key to place the structure, and it will be spawned in immediately. There is NO way to reverse this, so it is recommended to make sure you have the spawn point in the correct place."
        },
        {
            "content_type": "heading",
            "text": "Drafting Bench and Survival Structure Builders",
            "level": 2
        },
		{
            "content_type": "text",
            "text": "The Drafting Bench is used to create Survival Structure Builders, which can be worked on by Craftsman NPCs to build the structure. Once you have made a Drafting Bench, you open it’s GUI by right clicking. You can pick the structure you want by hitting the “Select Structure”, which open a GUI that looks the same as the Structure Builder Item GUI, but the list only contains structures that have the “Survival” tag. Once you have the structure selected, a button “Start” will appear, and the required items will appear in a list in the lower right hand corner area. Press the “Start” button, and begin putting in the required items into the Input slots. They will begin to disappear, and when all the required items have been provided, a Survival Structure Builder will be outputted."
        },
		{
            "content_type": "image",
            "path": "/images/Survival_Builder1.jpg",
            "width": 756,
            "height": 413
        },
		{
            "content_type": "image",
            "path": "/images/Survival_Builder2.jpg",
            "width": 756,
            "height": 413
        },
		{
            "content_type": "text",
            "text": "Once you have the Survival Structure Builder block, simply take it to where you’d like the structure to be, place it, and have Craftsman NPCs work on it. The Player may also use a hammer to work on the Builder. The Builder will first clear out blocks obstructing its own placement, then begin construction. "
        },
        {
            "content_type": "heading",
            "text": "WorldGen Structure Builder and Instant Town Building Tool",
            "level": 2
        },
        {
            "content_type": "item",
            "name": "ancientwarfarestructure:structure_builder_world_gen"
        },
        {
            "content_type": "text",
            "text": "The WorldGen Structure Builder works very similarly to the Structure Builder, but does not display a preview, and will spawn its selected structure just as a the World Generation would do. That means if there is not enough room for the structure to spawn under World Generation rules, it would not spawn. \nThis tool is used to instantly spawn in Towns. You may pick what kind of town you’d like to spawn, and adjust its length and width, in units of blocks."
        }
    ]
}
