{
  "nan": "This description hasn't been created yet! Contact the author of the mod or whoever is responsible for implementing JED!",
  "minecraft:air": "This is air. Mostly N2 and O2. That's literally it, you probably shouldn't be here...",
  "minecraft:stone": "A basic building block found below the surface. To obtain it, you'll need to use the Silk Touch enchantment or to smelt Cobblestone in a Furnace.",
  "minecraft:granite": "A pink plutonic rock similar to stone. Can be polished or turned into stairs/walls. Found underground.",
  "minecraft:polished_granite": "A polished pink plutonic rock, used for building. Can be turned into stairs/walls.",
  "minecraft:diorite": "A white rock, often nicknamed \"bird poop\" by a handsome Swedish youtuber. Can be polished or turned into stairs/walls. Found underground.",
  "minecraft:polished_diorite": "Polished \"bird poop\". Can be used for building or making stairs/walls.",
  "minecraft:andesite": "A lighter grey rock similar to stone. Can be polished or turned into stairs/walls. Found underground.",
  "minecraft:polished_andesite": "A polished light grey rock. Used for building or making stairs/walls. ",
  "minecraft:deepslate": "A dark rock found in the depths of your minecraft world. Can only be obtained with the Silk Touch enchantment or by smelting it in a Furnace.",
  "minecraft:cobbled_deepslate": "I guess since there is cobblestone there is cobbled deepslate? But why is it not called Cobbleslate?",
  "minecraft:polished_deepslate": "Polished version of the dark rock. Can be used to make stairs/walls.",
  "minecraft:calcite": "A sedimentary rock, found underground. If you find this block while mining, you're in for a treat! (Not to be confused with diorite!)",
  "minecraft:tuff": "A rock found in blob-like formations underground. Pay attention, this block might hide some iron within!",
  "minecraft:dripstone_block": "A decorative block commonly found in the dripstone caves, under the surface of the world!",
  "minecraft:grass_block": "A natural common block on the world's surface, requires the Silk Touch enchantment to obtain. This will spread to nearby dirt.",
  "minecraft:dirt": "A dirty common block underneath the grass, on the world's surface.",
  "minecraft:coarse_dirt": "A dirty uncommon block, cannot sustain plants. Commonly found in savanna plateaus and badlands.",
  "minecraft:podzol": "A darker shade of grass that can be found in Taiga biomes or under large spruce trees. This will spread to nearby dirt.",
  "minecraft:rooted_dirt": "A decorative block found under azalea trees.",
  "minecraft:crimson_nylium": "A crimson, infested netherrack, found on the floor of Crimson Forests in the Nether.",
  "minecraft:warped_nylium": "A warped, infested netherrack, found on the floor of Warped Forests in the Nether.",
  "minecraft:cobblestone": "A block obtained from mining stone underground, without the Silk Touch enchantment. Used in building and many recipes.",
  "minecraft:oak_planks": "A crafting material and decorative block that can be crafted from oak logs.",
  "minecraft:spruce_planks": "A crafting material and decorative block that can be crafted from spruce logs.",
  "minecraft:birch_planks": "A crafting material and decorative block that can be crafted from birch logs.",
  "minecraft:jungle_planks": "A crafting material and decorative block that can be crafted from jungle logs.",
  "minecraft:acacia_planks": "A crafting material and decorative block that can be crafted from acacia logs.",
  "minecraft:dark_oak_planks": "A crafting material and decorative block that can be crafted from dark oak logs.",
  "minecraft:crimson_planks": "A crafting material and decorative block that can be crafted from crimson stems.",
  "minecraft:warped_planks": "A crafting material and decorative block that can be crafted from warped stems.",
  "minecraft:oak_sapling": "Place it and wait, it will grow into an oak tree. You can also right click it with some Bone Meal to speed up the progress!",
  "minecraft:spruce_sapling": "Place it and wait, it will grow into an spruce tree. You can also right click it with some Bone Meal to speed up the progress!",
  "minecraft:birch_sapling": "Place it and wait, it will grow into an birch tree. You can also right click it with some Bone Meal to speed up the progress!",
  "minecraft:jungle_sapling": "Place it and wait, it will grow into an jungle tree. You can also right click it with some Bone Meal to speed up the progress!",
  "minecraft:acacia_sapling": "Place it and wait, it will grow into an acacia tree. You can also right click it with some Bone Meal to speed up the progress!",
  "minecraft:dark_oak_sapling": "Place 4 of these in a square and wait, it will grow into an dark oak tree. You can also right click it with some Bone Meal to speed up the progress!",
  "minecraft:bedrock": "A block found at the very bottom of your world, cannot be mined.",
  "minecraft:sand": "A common obtainable block mainly used for decoration and farms, can be obtained in on beaches or in desert biomes. Sugarcane grows faster on this block (it doesn't!), which can also be smelted to make glass!",
  "minecraft:red_sand": "A common obtainable block mainly used for decoration and farms, can be only be obtained in the badlands.",
  "minecraft:gravel": "A common obtainable block mainly used for decoration and crafting. It can be found underground, on the floor of oceans, near rivers or lakes, or in some mountains. Can sometimes drop flint (10% chance) when mined.",
  "minecraft:coal_ore": "This ore drops coal when mined. Can be found high up in mountains or underground. Using the Fortune enchantment will yield more coal, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:deepslate_coal_ore": "This ore drops coal when mined. Can be found deep underground, near other deepslate. Using the Fortune enchantment will yield more coal, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:iron_ore": "This ore drops raw iron when mined. Can be found underground. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:deepslate_iron_ore": "This ore drops raw iron when mined. Can be found deep underground, near other deepslate. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:copper_ore": "This ore drops raw copper when mined. Can be found underground. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:deepslate_copper_ore": "This ore drops raw copper when mined. Can be found deep underground, near other deepslate. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:gold_ore": "This ore drops raw gold when mined. Can be found underground. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:deepslate_gold_ore": "This ore drops raw gold when mined. Can be found deep underground, near other deepslate. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:redstone_ore": "This ore drops redstone when mined. Can be found underground. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:deepslate_redstone_ore": "This ore drops redstone when mined. Can be found deep underground, near other deepslate. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:emerald_ore": "This ore drops emeralds when mined. Can be found high up in mountains or underground. Using the Fortune enchantment will yield more coal, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:deepslate_emerald_ore": "This ore drops emeralds when mined. Can be found deep underground, near other deepslate. Using the Fortune enchantment will yield more emerald, while using the Silk Touch enchantment will drop the ore block. Rarest block to obtain.",
  "minecraft:lapis_ore": "This ore drops lapis lazuli when mined. Can be found underground. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:deepslate_lapis_ore": "This ore drops lapis lazuli when mined. Can be found deep underground, near other deepslate. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:diamond_ore": "This ore drops diamonds when mined. Can be found underground. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:deepslate_diamond_ore": "This ore drops diamonds when mined. Can be found deep underground, near other deepslate. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:nether_gold_ore": "This ore drops gold nuggets when mined. Can be found in the nether. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:nether_quartz_ore": "This ore drops quartz when mined. Can be found in the nether. Using the Fortune enchantment will yield more ore, while using the Silk Touch enchantment will drop the ore block.",
  "minecraft:ancient_debris": "This rare resource yields ancient debris. Can be found in the nether, at extremely high or low heights. Ancient debris is involved in the production of netherite.",
  "minecraft:coal_block": "A combination of 9 coal that can be used as a fuel. Also a decorative block.",
  "minecraft:raw_iron_block": "A decorative block crafted from 9 pieces of raw iron.",
  "minecraft:raw_copper_block": "A decorative block crafted from 9 pieces of raw copper.",
  "minecraft:raw_gold_block": "A decorative block crafted from 9 pieces of raw gold.",
  "minecraft:amethyst_block": "A beautiful block made of sparkly amethyst. Try walking on it for some stunning sounds!",
  "minecraft:budding_amethyst": "A budding amethyst block produces amethysts over long periods of time. But it can't be obtained in survival, so you probably shouldn't be reading this lol.",
  "minecraft:iron_block": "A block made with 9 iron ingots. It can be used as a beacon base, or to craft an anvil. Some say it can be even used to create a golem of sorts..",
  "minecraft:copper_block": "A shiny orange block, made from 4 copper ingots. Mostly decoratives.",
  "minecraft:gold_block": "So shiny.... but piglins love it too. Make sure to keep it out of their sight.",
  "minecraft:diamond_block": "A block made entirely of shiny diamonds! Please do not build a house out of this.",
  "minecraft:netherite_block": "A block made of the rarest resource in the game, don't dedicate yourself to making a beacon with this. It takes too long. Way. Too. Long.",
  "minecraft:exposed_copper": "A copper block, but it's slightly oxidized and looks greenish.",
  "minecraft:weathered_copper": "A copper block, but it's pretty oxidized and looks very greenish.",
  "minecraft:oxidized_copper": "A copper block, but it's completely oxidized and looks green.",
  "minecraft:cut_copper": "A fancy copper block.",
  "minecraft:exposed_cut_copper": "A fancy copper block, but it's slightly oxidized and looks greenish.",
  "minecraft:weathered_cut_copper": "A fancy copper block, but it's pretty oxidized and looks very greenish.",
  "minecraft:oxidized_cut_copper": "A fancy copper block, but it's completely oxidized and looks green.",
  "minecraft:cut_copper_stairs": "Fancy copper stairs.",
  "minecraft:exposed_cut_copper_stairs": "Fancy copper stairs, but it's slightly oxidized and looks greenish.",
  "minecraft:weathered_cut_copper_stairs": "Fancy copper stairs, but it's pretty oxidized and looks very greenish.",
  "minecraft:oxidized_cut_copper_stairs": "Fancy copper stairs, but it's completely oxidized and looks green.",
  "minecraft:cut_copper_slab": "Half a copper block.",
  "minecraft:exposed_cut_copper_slab": "Fancy copper slab, but it's slightly oxidized and looks greenish.",
  "minecraft:weathered_cut_copper_slab": "Fancy copper slab, but it's pretty oxidized and looks very greenish.",
  "minecraft:oxidized_cut_copper_slab": "Fancy copper slab, but it's completely oxidized and looks green.",
  "minecraft:waxed_copper_block": "A copper block, but waxed so it stays shiny.",
  "minecraft:waxed_exposed_copper": "A copper block, but it's slightly oxidized and looks greenish, and waxed so it doesn't get any greener.",
  "minecraft:waxed_weathered_copper": "A copper block, but it's pretty oxidized and looks very greenish, and waxed so it doesn't get any greener.",
  "minecraft:waxed_oxidized_copper": "A copper block, but it's completely oxidized and looks green, and someone wasted a honeycomb on it for some reason.",
  "minecraft:waxed_cut_copper": "A fancy copper block, but waxed so it stays shiny.",
  "minecraft:waxed_exposed_cut_copper": "A fancy copper block, but it's slightly oxidized and looks greenish, and waxed so it doesn't get any greener.",
  "minecraft:waxed_weathered_cut_copper": "A fancy copper block, but it's pretty oxidized and looks very greenish, and waxed so it doesn't get any greener.",
  "minecraft:waxed_oxidized_cut_copper": "A fancy copper block, but it's completely oxidized and looks green, and someone wasted a honeycomb on it for some reason.",
  "minecraft:waxed_cut_copper_stairs": "Fancy copper stairs, but waxed so it stays shiny.",
  "minecraft:waxed_exposed_cut_copper_stairs": "Fancy copper stairs, but it's slightly oxidized and looks greenish, and waxed so it doesn't get any greener.",
  "minecraft:waxed_weathered_cut_copper_stairs": "Wow that's a mouthful. Fancy copper stairs, but it's pretty oxidized and looks very greenish, and waxed so it doesn't get any greener. This is really specific you know. Someone aged this copper exactly two stages, and no more, then cut it into stairs, then slapped a honeycomb on top. That's probably why the name is so long.",
  "minecraft:waxed_oxidized_cut_copper_stairs": "Fancy copper stairs, but it's completely oxidized and looks green, and someone wasted a honeycomb on it for some reason.",
  "minecraft:waxed_cut_copper_slab": "Half a copper block, but waxed so it stays shiny.",
  "minecraft:waxed_exposed_cut_copper_slab": "Fancy copper slab, but it's slightly oxidized and looks greenish, and waxed so it doesn't get any greener.",
  "minecraft:waxed_weathered_cut_copper_slab": "Fancy copper slab, but it's pretty oxidized and looks very greenish, and waxed so it doesn't get any greener.",
  "minecraft:waxed_oxidized_cut_copper_slab": "Fancy copper slab, but it's completely oxidized and looks green, and someone wasted a honeycomb on it for some reason.",
  "minecraft:oak_log": "A log found in oak or azalea trees, in plains and forest biomes.",
  "minecraft:spruce_log": "A log found in spruce trees, in taiga biomes.",
  "minecraft:birch_log": "A log found in birch trees, in birch forest, forest or plains biomes.",
  "minecraft:jungle_log": "A log found in jungle trees, in jungle biomes.",
  "minecraft:acacia_log": "A log found in acacia trees, in savanna biomes or badlands plateaus.",
  "minecraft:dark_oak_log": "A log found in dark oak trees in dark oak forest biomes.",
  "minecraft:crimson_stem": "A log found in crimson trees in the crimson biome, in the Nether.",
  "minecraft:warped_stem": "A log found in warped trees in the warped biome, in the Nether.",
  "minecraft:stripped_oak_log": "A naked version of the oak log, made by right clicking an oak log with an axe.",
  "minecraft:stripped_spruce_log": "A naked version of the spruce log, made by right clicking a spruce log with an axe.",
  "minecraft:stripped_birch_log": "A naked version of the birch log, made by right clicking a spruce log with an axe.",
  "minecraft:stripped_jungle_log": "A naked version of the jungle log, made by right clicking a jungle log with an axe.",
  "minecraft:stripped_acacia_log": "A naked version of the acacia log, made by right clicking an acacia log with an axe.",
  "minecraft:stripped_dark_oak_log": "A naked version of the dark oak log, made by right clicking a dark oak log with an axe.",
  "minecraft:stripped_crimson_stem": "A naked version of the crimson stem, made by right clicking a crimson stem with an axe.",
  "minecraft:stripped_warped_stem": "A naked version of the warped stem, made by right clicking a warped stem with an axe.",
  "minecraft:stripped_oak_wood": "A naked version of the oak wood, made by right clicking oak wood with an axe.",
  "minecraft:stripped_spruce_wood": "A naked version of the spruce wood, made by right clicking spruce wood with an axe.",
  "minecraft:stripped_birch_wood": "A naked version of the birch wood, made by right clicking spruce wood with an axe.",
  "minecraft:stripped_jungle_wood": "A naked version of the jungle wood, made by right clicking jungle wood with an axe.",
  "minecraft:stripped_acacia_wood": "A naked version of the acacia wood, made by right clicking acacia wood with an axe.",
  "minecraft:stripped_dark_oak_wood": "A naked version of the dark oak wood, made by right clicking dark oak wood with an axe.",
  "minecraft:stripped_crimson_hyphae": "A naked version of the crimson hyphae, made by right clicking crimson hyphae with an axe.",
  "minecraft:stripped_warped_hyphae": "A naked version of the warped hyphae, made by right clicking warped hyphae with an axe.",
  "minecraft:oak_wood": "Oak wood with bark on all 6 sides, made by crafting four logs together. Used for decoration.",
  "minecraft:spruce_wood": "Spruce wood with bark on all 6 sides, made by crafting four logs together. Used for decoration.",
  "minecraft:birch_wood": "Birch wood with bark on all 6 sides, made by crafting four logs together. Used for decoration.",
  "minecraft:jungle_wood": "Jungle wood with bark on all 6 sides, made by crafting four logs together. Used for decoration.",
  "minecraft:acacia_wood": "Acacia wood with bark on all 6 sides, made by crafting four logs together. Used for decoration.",
  "minecraft:dark_oak_wood": "Dark oak wood with bark on all 6 sides, made by crafting four logs together. Used for decoration.",
  "minecraft:crimson_hyphae": "Crimson hyphae with stems on all 6 sides, made by crafting four stems together. Used for decoration.",
  "minecraft:warped_hyphae": "Warped hyphae with stems on all 6 sides, made by crafting four stems together. Used for decoration.",
  "minecraft:oak_leaves": "Leaves found on oak trees.",
  "minecraft:spruce_leaves": "Leaves found on spruce trees.",
  "minecraft:birch_leaves": "Leaves found on birch trees.",
  "minecraft:jungle_leaves": "Leaves found on jungle trees.",
  "minecraft:acacia_leaves": "Leaves found on acacia trees.",
  "minecraft:dark_oak_leaves": "Leaves found on dark oak trees.",
  "minecraft:azalea_leaves": "Leaves found on azalea trees.",
  "minecraft:flowering_azalea_leaves": "A prettier version of leaves found on azalea trees.",
  "minecraft:sponge": "Found in an ocean monument, these can be used to drain water in an area, simply by placing them down! Can be mined with a hoe.",
  "minecraft:wet_sponge": "A sponge filled with water. Dry by smelting in a furnace or by placing in the nether. Can be mined faster with a hoe.",
  "minecraft:glass": "A transparent block made by smelting sand. Can be dyed, tinted or made into panes.",
  "minecraft:tinted_glass": "A transparent block that doesn't let any light through. It doesn't get funkier than this.",
  "minecraft:lapis_block": "A decorative block crafted from 9 pieces of lapis. It can be crafted back.",
  "minecraft:sandstone": "A decorative block crafted from 4 sand.",
  "minecraft:chiseled_sandstone": "A fancier version of sandstone created in a stonecutter. Used for decoration.",
  "minecraft:cut_sandstone": "A more regular version of sandstone created in a stonecutter. Used for decoration.",
  "minecraft:cobweb": "A very sticky block that is found in structures like mineshafts, only obtainable via Silk Touch or shears. Good to slow down enemies in farms or to annoy your friends.",
  "minecraft:grass": "Grass, but not the grass block. Yes, they are different, deal with it. Can drop seeds when broken without the Silk Touch enchantment.",
  "minecraft:fern": "A small that can be obtained with the use of the Silk Touch enchantment, purely decorative.",
  "minecraft:azalea": "A super pretty little bonsai tree that can be found in lush caves, or when using a bone meal on a moss block. Also fits in a plant pot for extra cute points!",
  "minecraft:flowering_azalea": "A super pretty little bonsai tree with flowers that can be found in lush caves, or when using a bone meal on a moss block. Also fits in a plant pot for extra cute points!",
  "minecraft:dead_bush": "Found in hot biomes, this usually drops sticks unless broken with the Silk Touch enchantment. Can be placed in a plant pot!",
  "minecraft:seagrass": "Grass found on the bottom of lakes and oceans. Can be harvested with Silk Touch or shears and fed to turtles.",
  "minecraft:sea_pickle": "Having absolutely no relation to Rick, this object can be found in hot sea biomes and gives off a small amount of light. It can be used for its interesting hitbox or for lime dye.",
  "minecraft:white_wool": "White wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:orange_wool": "Orange wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:magenta_wool": "Magenta wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:light_blue_wool": "Light Blue wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:yellow_wool": "Yellow wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:lime_wool": "Lime wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:pink_wool": "White wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:gray_wool": "Gray wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:light_gray_wool": "Light gray wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:cyan_wool": "Cyan wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:purple_wool": "Purple wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:blue_wool": "Blue wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:brown_wool": "Brown wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:green_wool": "Green wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:red_wool": "Red wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:black_wool": "Black wool, can be obtained by shearing sheep, or by dyeing other colours of wool. Used for decoration and carpets.",
  "minecraft:dandelion": "A small yellow flower, great for decoration! Can be placed in a plant pot, or made into dye! Great for stew.",
  "minecraft:poppy": "A red medium size flower, great for bees. Can be placed in a plant pot, or made into dye! Great for stew.",
  "minecraft:blue_orchid": "A cool looking blue flower. Can be placed in a plant pot, or made into dye!",
  "minecraft:allium": "A tall magenta flower. Can be placed in a plant pot, or made into dye!",
  "minecraft:azure_bluet": "Short white flower, really nice to look at. Can be placed in a plant pot, or made into dye!",
  "minecraft:red_tulip": "Tall red flower, it smells really good too! Can be placed in a plant pot, or made into dye! Terrible for stew.",
  "minecraft:orange_tulip": "A tall orange flower. Can be placed in a plant pot, or made into dye! Terrible for stew.",
  "minecraft:white_tulip": "Tall white flower, looks good in a pot. Can be placed in a plant pot, or made into dye! Terrible for stew.",
  "minecraft:pink_tulip": "A tall pink flower. Can be placed in a plant pot, or made into dye! Terrible for stew.",
  "minecraft:oxeye_daisy": "Medium size white and yellow flower, nice to look at. Can be placed in a plant pot, or made into dye!",
  "minecraft:cornflower": "Medium size blue flower, does not make corn. Can be placed in a plant pot, or made into dye!",
  "minecraft:lily_of_the_valley": "A white flower that looks quite sad.Can be placed in a plant pot, or made into dye!",
  "minecraft:wither_rose": "A rose with the energy of a wither inside of it, better be careful while treading around it, it can sting quite a bit. Made when the wither kills any mob.",
  "minecraft:spore_blossom": "A huge flower found naturally in the lush caves. Gives off loads of green particles! Can be harvested with the Silk Touch enchantment.",
  "minecraft:brown_mushroom": "Good for making stew, or to put in a pot.",
  "minecraft:red_mushroom": "Good for making stew, or to put in a pot.",
  "minecraft:crimson_fungus": "A crimson red mushroom, quite similar to red mushrooms, but not as good for stew.",
  "minecraft:warped_fungus": "A warped mushroom, not good for stew.",
  "minecraft:crimson_roots": "A medium size crimson bush, not dangerous but it does make good decoration with coral.",
  "minecraft:warped_roots": "A medium size warped bush looking thing.",
  "minecraft:nether_sprouts": "Small warped grass.",
  "minecraft:weeping_vines": "Crimson vines, can be climbed and hang from the ceiling.",
  "minecraft:twisting_vines": "Large warped vines that twist up from the ground, can be used to climb.",
  "minecraft:sugar_cane": "Large canes used for making sugar and paper. Can be placed next to water on top of sand and grass. Grows faster on sand.",
  "minecraft:kelp": "Kelp can grow underwater in oceans. It can be smelted into dried kelp, or make flowing water into source blocks.",
  "minecraft:moss_carpet": "A carpet of moss.",
  "minecraft:moss_block": "A large block of moss. Objectively the best block in the game, in the opinion of the creator of this mod.",
  "minecraft:hanging_roots": "Roots usually found under rooted dirt, in lush caves. A decorative block.",
  "minecraft:big_dripleaf": "A large leaf that can be stood on, but will fall down after a short while.",
  "minecraft:small_dripleaf": "A small leaf that can not be stood on.",
  "minecraft:bamboo": "Bamboo, found in the jungle, can be grown to be used as fuel in a furnace. However, when in a stack of 12, its value increases dramatically.",
  "minecraft:oak_slab": "A slab of oak planks. A decorational block.",
  "minecraft:spruce_slab": "A slab of spruce planks. A decorational block.",
  "minecraft:birch_slab": "A slab of birch planks. A decorational block.",
  "minecraft:jungle_slab": "A slab of jungle planks. A decorational block.",
  "minecraft:acacia_slab": "A slab of acacia planks. A decorational block.",
  "minecraft:dark_oak_slab": "A slab of dark oak planks. A decorational block.",
  "minecraft:crimson_slab": "A slab of crimson planks. A decorational block.",
  "minecraft:warped_slab": "A slab of warped planks. A decorational block.",
  "minecraft:stone_slab": "A slab of stone. A decorational block.",
  "minecraft:smooth_stone_slab": "A slab of smooth stone. A decorational block.",
  "minecraft:sandstone_slab": "A slab of sandstone. A decorational block.",
  "minecraft:cut_sandstone_slab": "A slab of cut sandstone. A decorational block.",
  "minecraft:petrified_oak_slab": "A slab of oak planks that doesn't burn and needs to be mined with a pickaxe. Yep, they still exist in minecraft!",
  "minecraft:cobblestone_slab": "A slab of cobblestone. A decorational block.",
  "minecraft:brick_slab": "A slab of brick. A decorational block.",
  "minecraft:stone_brick_slab": "A slab of stone brick. A decorational block.",
  "minecraft:nether_brick_slab": "A slab of nether brick. A decorational block.",
  "minecraft:quartz_slab": "A slab of quartz. A decorational block.",
  "minecraft:red_sandstone_slab": "A slab of red sandstone. A decorational block.",
  "minecraft:cut_red_sandstone_slab": "A slab of cut red sandstone. A decorational block.",
  "minecraft:purpur_slab": "A slab of purpur. A decorational block.",
  "minecraft:prismarine_slab": "A slab of prismarine. A decorational block.",
  "minecraft:prismarine_brick_slab": "A slab of prismarine brick. A decorational block.",
  "minecraft:dark_prismarine_slab": "A slab of dark prismarine. A decorational block.",
  "minecraft:smooth_quartz": "A slab of quartz thats smooth. A decorational block.",
  "minecraft:smooth_red_sandstone": "A slab of smooth red sandstone. A decorational block.",
  "minecraft:smooth_sandstone": "A smooth sandstone slab.",
  "minecraft:smooth_stone": "Stone that has been cooked and became smooth. A decorative block crafted in a furnace.",
  "minecraft:bricks": "A block of bricks, crafted from 4... bricks.",
  "minecraft:bookshelf": "A decorative block that can also be used to upgrade your Enchanting Table. Can be crafted with books and planks, but can also be obtained by trading with librarians!",
  "minecraft:mossy_cobblestone": "Cobblestone, but mossy green!",
  "minecraft:obsidian": "Very hard block, only obtainable when mined with a diamond pickaxe, or by pouring water into lava. Used for creating a nether portals.",
  "minecraft:torch": "A light source created from a stick and coal or charcoal.",
  "minecraft:end_rod": "A decorative, modern looking block, created from blaze rods and popped chorus fruit.",
  "minecraft:chorus_plant": "A part of the chorus trees found in the end.",
  "minecraft:chorus_flower": "Place on end stone to grow more chorus fruit!",
  "minecraft:purpur_block": "A purple block of purpur found in the end cities. Purely decorational.",
  "minecraft:purpur_pillar": "A pillar made of purpur. A decorational block.",
  "minecraft:purpur_stairs": "Stairs made from purpur. A decorational block.",
  "minecraft:spawner": "This block will spawn mobs when placed.",
  "minecraft:oak_stairs": "Stairs made of oak planks. A decorational block.",
  "minecraft:chest": "A container which can hold 27 stacks of items, which can be doubled up when placed next to another chest. Super useful!",
  "minecraft:crafting_table": "A table with a 3x3 crafting grid, used for most of the crafting recipes in minecraft.",
  "minecraft:farmland": "Fertile dirt perfect for growing crops. Can be made by using a hoe on some dirt or grass.",
  "minecraft:furnace": "Will cook or smelt items when placed and given fuel. To use, simply place it down and right click on it.",
  "minecraft:ladder": "A block that can be used to climb a wall. Simply place the ladders and walk into them.",
  "minecraft:cobblestone_stairs": "Stairs made of cobblestone. A decorational block.",
  "minecraft:snow": "A layer of snow. Obtainable through Silk Touch enchantment or crafting.",
  "minecraft:ice": "A block of frozen water. Will melt near a light source, and generates in cold biomes. Packed ice can be used to prevent melting, crafted from 9 ice,",
  "minecraft:snow_block": "A block of snow. Break with a shovel to get 4 snowballs, or with the Silk Touch enchantment to get the snow block.",
  "minecraft:cactus": "A block that will grow taller when placed on sand. Breaks if there is a block adjacent to it. It can destroy any item.",
  "minecraft:clay": "A clay block, used to make terracotta, or to be smelted into bricks!",
  "minecraft:jukebox": "A block used to play sound tracks off of vinyl discs. You can also vibe with the parrots.",
  "minecraft:oak_fence": "A fence made of oak planks. A decorational block.",
  "minecraft:spruce_fence": "A fence made of spruce planks. A decorational block.",
  "minecraft:birch_fence": "A fence made of birch planks. A decorational block.",
  "minecraft:jungle_fence": "A fence made of jungle planks. A decorational block.",
  "minecraft:acacia_fence": "A fence made of acacia planks. A decorational block.",
  "minecraft:dark_oak_fence": "A fence made of dark oak planks. A decorational block.",
  "minecraft:crimson_fence": "A fence made from crimson planks. A decorational block. Cannot burn from fire.",
  "minecraft:warped_fence": "A warped fence made from warped planks. A decorational block. Cannot burn from fire.",
  "minecraft:pumpkin": "Use shears to carve it and get 1 seeds and a carved pumpkin, or just craft it to get 4.",
  "minecraft:carved_pumpkin": "A pumpkin that has been carved, can be used to make iron golems.",
  "minecraft:jack_o_lantern": "A carved pumpkin that is lit up. Can not be used to make iron golems.",
  "minecraft:netherrack": "A red stone that is found everywhere in the nether. It's quick to mine, so be careful of durability!",
  "minecraft:soul_sand": "A sand that slows you down when walking on it, found in the nether. Causes a vertical flow of water when under a source block, and can spawn the wither. Use the Soul Speed enchantment to travel very quickly on this block.",
  "minecraft:soul_soil": "A soil found in the nether. Use the Soul Speed enchantment to travel very quickly on this block.",
  "minecraft:basalt": "A block commonly found in the nether. Can also be made by combining water, lava and packed ice.",
  "minecraft:polished_basalt": "A polished, more fancy version of basalt. Made in a stonecutter.",
  "minecraft:smooth_basalt": "Smooth basalt can be found rarely underground. If you've found some, there's gonna be something shiny nearby!",
  "minecraft:soul_torch": "Just like a torch, except its blue for some reason. Purely a decorational block.",
  "minecraft:glowstone": "A light source found in the nether! Can also be made from glowstone dust!",
  "minecraft:infested_stone": "Ouch careful! This block spawns a silverfish when mined!",
  "minecraft:infested_cobblestone": "Ouch careful! This block spawns a silverfish when mined!",
  "minecraft:infested_stone_bricks": "Ouch careful! This block spawns a silverfish when mined!",
  "minecraft:infested_mossy_stone_bricks": "Ouch careful! This block spawns a silverfish when mined!",
  "minecraft:infested_cracked_stone_bricks": "Ouch careful! This block spawns a silverfish when mined!",
  "minecraft:infested_chiseled_stone_bricks": "Ouch careful! This block spawns a silverfish when mined!",
  "minecraft:infested_deepslate": "Ouch careful! This block spawns a silverfish when mined!",
  "minecraft:stone_bricks": "Bricks made from stone. Purely a decorational block.",
  "minecraft:mossy_stone_bricks": "Mossy bricks made from stone. Purely a decorational block.",
  "minecraft:cracked_stone_bricks": "Stone bricks that have cracked. Purely a decorational block.",
  "minecraft:chiseled_stone_bricks": "Stone bricks that have been chiseled. Purely a decorational block.",
  "minecraft:deepslate_bricks": "Bricks made from deepslate. Purely a decorational block.",
  "minecraft:cracked_deepslate_bricks": "Cracked bricks made from deepslate. Purely a decorational block.",
  "minecraft:deepslate_tiles": "Tiles made from deepslate. Purely a decorational block.",
  "minecraft:cracked_deepslate_tiles": "Tiles made from deepslate that have cracked. Purely a decorational block.",
  "minecraft:chiseled_deepslate": "Deepslate that has been chiseled. Purely a decorational block.",
  "minecraft:brown_mushroom_block": "A block of brown mushroom. Break with shears to get brown mushrooms. Purely a decorational block.",
  "minecraft:red_mushroom_block": "A block of red mushroom. Break with shears to get red mushrooms. Purely a decorational block.",
  "minecraft:mushroom_stem": "A block of mushroom stem. Purely a decorational block.",
  "minecraft:iron_bars": "A decorational block made from iron. Can also be used to accelerate a zombie's conversion of a villager to a zombie villager.",
  "minecraft:chain": "A very handy decoration to make your hanging builds better. Looks great with lanterns!",
  "minecraft:glass_pane": "A thinner version of glass, can be made with 6 normal glass. It's also notoriously hard to place!",
  "minecraft:melon": "A handy food source in the jungle that restores 1 hunger bar! Everybody loves it.",
  "minecraft:vine": "A endlessly growing vine, commonly found in jungles, that is good for climbing on trees. Can be harvested with shears.",
  "minecraft:glow_lichen": "A decorative block, commonly found in caves, that emits light and adds a little texture to blocks. Can be harvested with shears.",
  "minecraft:brick_stairs": "Stairs made from bricks! A decorational block.",
  "minecraft:stone_brick_stairs": "Stairs made from stone bricks! A decorational block!",
  "minecraft:mycelium": "Infested, fungal wet grass. Can be found in mushroom fields. Will spread to nearby dirt.",
  "minecraft:lily_pad": "A lily pad is commonly found in swamp, and is often used for parkour! Hit it with a boat and it will break. Purely decorational!",
  "minecraft:nether_bricks": "A decorational block found in the nether fortress and made from nether brick ingots.",
  "minecraft:cracked_nether_bricks": "Cracked version of nether bricks. A decorational block!",
  "minecraft:chiseled_nether_bricks": "Chiseled version of nether bricks. A decorational block!",
  "minecraft:nether_brick_fence": "A fence made from nether bricks. A decorational block!",
  "minecraft:nether_brick_stairs": "Stairs made from nether bricks. A decorational block!",
  "minecraft:enchanting_table": "A mythic structure harnessing the power of love and friendship, ugh, diamonds and obsidian to enchant your tools and equipment. Can be upgraded by placing bookshelves around it",
  "minecraft:end_portal_frame": "An unbreakable block found in the Stronghold. Light all of them up with Eyes of Ender to activate the End Portal",
  "minecraft:end_stone": "Not cheese. But it is the block the entire End dimension is made of .",
  "minecraft:end_stone_bricks": "The brick version of ends stone, found in end cities, but otherwise purely decorational.",
  "minecraft:dragon_egg": "A useless block that is only used for decoration and can only be obtained by killing the ender dragon. Makes a great lamp.",
  "minecraft:sandstone_stairs": "Stairs made from sandstone. Purely decorational!",
  "minecraft:ender_chest": "It's like a second inventory and specific to you. No matter where you access an enderchest, it's always gonna have your items. Beware: Mining without Silk Touch might cause pain, despair and the need to go to the nether.",
  "minecraft:emerald_block": "Voted Villager's Favorite Block in the official minecraft villager block awards. Crafted from 9 emeralds.",
  "minecraft:spruce_stairs": "Stairs made from spruce planks. A decorational block!",
  "minecraft:birch_stairs": "Stairs made from birch planks. A decorational block!",
  "minecraft:jungle_stairs": "Stairs made from jungle planks. A decorational block!",
  "minecraft:crimson_stairs": "Stairs made from crimson planks. A decorational block!",
  "minecraft:warped_stairs": "Stairs made from warped planks. A decorational block!",
  "minecraft:command_block": "Are you hacking? Probably.",
  "minecraft:beacon": "A powerful block that gives you powerful effects at the cost of a Nether Star. Can get additional effects by building a pyramid underneath it using mineral blocks. Right click and insert ingot to activate.",
  "minecraft:cobblestone_wall": "A wall made from cobblestone! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:mossy_cobblestone_wall": "A wall made from mossy cobblestone! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:brick_wall": "A wall made from bricks! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:prismarine_wall": "A wall made from prismarine! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:red_sandstone_wall": "A wall made from red sandstone! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:mossy_stone_brick_wall": "A wall made from mossy stone bricks! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:granite_wall": "A wall made from granite! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:stone_brick_wall": "A wall made from stone bricks! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:nether_brick_wall": "A wall made from nether bricks! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:andesite_wall": "A wall made from andesite! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:red_nether_brick_wall": "A wall made from red nether bricks! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:sandstone_wall": "A wall made from sandstone! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:end_stone_brick_wall": "A wall made from end stone bricks! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:diorite_wall": "A wall made from diorite! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:blackstone_wall": "A wall made from blackstone! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:polished_blackstone_wall": "A wall made from polished blackstone! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:polished_blackstone_brick_wall": "A wall made from polished blackstone bricks! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:cobbled_deepslate_wall": "A wall made from cobbled deepslate! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:polished_deepslate_wall": "A wall made from polished deepslate! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:deepslate_brick_wall": "A wall made from deepslate bricks! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:deepslate_tile_wall": "A wall made from deeplsate tiles! Can be crafted with 6 blocks, or in a stonecutter. Acts similarly to a fence.",
  "minecraft:anvil": "A useful block for combining/adding enchants and for repairing tools. Also great for smashing people. Right click to use.",
  "minecraft:chipped_anvil": "My anvil its broken!",
  "minecraft:damaged_anvil": "My anvil its even more broken!",
  "minecraft:chiseled_quartz_block": "A fancier quartz block with an engraving. Purely decorational!",
  "minecraft:quartz_block": "A block made from 4 quartz, that can't be crafted back. Purely decorational!",
  "minecraft:quartz_bricks": "Bricks made from quartz. Purely decorational!",
  "minecraft:quartz_pillar": "A pillar made from quartz. Purely decorational!",
  "minecraft:quartz_stairs": "Stairs made from quartz. Purely decorational!",
  "minecraft:white_terracotta": "White coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:orange_terracotta": "Orange coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:magenta_terracotta": "Magenta coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:light_blue_terracotta": "Light blue coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:yellow_terracotta": "Yellow coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:lime_terracotta": "Lime coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:pink_terracotta": "Pink coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:gray_terracotta": "Gray coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:light_gray_terracotta": "Light gray coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:cyan_terracotta": "Cyan coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:purple_terracotta": "Purple coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:blue_terracotta": "Blue coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:brown_terracotta": "Brown coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:green_terracotta": "Green coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:red_terracotta": "Red coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:black_terracotta": "Black coloured terracotta, a decorational block. Red, orange, yellow, white, light gray, and brown variants spawn naturally in the badlands biome!",
  "minecraft:barrier": "An unvisible Block that is helpful to trap mobs and block ways. Only obtainable with commands.",
  "minecraft:light": "An invisible Block used to light up dark areas. Only obtainable with commands.",
  "minecraft:hay_block": "Compacted wheat, useful for storing large amounts. Also reduces fall damage.",
  "minecraft:white_carpet": "A decorational block crafted from 2 white wool.",
  "minecraft:orange_carpet": "A decorational block crafted from 2 orange wool.",
  "minecraft:magenta_carpet": "A decorational block crafted from 2 magenta.wool.",
  "minecraft:light_blue_carpet": "A decorational block crafted from 2 light blue wool.",
  "minecraft:yellow_carpet": "A decorational block crafted from 2 yellow wool.",
  "minecraft:lime_carpet": "A decorational block crafted from 2 lime wool.",
  "minecraft:pink_carpet": "A decorational block crafted from 2 pink wool.",
  "minecraft:gray_carpet": "A decorational block crafted from 2 gray wool.",
  "minecraft:light_gray_carpet": "A decorational block crafted from 2 light gray wool.",
  "minecraft:cyan_carpet": "A decorational block crafted from 2 cyan wool.",
  "minecraft:purple_carpet": "A decorational block crafted from 2 purple wool.",
  "minecraft:blue_carpet": "A decorational block crafted from 2 blue wool.",
  "minecraft:brown_carpet": "A decorational block crafted from 2 brown wool.",
  "minecraft:green_carpet": "A decorational block crafted from 2 green wool.",
  "minecraft:red_carpet": "A decorational block crafted from 2 red wool.",
  "minecraft:black_carpet": "A decorational block crafted from 2 black wool.",
  "minecraft:terracotta": "A block made from smelting clay. Can also be found in the badlands.",
  "minecraft:packed_ice": "A tougher ice created from 9 normal ice! Doesn't melt.",
  "minecraft:acacia_stairs": "Stairs made from acacia planks. A decorational block!",
  "minecraft:dark_oak_stairs": "Stairs made from dark oak planks. A decorational block!",
  "minecraft:dirt_path": "A path block naturally spawning in villages. It can be made by hitting dirt or grass with a shovel!",
  "minecraft:sunflower": "A nice, pretty flower! Can be placed in a plant pot or made into dye.",
  "minecraft:lilac": "A nice, pretty flower! Can be made into dye.",
  "minecraft:rose_bush": "A nice, pretty flower! Can be made into dye.",
  "minecraft:peony": "A nice, pretty flower! Can be placed in a plant pot or made into dye.",
  "minecraft:tall_grass": "Grass, but taller. That's literally it.",
  "minecraft:large_fern": "A fern, but larger. That's literally it.",
  "minecraft:white_stained_glass": "Glass stained with a white colour. A decorational block.",
  "minecraft:orange_stained_glass": "Glass stained with a orange colour. A decorational block.",
  "minecraft:magenta_stained_glass": "Glass stained with a magenta colour. A decorational block.",
  "minecraft:light_blue_stained_glass": "Glass stained with a light blue colour. A decorational block.",
  "minecraft:yellow_stained_glass": "Glass stained with a yellow colour. A decorational block.",
  "minecraft:lime_stained_glass": "Glass stained with a lime colour. A decorational block.",
  "minecraft:pink_stained_glass": "Glass stained with a pink colour. A decorational block.",
  "minecraft:gray_stained_glass": "Glass stained with a gray colour. A decorational block.",
  "minecraft:light_gray_stained_glass": "Glass stained with a light gray colour. A decorational block.",
  "minecraft:cyan_stained_glass": "Glass stained with a cyan colour. A decorational block.",
  "minecraft:purple_stained_glass": "Glass stained with a purple colour. A decorational block.",
  "minecraft:blue_stained_glass": "Glass stained with a blue colour. A decorational block.",
  "minecraft:brown_stained_glass": "Glass stained with a brown colour. A decorational block.",
  "minecraft:green_stained_glass": "Glass stained with a green colour. A decorational block.",
  "minecraft:red_stained_glass": "Glass stained with a red colour. A decorational block.",
  "minecraft:black_stained_glass": "Glass stained with a black colour. A decorational block.",
  "minecraft:white_stained_glass_pane": "Glass panes stained with a white colour. A decorational block.",
  "minecraft:orange_stained_glass_pane": "Glass panes stained with an orange colour. A decorational block.",
  "minecraft:magenta_stained_glass_pane": "Glass panes stained with a magenta colour. A decorational block.",
  "minecraft:light_blue_stained_glass_pane": "Glass panes stained with a light blue colour. A decorational block.",
  "minecraft:yellow_stained_glass_pane": "Glass panes stained with a yellow colour. A decorational block.",
  "minecraft:lime_stained_glass_pane": "Glass panes stained with a lime colour. A decorational block.",
  "minecraft:pink_stained_glass_pane": "Glass panes stained with a pink colour. A decorational block.",
  "minecraft:gray_stained_glass_pane": "Glass panes stained with a gray colour. A decorational block.",
  "minecraft:light_gray_stained_glass_pane": "Glass panes stained with a light gray colour. A decorational block.",
  "minecraft:cyan_stained_glass_pane": "Glass panes stained with a cyan colour. A decorational block.",
  "minecraft:purple_stained_glass_pane": "Glass panes stained with a purple colour. A decorational block.",
  "minecraft:blue_stained_glass_pane": "Glass panes stained with a blue colour. A decorational block.",
  "minecraft:brown_stained_glass_pane": "Glass panes stained with a brown colour. A decorational block.",
  "minecraft:green_stained_glass_pane": "Glass panes stained with a green colour. A decorational block.",
  "minecraft:red_stained_glass_pane": "Glass panes stained with a red colour. A decorational block.",
  "minecraft:black_stained_glass_pane": "Glass panes stained with a black colour. A decorational block.",
  "minecraft:prismarine": "Prismarine is a type of stone that appears underwater in ruins and ocean monuments. It changes colour between blue and green. Mesmerizing! Can be made with four prismarine shards.",
  "minecraft:prismarine_bricks": "The brick version of the prismarine block, it has an intricate shape. Crafted with nine prismarine shards.",
  "minecraft:dark_prismarine": "The darker version of the prismarine bricks, can be crafted with eight prismarine shards and an ink sac or black dye.",
  "minecraft:prismarine_stairs": "Stairs made from prismarine blocks, a decorational block.",
  "minecraft:prismarine_brick_stairs": "Stairs made from prismarine bricks, a decorational block.",
  "minecraft:dark_prismarine_stairs": "Stairs made from dark prismarine bricks, a decorational block.",
  "minecraft:sea_lantern": "A modern light block that looks nice with prismarine. A decorational block.",
  "minecraft:red_sandstone": "Sandstone made from red sand. A decorational block.",
  "minecraft:chiseled_red_sandstone": "Fancy sandstone made from red sand. A decorational block.",
  "minecraft:cut_red_sandstone": "Cut sandstone made from red sand. A decorational block.",
  "minecraft:red_sandstone_stairs": "Sandstone stairs made from red sand. A decorational block.",
  "minecraft:repeating_command_block": "A command block that will repeat the command given every tick when powered.",
  "minecraft:chain_command_block": "A command block that will repeat the command given after the block behind it when powered.",
  "minecraft:magma_block": "A block found in veins in the nether. It'll hurt if you don't sneak! Gives off a small amount of light.",
  "minecraft:nether_wart_block": "Nether wart blocks are decorative blocks found in crimson forests and can be crafted using nether wart!",
  "minecraft:warped_wart_block": "Warped wart blocks are a turquoise variant found in warped forests, but cannot be crafted unlike nether wart block.",
  "minecraft:red_nether_bricks": "Nether bricks, but redder. Can be crafted with nether bricks and nether warts.",
  "minecraft:bone_block": "Found naturally in the soul sand valley, accompanied by many skeletons. Can be crafted by using nine bone meal. You have to wonder though, what kind of creature left these bones behind?",
  "minecraft:structure_void": "Forces a block to be empty when saved as part of a structure. Only obtainable with commands.",
  "minecraft:shulker_box": "A chest-like container that retains its inventory when it is broken. Its magic. You can check its contents by hovering over the block in your inventory.",
  "minecraft:white_shulker_box": "The white variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:orange_shulker_box": "The orange variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:magenta_shulker_box": "The magenta variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:light_blue_shulker_box": "The light blue variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:yellow_shulker_box": "The yellow variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:lime_shulker_box": "The lime variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:pink_shulker_box": "The pink variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:gray_shulker_box": "The gray variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:light_gray_shulker_box": "The light gray variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:cyan_shulker_box": "The cyan variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:purple_shulker_box": "The purple variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:blue_shulker_box": "The blue variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:brown_shulker_box": "The brown variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:green_shulker_box": "The green variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:red_shulker_box": "The red variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:black_shulker_box": "The black variant of a shulker box, that retains its inventory when it is broken.",
  "minecraft:white_glazed_terracotta": "A white glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:orange_glazed_terracotta": "A orange glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:magenta_glazed_terracotta": "A magenta glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:light_blue_glazed_terracotta": "A light blue glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:yellow_glazed_terracotta": "A yellow glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:lime_glazed_terracotta": "A lime glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:pink_glazed_terracotta": "A pink glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:gray_glazed_terracotta": "A gray glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:light_gray_glazed_terracotta": "A light gray glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:cyan_glazed_terracotta": "A cyan glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:purple_glazed_terracotta": "A purple glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:blue_glazed_terracotta": "A blue glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:brown_glazed_terracotta": "A brown glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:green_glazed_terracotta": "A green glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:red_glazed_terracotta": "A red glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:black_glazed_terracotta": "A black glazed variant of the terracotta block, which has a pretty pattern on it!",
  "minecraft:white_concrete": "A white variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:orange_concrete": "A orange variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:magenta_concrete": "A magenta variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:light_blue_concrete": "A light blue variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:yellow_concrete": "A yellow variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:lime_concrete": "A lime variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:pink_concrete": "A pink variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:gray_concrete": "A gray variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:light_gray_concrete": "A light gray variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:cyan_concrete": "A cyan variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:purple_concrete": "A purple variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:blue_concrete": "A blue variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:brown_concrete": "A brown variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:green_concrete": "A green variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:red_concrete": "A red variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:black_concrete": "A black variant of the concrete block, created by soaking the powdered version in water. Purely decorational!",
  "minecraft:white_concrete_powder": "A white variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:orange_concrete_powder": "A orange variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:magenta_concrete_powder": "A magenta variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:light_blue_concrete_powder": "A light blue variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:yellow_concrete_powder": "A yellow variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:lime_concrete_powder": "A lime variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:pink_concrete_powder": "A pink variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:gray_concrete_powder": "A gray variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:light_gray_concrete_powder": "A light gray variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:cyan_concrete_powder": "A cyan variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:purple_concrete_powder": "A purple variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:blue_concrete_powder": "A blue variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:brown_concrete_powder": "A brown variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:green_concrete_powder": "A green variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:red_concrete_powder": "A red variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:black_concrete_powder": "A black variant of concrete powder, created with sand, gravel and dye. Will fall if placed.",
  "minecraft:turtle_egg": "A turtle's eggs. Baby turtles hatch from them, but beware, as zombies will jump on them and crack their fragile shells.",
  "minecraft:dead_tube_coral_block": "A dead coral block, it didn't get enough water.",
  "minecraft:dead_brain_coral_block": "A dead coral block, it didn't get enough water.",
  "minecraft:dead_bubble_coral_block": "A dead coral block, it didn't get enough water.",
  "minecraft:dead_fire_coral_block": "A dead coral block, it didn't get enough water.",
  "minecraft:dead_horn_coral_block": "A dead coral block, it didn't get enough water.",
  "minecraft:tube_coral_block": "A decorational coral block, found in warm oceans.",
  "minecraft:brain_coral_block": "A decorational coral block, found in warm oceans.",
  "minecraft:bubble_coral_block": "A decorational coral block, found in warm oceans.",
  "minecraft:fire_coral_block": "A decorational coral block, found in warm oceans.",
  "minecraft:horn_coral_block": "A decorational coral block, found in warm oceans.",
  "minecraft:tube_coral": "A decorational coral, found in warm oceans.",
  "minecraft:brain_coral": "A decorational coral, found in warm oceans.",
  "minecraft:bubble_coral": "A decorational coral, found in warm oceans.",
  "minecraft:fire_coral": "A decorational coral, found in warm oceans.",
  "minecraft:horn_coral": "A decorational coral, found in warm oceans.",
  "minecraft:dead_brain_coral": "A dead coral, it didn't get enough water.",
  "minecraft:dead_bubble_coral": "A dead coral, it didn't get enough water.",
  "minecraft:dead_fire_coral": "A dead coral, it didn't get enough water.",
  "minecraft:dead_horn_coral": "A dead coral, it didn't get enough water.",
  "minecraft:dead_tube_coral": "A dead coral, it didn't get enough water.",
  "minecraft:tube_coral_fan": "A decorational coral fan, found in warm oceans.",
  "minecraft:brain_coral_fan": "A decorational coral fan, found in warm oceans.",
  "minecraft:bubble_coral_fan": "A decorational coral fan, found in warm oceans.",
  "minecraft:fire_coral_fan": "A decorational coral fan, found in warm oceans.",
  "minecraft:horn_coral_fan": "A decorational coral fan, found in warm oceans.",
  "minecraft:dead_tube_coral_fan": "A dead coral fan, it didn't get enough water.",
  "minecraft:dead_brain_coral_fan": "A dead coral fan, it didn't get enough water.",
  "minecraft:dead_bubble_coral_fan": "A dead coral fan, it didn't get enough water.",
  "minecraft:dead_fire_coral_fan": "A dead coral fan, it didn't get enough water.",
  "minecraft:dead_horn_coral_fan": "A dead coral fan, it didn't get enough water.",
  "minecraft:blue_ice": "Even more expensive and even more slippery than regular ice. Crafted with 9 packed ice. (That's 81 ice!) Boats travel super fast on this!",
  "minecraft:conduit": "A powerful block that when placed in a properly built structure will give you night vision and water breathing when in nearby waters. Can be crafted with a heart of the sea and nautilus shells.",
  "minecraft:polished_granite_stairs": "Stairs made from polished granite. A decorational block!",
  "minecraft:smooth_red_sandstone_stairs": "Stairs made from smooth red sandstone. A decorational block!",
  "minecraft:mossy_stone_brick_stairs": "Stairs made from mossy stone bricks. A decorational block!",
  "minecraft:polished_diorite_stairs": "Stairs made from polished diorite. A decorational block!",
  "minecraft:mossy_cobblestone_stairs": "Stairs made from mossy cobblestone. A decorational block!",
  "minecraft:end_stone_brick_stairs": "Stairs made from end stone bricks. A decorational block!",
  "minecraft:stone_stairs": "Stairs made from stone. A decorational block!",
  "minecraft:smooth_sandstone_stairs": "Stairs made from smooth sandstone. A decorational block!",
  "minecraft:smooth_quartz_stairs": "Stairs made from smooth quartz. A decorational block!",
  "minecraft:granite_stairs": "Stairs made from granite. A decorational block!",
  "minecraft:andesite_stairs": "Stairs made from andesite. A decorational block!",
  "minecraft:red_nether_brick_stairs": "Stairs made from red nether bricks. A decorational block!",
  "minecraft:polished_andesite_stairs": "Stairs made from polished andesite. A decorational block!",
  "minecraft:diorite_stairs": "Stairs made from diorite. A decorational block!",
  "minecraft:cobbled_deepslate_stairs": "Stairs made from cobbled deepslate. A decorational block!",
  "minecraft:polished_deepslate_stairs": "Stairs made from polished deepslate. A decorational block!",
  "minecraft:deepslate_brick_stairs": "Stairs made from deeplsate bricks. A decorational block!",
  "minecraft:deepslate_tile_stairs": "Stairs made from deepslate tiles. A decorational block!",
  "minecraft:polished_granite_slab": "Slabs made from polished granite. A decorational block!",
  "minecraft:smooth_red_sandstone_slab": "Slabs made from smooth red sandstone. A decorational block!",
  "minecraft:mossy_stone_brick_slab": "Slabs made from mossy stone bricks. A decorational block!",
  "minecraft:polished_diorite_slab": "Slabs made from polished diorite. A decorational block!",
  "minecraft:mossy_cobblestone_slab": "Slabs made from mossy cobblestone. A decorational block!",
  "minecraft:end_stone_brick_slab": "Slabs made from end stone bricks. A decorational block!",
  "minecraft:smooth_sandstone_slab": "Slabs made from smooth sandstone. A decorational block!",
  "minecraft:smooth_quartz_slab": "Slabs made from smooth quartz. A decorational block!",
  "minecraft:granite_slab": "Slabs made from granite. A decorational block!",
  "minecraft:andesite_slab": "Slabs made from andesite. A decorational block!",
  "minecraft:red_nether_brick_slab": "Slabs made from red nether bricks. A decorational block!",
  "minecraft:polished_andesite_slab": "Slabs made from polished andesite. A decorational block!",
  "minecraft:diorite_slab": "Slabs made from diorite. A decorational block!",
  "minecraft:cobbled_deepslate_slab": "Slabs made from cobbled deepslate. A decorational block!",
  "minecraft:polished_deepslate_slab": "Slabs made from polished deepslate. A decorational block!",
  "minecraft:deepslate_brick_slab": "Slabs made from deeplsate bricks. A decorational block!",
  "minecraft:deepslate_tile_slab": "Slabs made from deepslate tiles. A decorational block!",
  "minecraft:scaffolding": "Simple block for climbing like ladders. Made out of bamboo!",
  "minecraft:redstone": "The key to big contraptions. Can transmit signals when placed down. Signals travel a max of 15 blocks.",
  "minecraft:redstone_torch": "Will produce a signal when on. The torch will power off when the block it is on is powered.",
  "minecraft:redstone_block": "A redstone block is crafted with 9 redstone. It is a full block that powers everything around it,",
  "minecraft:repeater": "A repeated will add a delay and renew a signal back to 15 block distance. The delay can be controlled. Powering the side will disable the repeater.",
  "minecraft:comparator": "A comparator compares the input from the back and side to produce the result. It can be inverted by toggling the torch on it. It can also scan the contents of a chest.",
  "minecraft:piston": "Can push blocks given a redstone signal.",
  "minecraft:sticky_piston": "Can push and pull given a redstone signal.",
  "minecraft:slime_block": "A very bouncy block that will move other blocks when pushed, but not honey blocks.",
  "minecraft:honey_block": "A very sticky block that will move other blocks when pushed, but not slime blocks.",
  "minecraft:observer": "This block will output a signal when the block in front of it is updated.",
  "minecraft:hopper": "This block will pick up items and pipe them along in a direction.",
  "minecraft:dispenser": "This block can drop items, however certain items will shoot out. These include arrows, fireballs, fireworks and water buckets.",
  "minecraft:dropper": "Unlike a dispenser, this block will drop all its items given a redstone signal.",
  "minecraft:lectern": "Can hold a book. This can also be read with a comparator.",
  "minecraft:target": "Will produce a signal when hit with a projectile. The closer to the center, the bigger the signal.",
  "minecraft:lever": "A toggle lever that gives out redstone signal depending on whether its on or off.",
  "minecraft:lightning_rod": "This block will cause any lightning in an area around it to hit the rod instead.",
  "minecraft:daylight_detector": "This block will output a redstone signal if its daytime. It can be inverted by right clicking.",
  "minecraft:sculk_sensor": "This block gives a redstone output when it hears noise. You can obstruct this with wool.",
  "minecraft:tripwire_hook": "Connect two with string to power the tripwire when someone passes through it.",
  "minecraft:trapped_chest": "This chest will give off a redstone signal when it is opened. It also doesn't connect with normal chests.",
  "minecraft:tnt": "Good ol' Trinitrotoluene, favorite of griefers everywhere. Goes boom!",
  "minecraft:redstone_lamp": "A lamp that can be toggled with the use of redstone.",
  "minecraft:note_block": "A block that plays singular notes ranging chromatically from B5 to B7. The instrument depends on the block which the note block sits on.",
  "minecraft:stone_button": "A stone piece that temporarily activates redstone.",
  "minecraft:polished_blackstone_button": "A polished blackstone piece that temporarily activates redstone.",
  "minecraft:oak_button": "An oak wooden piece that temporarily activates redstone.",
  "minecraft:spruce_button": "A spruce wooden piece that temporarily activates redstone.",
  "minecraft:birch_button": "A birch wooden piece that temporarily activates redstone.",
  "minecraft:jungle_button": "A jungle wooden piece that temporarily activates redstone.",
  "minecraft:acacia_button": "An acacia wooden piece that temporarily activates redstone.",
  "minecraft:dark_oak_button": "A dark oak wooden piece that temporarily activates redstone.",
  "minecraft:crimson_button": "A crimson wooden piece that temporarily activates redstone.",
  "minecraft:warped_button": "A warped wooden piece that temporarily activates redstone.",
  "minecraft:stone_pressure_plate": "Will emit a redstone signal when an player or mob steps on it.",
  "minecraft:polished_blackstone_pressure_plate": "Will emit a redstone signal when an player or mob steps on it.",
  "minecraft:light_weighted_pressure_plate": "Will emit a redstone signal when an entity steps on it. The more the merrier!",
  "minecraft:heavy_weighted_pressure_plate": "Will emit a redstone signal when an entity steps on it. The more the merrier!",
  "minecraft:oak_pressure_plate": "Will emit a redstone signal when an entity steps on it.",
  "minecraft:spruce_pressure_plate": "Will emit a redstone signal when an entity steps on it.",
  "minecraft:birch_pressure_plate": "Will emit a redstone signal when an entity steps on it.",
  "minecraft:jungle_pressure_plate": "Will emit a redstone signal when an entity steps on it.",
  "minecraft:acacia_pressure_plate": "Will emit a redstone signal when an entity steps on it.",
  "minecraft:dark_oak_pressure_plate": "Will emit a redstone signal when an entity steps on it.",
  "minecraft:crimson_pressure_plate": "Will emit a redstone signal when an entity steps on it.",
  "minecraft:warped_pressure_plate": "Will emit a redstone signal when an entity steps on it.",
  "minecraft:iron_door": "A two-tall door crafted with six iron ingots! Can be opened and closed with a redstone input, but not by a player!",
  "minecraft:oak_door": "A two-tall door crafted with six oak planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:spruce_door": "A two-tall door crafted with six spruce planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:birch_door": "A two-tall door crafted with six birch planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:jungle_door": "A two-tall door crafted with six jungle planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:acacia_door": "A two-tall door crafted with six acacia planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:dark_oak_door": "A two-tall door crafted with six dark oak planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:crimson_door": "A two-tall door crafted with six crimson planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:warped_door": "A two-tall door crafted with six warped planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:iron_trapdoor": "A trapdoor crafted with six iron ingots! Can be opened and closed with a redstone input, but not by a player!",
  "minecraft:oak_trapdoor": "A trapdoor crafted with six oak planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:spruce_trapdoor": "A trapdoor crafted with six spruce planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:birch_trapdoor": "A trapdoor crafted with six birch planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:jungle_trapdoor": "A trapdoor crafted with six jungle planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:acacia_trapdoor": "A trapdoor crafted with six acacia planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:dark_oak_trapdoor": "A trapdoor crafted with six dark oak planks! Can be opened and closed with a redstone input, or by a player!",
  "minecraft:crimson_trapdoor": "A trapdoor crafted with six crimson planks! Can be opened and closed with a redstone input, or by a player! Does not burn in fire.",
  "minecraft:warped_trapdoor": "A trapdoor crafted with six warped planks! Can be opened and closed with a redstone input, or by a player! Does not burn in fire.",
  "minecraft:oak_fence_gate": "A gate made out of oak planks! Can be opened and closed with a redstone input or by a player! Commonly used to stop the flow of water, and connects to normal fences.",
  "minecraft:spruce_fence_gate": "A gate made out of spruce planks! Can be opened and closed with a redstone input or by a player! Commonly used to stop the flow of water, and connects to normal fences.",
  "minecraft:birch_fence_gate": "A gate made out of birch planks! Can be opened and closed with a redstone input or by a player! Commonly used to stop the flow of water, and connects to normal fences.",
  "minecraft:jungle_fence_gate": "A gate made out of jungle planks! Can be opened and closed with a redstone input or by a player! Commonly used to stop the flow of water, and connects to normal fences.",
  "minecraft:acacia_fence_gate": "A gate made out of acacia planks! Can be opened and closed with a redstone input or by a player! Commonly used to stop the flow of water, and connects to normal fences.",
  "minecraft:dark_oak_fence_gate": "A gate made out of dark oak planks! Can be opened and closed with a redstone input or by a player! Commonly used to stop the flow of water, and connects to normal fences.",
  "minecraft:crimson_fence_gate": "A gate made out of crimson planks! Can be opened and closed with a redstone input or by a player! Commonly used to stop the flow of water, and connects to normal fences. Does not burn in fire.",
  "minecraft:warped_fence_gate": "A gate made out of warped planks! Can be opened and closed with a redstone input or by a player! Commonly used to stop the flow of water, and connects to normal fences. Does not burn in fire.",
  "minecraft:powered_rail": "Powered rail will push a minecart along given a redstone signal.",
  "minecraft:detector_rail": "This block will output a redstone signal when a minecraft is on it.",
  "minecraft:rail": "If you want a track for your minecarts these are a good start.",
  "minecraft:activator_rail": "It activates minecarts. Makes TNT minecarts go boom(slowly), triggers command block minecarts, stops hopper minecarts from picking stuff up, and kicks things out of regular minecarts.",
  "minecraft:saddle": "Used to ride horses, pigs, and striders. Only obtained from loot chests.",
  "minecraft:minecart": "Wheee! A cart to ride in! Hop in and place the cart on some rails.",
  "minecraft:chest_minecart": "Move your stuff on the rails.",
  "minecraft:furnace_minecart": "This will push a minecart along the rail when given coal.",
  "minecraft:tnt_minecart": "Trigger one of these with an activator rail, and it'll blink and go boom. But beware: if it bumps into something, it'll detonate instantly. Can be stacked for extra devastation.",
  "minecraft:hopper_minecart": "A moveable hopper. Can pick up items very quickly!",
  "minecraft:carrot_on_a_stick": "Used to drive saddled pigs.",
  "minecraft:warped_fungus_on_a_stick": "Used to drive saddled striders.",
  "minecraft:elytra": "Wings, equipped instead of a chestplate. Can be repaired with phantom membranes, or with the Mending enchantment.",
  "minecraft:oak_boat": "A boat made out of wood! Good for moving around! Even faster on ice!",
  "minecraft:spruce_boat": "A boat made out of wood! Good for moving around! Even faster on ice!",
  "minecraft:birch_boat": "A boat made out of wood! Good for moving around! Even faster on ice!",
  "minecraft:jungle_boat": "A boat made out of wood! Good for moving around! Even faster on ice!",
  "minecraft:acacia_boat": "A boat made out of wood! Good for moving around! Even faster on ice!",
  "minecraft:dark_oak_boat": "A boat made out of wood! Good for moving around! Even faster on ice!",
  "minecraft:structure_block": "Make structures to use in mods and datapacks! Only obtainable with commands.",
  "minecraft:jigsaw": "Make structures to use in mods and datapacks! Only obtainable with commands.",
  "minecraft:turtle_helmet": "A helmet obtained not by killing turtles (evil!), but crafting with scutes.",
  "minecraft:scute": "Not obtained by killing turtles (evil!), but when turtles grow up. Can be crafted into turtle helmet.",
  "minecraft:flint_and_steel": "Use to set things on fire, or to light a nether portal. Has durability, but can be enchanted.",
  "minecraft:apple": "A great lunch. Dropped from oak or dark oak trees.",
  "minecraft:bow": "A powerful weapon for long range. Uses arrows in your inventory.",
  "minecraft:arrow": "The most common projectile for a bow.",
  "minecraft:coal": "Can be used as furnace fuel for eight items, or as a crafting ingredient.",
  "minecraft:charcoal": "Obtained by burning logs in a furnace. Can be used as furnace fuel for eight items.",
  "minecraft:diamond": "Shiny! Found deep underground. A rare item, commonly a currency :D",
  "minecraft:emerald": "The only currency villagers accept. Can be found in mountain biomes.",
  "minecraft:lapis_lazuli": "A magical blue stone used for enchanting, or blue dye.",
  "minecraft:quartz": "A stone found in the nether, used for redstone items.",
  "minecraft:amethyst_shard": "A crystal shard found in geodes. You can make a spyglass!",
  "minecraft:raw_iron": "Iron fresh from the ore. Smelt it in a furnace or blast furnace to make an ingot.",
  "minecraft:iron_ingot": "An ingot of iron, used for crafting tools or armour.",
  "minecraft:raw_copper": "Copper fresh from the ore. Smelt it in a furnace or blast furnace to make an ingot.",
  "minecraft:copper_ingot": "An ingot of copper, used for crafting lightning rods or spyglasses.",
  "minecraft:raw_gold": "Pure gold fresh from the ore. Smelt it in a furnace or blast furnace to make an ingot.",
  "minecraft:gold_ingot": "Is this butter? Piglins like it. Useful with netherite scrap.",
  "minecraft:netherite_ingot": "A ingot made from netherite scraps. Use in a smithing table to upgrade diamond tools and armour.",
  "minecraft:netherite_scrap": "A scrap made from ancient nether debris. Combine with gold to make a netherite ingot.",
  "minecraft:wooden_sword": "A sword made out of wood, used for killing mobs. This has a low durability and low effectiveness.",
  "minecraft:wooden_shovel": "A shovel made out of wood, used for breaking sand, dirt, and gravel. This has a low durability and low effectiveness.",
  "minecraft:wooden_pickaxe": "A pickaxe made out of wood, used for breaking stones and metals. This has a low durability and low effectiveness.",
  "minecraft:wooden_axe": "An axe made out of wood, used for breaking woods. This has a low durability and low effectiveness.",
  "minecraft:wooden_hoe": "A hoe made out of wood, used for farmland and breaking plant matter. This has a low durability and low effectiveness.",
  "minecraft:stone_sword": "A sword made out of stone, used for killing mobs. This has a medium durability and medium effectiveness.",
  "minecraft:stone_shovel": "A shovel made out of stone, used for breaking sand, dirt, and gravel. This has a medium durability and medium effectiveness.",
  "minecraft:stone_pickaxe": "A pickaxe made out of stone, used for breaking stones and metals. This has a medium durability and medium effectiveness.",
  "minecraft:stone_axe": "An axe made out of stone, used for breaking stones. This has a medium durability and medium effectiveness.",
  "minecraft:stone_hoe": "A hoe made out of stone, used for farmland and breaking plant matter. This has a medium durability and medium effectiveness.",
  "minecraft:golden_sword": "A sword made out of gold, used for killing mobs. This has a low durability and incredible effectiveness.",
  "minecraft:golden_shovel": "A shovel made out of gold, used for breaking sand, dirt, and gravel. This has a low durability and incredible effectiveness.",
  "minecraft:golden_pickaxe": "A pickaxe made out of gold, used for breaking stones and metals. This has a low durability and incredible effectiveness.",
  "minecraft:golden_axe": "An axe made out of gold, used for breaking golds. This has a low durability and incredible effectiveness.",
  "minecraft:golden_hoe": "A hoe made out of gold, used for farmland and breaking plant matter. This has a low durability and incredible effectiveness.",
  "minecraft:iron_sword": "A sword made out of iron, used for killing mobs. This has a great durability and great effectiveness.",
  "minecraft:iron_shovel": "A shovel made out of iron, used for breaking sand, dirt, and gravel. This has a great durability and great effectiveness.",
  "minecraft:iron_pickaxe": "A pickaxe made out of iron, used for breaking stones and metals. This has a great durability and great effectiveness.",
  "minecraft:iron_axe": "An axe made out of iron, used for breaking irons. This has a great durability and great effectiveness.",
  "minecraft:iron_hoe": "A hoe made out of iron, used for farmland and breaking plant matter. This has a great durability and great effectiveness.",
  "minecraft:diamond_sword": "A sword made out of diamond, used for killing mobs. This has an excellent durability and excellent effectiveness.",
  "minecraft:diamond_shovel": "A shovel made out of diamond, used for breaking sand, dirt, and gravel. This has an excellent durability and excellent effectiveness.",
  "minecraft:diamond_pickaxe": "A pickaxe made out of diamond, used for breaking stones and metals. This has an excellent durability and excellent effectiveness.",
  "minecraft:diamond_axe": "An axe made out of diamond, used for breaking diamonds. This has an excellent durability and excellent effectiveness.",
  "minecraft:diamond_hoe": "A hoe made out of diamond, used for farmland and breaking plant matter. This has an excellent durability and excellent effectiveness.",
  "minecraft:netherite_sword": "A sword made out of netherite, used for killing mobs. This has a perfect durability and perfect effectiveness.",
  "minecraft:netherite_shovel": "A shovel made out of netherite, used for breaking sand, dirt, and gravel. This has a perfect durability and perfect effectiveness.",
  "minecraft:netherite_pickaxe": "A pickaxe made out of netherite, used for breaking stones and metals. This has a perfect durability and perfect effectiveness.",
  "minecraft:netherite_axe": "An axe made out of netherite, used for breaking woods. This has a perfect durability and perfect effectiveness.",
  "minecraft:netherite_hoe": "A hoe made out of netherite, used for farmland and breaking plant matter. This has a perfect durability and perfect effectiveness.",
  "minecraft:stick": "A common crafting ingredient made from wood. It's great to stock up on this!",
  "minecraft:bowl": "Where else do you get your soup in?",
  "minecraft:mushroom_stew": "Milk a mooshroom and eat some stew! Or craft it yourself with some mushrooms.",
  "minecraft:string": "Used to craft bows and fishing rods. Drops from spiders!",
  "minecraft:feather": "Hehe that tickles. Drops from chickens.",
  "minecraft:gunpowder": "Used for rockets and TNT, dropped by creepers.",
  "minecraft:wheat_seeds": "The seeds to grow wheat. Place on farmland to begin growing.",
  "minecraft:wheat": "Used to breed cows, sheep and feed horses, as well as to make bread.",
  "minecraft:bread": "A good way to eat. We like bread.",
  "minecraft:leather_helmet": "Protect your head using this helmet. +1 armour",
  "minecraft:leather_chestplate": "Protect your chest using this chestplate. +3 armour",
  "minecraft:leather_leggings": "Protect your legs using this leggings. +2 armour",
  "minecraft:leather_boots": "Protect your feets using this boots. With these you don't sink in powder snow. +1 armour",
  "minecraft:chainmail_helmet": "Protect your head using this helmet, uncraftable. +2 armour",
  "minecraft:chainmail_chestplate": "Protect your chest using this chestplate, uncraftable. +5 armour",
  "minecraft:chainmail_leggings": "Protect your legs using this leggings, uncraftable. +4 armour",
  "minecraft:chainmail_boots": "Protect your feets using this boots, uncraftable. +1 armour",
  "minecraft:iron_helmet": "Protect your head using this helmet. +2 armour",
  "minecraft:iron_chestplate": "Protect your chest using this chestplate. +6 armour",
  "minecraft:iron_leggings": "Protect your legs using this leggings. +5 armour",
  "minecraft:iron_boots": "Protect your feets using this boots. +2 armour",
  "minecraft:diamond_helmet": "Protect your head using this helmet. +3 armour",
  "minecraft:diamond_chestplate": "Protect your chest using this chestplate. +8 armour",
  "minecraft:diamond_leggings": "Protect your legs using this leggings. +6 armour",
  "minecraft:diamond_boots": "Protect your feets using this boots. +3 armour",
  "minecraft:golden_helmet": "Protect your head using this helmet. +2 armour",
  "minecraft:golden_chestplate": "Protect your chest using this chestplate. +5 armour",
  "minecraft:golden_leggings": "Protect your legs using this leggings. +3 armour",
  "minecraft:golden_boots": "Protect your feets using this boots. +1 armour",
  "minecraft:netherite_helmet": "Protect your head using this helmet. +3 armour and knockback resistance.",
  "minecraft:netherite_chestplate": "Protect your chest using this chestplate. +8 armour and knockback resistance.",
  "minecraft:netherite_leggings": "Protect your legs using this leggings. +6 armour and knockback resistance.",
  "minecraft:netherite_boots": "Protect your feets using this boots. +3 armour and knockback resistance.",
  "minecraft:flint": "Obtained by breaking gravel, can be used to craft a flint and steel.",
  "minecraft:porkchop": "The meat of a chicken, gives you salmonella.",
  "minecraft:cooked_porkchop": "The meat of a chicken, but cooked in a furnace or smoker.",
  "minecraft:painting": "Pixel art. Also check for secret passages.",
  "minecraft:golden_apple": "An apple with a layer of gold, giving absorption and regeneration II.",
  "minecraft:enchanted_golden_apple": "An apple with a layer of gold blocks, giver absorption IV and regeneration II Resistance and Fire Resistance. Can only be found in chests.",
  "minecraft:oak_sign": "A sign for people to write on, made with oak planks. Can also stop the flow of water or lava.",
  "minecraft:spruce_sign": "A sign for people to write on, made with spruce planks. Can also stop the flow of water or lava.",
  "minecraft:birch_sign": "A sign for people to write on, made with birch planks. Can also stop the flow of water or lava.",
  "minecraft:jungle_sign": "A sign for people to write on, made with jungle planks. Can also stop the flow of water or lava.",
  "minecraft:acacia_sign": "A sign for people to write on, made with acacia planks. Can also stop the flow of water or lava.",
  "minecraft:dark_oak_sign": "A sign for people to write on, made with dark oak planks. Can also stop the flow of water or lava.",
  "minecraft:crimson_sign": "A sign for people to write on, made with crimson planks. Can also stop the flow of water or lava.",
  "minecraft:warped_sign": "A sign for people to write on, made with warped planks. Can also stop the flow of water or lava.",
  "minecraft:bucket": "Crafted with 3 iron ingots, the bucket is a handy tool that can pick up and place lava, water, and powder snow. ",
  "minecraft:water_bucket": "A bucket of water used to take out fires and to catch your fall. It does not work in the nether. Craft a bucket and then fill it up by going to a water source and picking it up.",
  "minecraft:lava_bucket": "A bucket of lava used for attacking other players or things, lighting things on fire, and is very destructive. Need an excessive amount? The nether awaits. ",
  "minecraft:powder_snow_bucket": "A bucket of powdered snow which can allow you to catch your fall in the nether! On top of this, it acts the same as water but it does not spread, don't stay in it for too long, or you might get chills.",
  "minecraft:snowball": "Can be collected with a shovel and thrown at rapid speed. They do damage to blazes.",
  "minecraft:leather": "Obtained from many friendly or neutral animals, can be crafted into an item frame or a book! ",
  "minecraft:milk_bucket": "A bucket of milk used to clear all effects when drunk. Milk a cow with an empty bucket to acquire this. ",
  "minecraft:pufferfish_bucket": "A bucket of pufferfish used for absolutely nothing but to hold a dangerous pufferfish. Don't put it in an aquarium, they'll probably kill the other fish with their spikes.",
  "minecraft:salmon_bucket": "A bucket of salmon used for absolutely nothing but to hold a salmon. You can put this in an aquarium though, it's a nice friendly fish.",
  "minecraft:cod_bucket": "A bucket of cod used for absolutely nothing but to hold a cod. You can put this in an aquarium though, it's a nice friendly fish.",
  "minecraft:tropical_fish_bucket": "A bucket of tropical fish used for absolutely nothing but to hold a tropical fish. These fish do look fancy and are only found in lukewarm ocean biomes.",
  "minecraft:axolotl_bucket": "A bucket of axolotl used for absolutely nothing but to hold an axolotl although they are cool. Don't put this one in an aquarium, its a predator. ",
  "minecraft:brick": "Cooked form of clay, can be used to make a brick block!",
  "minecraft:clay_ball": "Obtained from breaking a clay block without the Silk Touch enchantment, you can bake them to create bricks or you can craft them back into a block if you have 4 of them.",
  "minecraft:dried_kelp_block": "Can be crafted with 9 dried kelp, it is a really good fuel source for furnaces, smokers or smelters.",
  "minecraft:paper": "Made from 3 sugar cane, paper can be used to make a lot of things, from books, to fireworks!",
  "minecraft:book": "A simple book, with nothing inside it, made from a single leather and 3 papers.",
  "minecraft:slime_ball": "A ball of slime. It's slimy. Drops from slimes. Which are also slimy.",
  "minecraft:egg": "Throw it or make a cake. Has a 1/6 chance to contain a baby chicken.",
  "minecraft:compass": "Find the way back to the world spawn. Don't assume it shows your where north is. Click on a lodestone to make it always point towards that block.",
  "minecraft:bundle": "A little bag! You can carry anything you want inside it and bring it on you adventures! The closest thing we'll get to a vanilla backpack in minecraft.",
  "minecraft:fishing_rod": "Perfect for a chill day with your dad.",
  "minecraft:clock": "Tells you the minecraft day time with a little painting.",
  "minecraft:spyglass": "Zoom into anywhere. AHA!",
  "minecraft:glowstone_dust": "Shiny dust from the nether. Used to make glowstone blocks.",
  "minecraft:cod": "\"fish\". This is a fish. You can cook it or eat it or something, but that will never change the fact that this will always be a fish, and will never stop being a fish.",
  "minecraft:salmon": "Found in cold waters and rivers, salmon is a very popular fish! Cats love it!",
  "minecraft:tropical_fish": "So colourful! Not cookable, but you can eat it.",
  "minecraft:pufferfish": "Don't eat, very hard to prepare not poisonous. Brew a potion of water breathing with it!",
  "minecraft:cooked_cod": "Very tasty, just cook a fresh cod and you're ready to go!",
  "minecraft:cooked_salmon": "Very tasty, just cook a fresh salmon and you're ready to go!",
  "minecraft:ink_sac": "The regular ink sack, obtained from the regular squid, can be used to make dye or to craft the book and quill.",
  "minecraft:glow_ink_sac": "Obtained from the glow squid! It's shiny! So... shiny... Use it to create the glowing item frame or to snazzy-up those boring signs and make them sparkle!",
  "minecraft:cocoa_beans": "Found in the depths of the jungle, it grows on the sides of the jungle tree! So tall!",
  "minecraft:white_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from bone meal or lily of the valley's.",
  "minecraft:orange_dye": "It can be used to dye any block that has colour variations. This dye can be obtained by mixing red and yellow dye or with an orange tulip.",
  "minecraft:magenta_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from mixing purple dye and pink dye, red blue and white, pink red and blue or from Allium or Lilacs.",
  "minecraft:light_blue_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from mixing white and blue dye, or from the blue orchid.",
  "minecraft:yellow_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from dandelions or sunflowers.",
  "minecraft:lime_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from mixing green dye and white dye or from baking a sea pickle.",
  "minecraft:pink_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from mixing red dye and white dye or from pink tulips or peonies.",
  "minecraft:gray_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from mixing black dye and white dye.",
  "minecraft:light_gray_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from mixing white dye and grey dye or from azure bluets, oxeye daisies or white tulips.",
  "minecraft:cyan_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from mixing green dye and blue dye.",
  "minecraft:purple_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from mixing blue dye and red dye.",
  "minecraft:blue_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from lapis lazuli or cornflowers.",
  "minecraft:brown_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from cocoa beans.",
  "minecraft:green_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from baking cactus.",
  "minecraft:red_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from poppies, red tulips, rose bushes or beetroots.",
  "minecraft:black_dye": "It can be used to dye any block that has colour variations. This dye can be obtained from ink sacs or wither roses.",
  "minecraft:bone_meal": "Are you tired of waiting around for you garden to flourish? Skip the waiting with this! Just right click on your grass, flower or crop of choice and watch as it grows!",
  "minecraft:bone": "Just a bone, you can grind it down to make some bone meal or tame man's best friend!",
  "minecraft:sugar": "Sweet, obtained from the aptly named sugar cane or from the honey bottle. It has many uses, from baking to brewery!",
  "minecraft:cake": "its a lie.",
  "minecraft:white_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:orange_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:magenta_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:light_blue_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:yellow_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:lime_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:pink_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:gray_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:light_gray_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:cyan_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:purple_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:blue_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:brown_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:green_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:red_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:black_bed": "A bouncy and soft bed, perfect for chasing the dark away. Right click on it to sleep and skip the night or bad weather!",
  "minecraft:cookie": "What a sweet but inefficient way to eat. Totally worth it, I think.",
  "minecraft:filled_map": "A map that has been drawn, right click on a re-named banner to make your own waypoint! Try it out!",
  "minecraft:shears": "Shear you sheep for wool, leaves or grass.",
  "minecraft:melon_slice": "A slice of melon.",
  "minecraft:dried_kelp": "Crunchy, cooked spinach.",
  "minecraft:pumpkin_seeds": "Seeds to grow pumpkins.",
  "minecraft:melon_seeds": "Seeds to grow melons.",
  "minecraft:beef": "The meat from a cow.",
  "minecraft:cooked_beef": "The meat from a cow, but cooked in a furnace or smoker.",
  "minecraft:chicken": "Why would you do this? What did the chicken ever do to you? At least cook it!",
  "minecraft:cooked_chicken": "Cooked and ready to eat!",
  "minecraft:rotten_flesh": "Has a chance to give a hunger debuff when eaten, but doggos are immune. Dropped by zombies.",
  "minecraft:ender_pearl": "Throw it and you will teleport wherever it lands! Can be used to make eyes of ender. Dropped by an enderman.",
  "minecraft:blaze_rod": "A rod dropped by blazes. Can make a brewing stand or blaze powder.",
  "minecraft:ghast_tear": "A symbol of the ghast's eternal sadness. Can be used to brew a potion of regeneration. Tastes salty.",
  "minecraft:gold_nugget": "A nugget of pure gold. Can be crafted into a gold ingot.",
  "minecraft:nether_wart": "A little nugget-like crop that can be found in nether fortresses, it is the starting ingredient of many potions! You can grow it on soul sand and make sure to place plenty of light near it!",
  "minecraft:potion": "Ooh, drink it and see what happens! A concoction made from a select set of ingredients using a brewing stand.",
  "minecraft:glass_bottle": "A bottle made from glass. Can be filled with water to start making potions!",
  "minecraft:spider_eye": "It's the eye of the spider! Drops from spiders.",
  "minecraft:fermented_spider_eye": "Technically, this is a pickled eye.",
  "minecraft:blaze_powder": "Mashed up blaze rods. Necessary for brewing, and crafting eyes of ender.",
  "minecraft:magma_cream": "Cream from magma cubes, or crafted from slime and blaze powder.",
  "minecraft:brewing_stand": "Put in blaze powder, water bottles, and an ingredient and make some yummy drinks!",
  "minecraft:cauldron": "Made with seven pieces of iron, it can be used to hold either water or lava inside it! Perfect for brewing!",
  "minecraft:ender_eye": "Throw this with with right click, then it will show you the way to the nearest stronghold.",
  "minecraft:glistering_melon_slice": "Shiny melons! Can be used to brew a potion of healing.",
  "minecraft:axolotl_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:bat_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:bee_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:blaze_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:cat_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:cave_spider_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:chicken_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:cod_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:cow_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:creeper_spawn_egg": "Aw, man! Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:dolphin_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:donkey_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:drowned_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:elder_guardian_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:enderman_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:endermite_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:evoker_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:fox_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:ghast_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:glow_squid_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:goat_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:guardian_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:hoglin_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:horse_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:husk_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:llama_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:magma_cube_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:mooshroom_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:mule_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:ocelot_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:panda_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:parrot_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:phantom_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:pig_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:piglin_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:piglin_brute_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:pillager_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:polar_bear_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:pufferfish_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:rabbit_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:ravager_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:salmon_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:sheep_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:shulker_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:silverfish_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:skeleton_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:skeleton_horse_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:slime_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:spider_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:squid_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:stray_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:strider_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:trader_llama_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:tropical_fish_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:turtle_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:vex_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:villager_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:vindicator_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:wandering_trader_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:witch_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:wither_skeleton_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:wolf_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:zoglin_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:zombie_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:zombie_horse_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:zombie_villager_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:zombified_piglin_spawn_egg": "Spawn eggs spawn the corresponding mob when placed. When in creative mode, they can set the mob in a mob spawner.",
  "minecraft:experience_bottle": "Bottled-up experience! Perfect for repairing tools or armour with the Mending enchantment! Can be traded with emeralds from librarians!",
  "minecraft:fire_charge": "Can be obtained from ruined portals or crafted from gunpowder, coal and blaze powder. Right click on a block to create a flame!",
  "minecraft:writable_book": "Perfect for writing things down! Like my grocery list! Can be crafted from a book, an ink sac and a feather!",
  "minecraft:written_book": "Once you sign it, there's no going back.",
  "minecraft:item_frame": "Display your favorite weapon or your precious loot with this item frame! Crafted from sticks and leather!",
  "minecraft:glow_item_frame": "Maybe the regular item frame wasn't enough, well, don't worry! Display your items with this glowing item frame and keep your items shining bright! Add a glowing ink sac to the regular item frame and you're set!",
  "minecraft:flower_pot": "Perfect for decorating you home with that nice cottagecore vibe, crafted from three bricks, the flower pot can help you display all one block tall flowers and some others! Like cactus!",
  "minecraft:carrot": "Orange and long, mistaken to be a rabbit first choice, can be used to make a carrot on a stick, a golden carrot, and is an ingredient in the rabbit stew. Found as rare loot from zombies or in farms around villages!",
  "minecraft:potato": "The best legume, can be cooked into a baked potato. It can be obtained as rare zombie loot or in farms around villages!",
  "minecraft:baked_potato": "Baked potato! Steamy and mushy! How could you not like it? Made from cooking a raw potato.",
  "minecraft:poisonous_potato": "A potato, but it's poisonous. Almost completely useless, but somehow part of A Balanced Diet.",
  "minecraft:map": "Don't lose your way with this map! Now you can display your world by using them on an item frame! You can right-click with a map on hand on a re-named banner to create your own waypoint! Try it out!",
  "minecraft:golden_carrot": "The best food a villager can trade you, it has an immense amount of absorption, an adventurer's best friend! Can also be crafted with golden nuggets surrounding a regular carrot.",
  "minecraft:skeleton_skull": "Blast away this mob with a charged creeper to obtain its head as a trophy!",
  "minecraft:wither_skeleton_skull": "After hours of grinding, you finally obtain one of the pieces to summon the Wither. Can be obtained by killing many wither skeletons, better have Looting III on the ready.",
  "minecraft:player_head": "The severed head of a minecraft player. Can only be obtained with commands.",
  "minecraft:zombie_head": "Blast away this mob with a charged creeper to obtain its head as a trophy!",
  "minecraft:creeper_head": "Blast away this mob with a charged creeper to obtain its head as a trophy!",
  "minecraft:dragon_head": "Flying high above the end cities, you see it, the place where you'll finally obtain your wings! Oh, and the dragon head is there too, just go to the front of the ship to obtain your prize!",
  "minecraft:nether_star": "A reward, and the next step towards ultimate power. Obtained by killing the Wither, can be crafted, with obsidian and glass, into a beacon.",
  "minecraft:pumpkin_pie": "Would you like some cinnamon with that? Can be crafted with a regular pumpkin, sugar and an egg. Yum!",
  "minecraft:firework_rocket": "Light the sky above with wonderful colours! Gunpowder, paper, and the ingredients of your choosing should be enough! Right-click on the ground or make a redstone contraption to release the colour into the clouds! ",
  "minecraft:firework_star": "Made from gunpowder and any selection of ingredients of your choosing, match with paper to make your very own firework rocket!",
  "minecraft:enchanted_book": "An ancient art lies inside this book, with it you can release the true power of your tools and armour. Can be found in chests, traded for with villagers or enchanted with a book and an enchanting table!",
  "minecraft:nether_brick": "A brick obtained from cooking raw netherrack, if you get four of them you can turn them into a block!",
  "minecraft:prismarine_shard": "A prismarine shard is an item obtained by defeating guardians or elder guardians. It can be used to craft various prismarine blocks as well as sea lanterns.",
  "minecraft:prismarine_crystals": "Prismarine crystals are items obtained by defeating guardians or elder guardians. They are used along with prismarine shards to craft sea lanterns.",
  "minecraft:rabbit": "The meat from a rabbit.",
  "minecraft:cooked_rabbit": "The meat from a rabbit, but cooked in a furnace or smoker.",
  "minecraft:rabbit_stew": "A stew with an arrange of vegetables and, of course, a rabbit. Can be made with a cooked rabbit, a carrot, a baked potato, and one of the two mushroom variants, place these ingredients with a bowl in the crafting recipe and voila!",
  "minecraft:rabbit_foot": "Use this to increase your luck (we are not responsible if it does not actually increase luck)",
  "minecraft:rabbit_hide": "Like leather, but from rabbits.",
  "minecraft:armour_stand": "A statue that wears your armour for you, because you're so good you don't need it.",
  "minecraft:iron_horse_armour": "Can be put upon your mighty steed to make it even mightier! Only obtained through loot chests.",
  "minecraft:golden_horse_armour": "Can be put upon your mighty steed to make it even mightier! Only obtained through loot chests.",
  "minecraft:diamond_horse_armour": "Protects your horse with a layer of diamonds. Only obtained through loot chests.",
  "minecraft:leather_horse_armour": "Protects your horse with a layer of leather. Can be crafted using seven leather.",
  "minecraft:lead": "Leads, now with 0% lead! Can be used to pull an animal along on a journey with you, or attach them to a fence post!",
  "minecraft:name_tag": "Name an entity anything you want!",
  "minecraft:command_block_minecart": "Beep boop i am a moving robot.",
  "minecraft:mutton": "The meat from a sheep.",
  "minecraft:cooked_mutton": "The meat from a sheep, but cooked in a furnace or smoker.",
  "minecraft:white_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:orange_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:magenta_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:light_blue_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:yellow_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:lime_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:pink_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:gray_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:light_gray_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:cyan_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:purple_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:blue_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:brown_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:green_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:red_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:black_banner": "A banner to show a design. Can be modified with a loom.",
  "minecraft:end_crystal": "A crystal crafted from the tears of ghasts, placed in certain spots around the end's exit portal might revive an old adversary. Time for round two.",
  "minecraft:chorus_fruit": "A fruit from the end, that can teleport you in a random direction in an 8x8x8 field! Caution is advised.",
  "minecraft:popped_chorus_fruit": "A cooked version of the chorus fruit, used in the production of end rods. Don't eat, you'll choke.",
  "minecraft:beetroot": "The best vegetable in the game. Clearly. Grown on farmland.",
  "minecraft:beetroot_seeds": "Seeds of life for growing the best vegetable in the game. Place on farmland to grow,",
  "minecraft:beetroot_soup": "A red soup created form the best vegetable in the game.",
  "minecraft:dragon_breath": "The breath of the dragon, used to make lingering potions. Obtained by using a bottle on the effect cloud of the ender dragon.",
  "minecraft:splash_potion": "This potion will give everything an an area its status when thrown.",
  "minecraft:spectral_arrow": "This arrow will cause the enemy it hits to glow!",
  "minecraft:tipped_arrow": "This arrow gives an effect when it hits something!",
  "minecraft:lingering_potion": "A potion that lingers in an area when thrown.",
  "minecraft:shield": "Protect yourself from ranged weaponry by holding this in your left hand!",
  "minecraft:totem_of_undying": "Cheat death with this totem, originally crafted by the Evokers by an art now lost to humans.",
  "minecraft:shulker_shell": "A shell from a dead shulker, used for creating a Schrodinger's chest.",
  "minecraft:iron_nugget": "A small piece of iron, crafted from one iron ingot. Useless in this form, and can be crafted back into iron.",
  "minecraft:knowledge_book": "The ancient tome of knowledge, so long lost but now finally recovered. The ancient texts read: \"Subscribe to Cy4's Modding on YouTube!\" I wonder what this means...",
  "minecraft:debug_stick": "You can also try fixing your bugs by subscribing to \"Cy4's Modding\" on YT! Who knows what'll happen!",
  "minecraft:music_disc_13": "A spoOoOOky music track that can be listened to with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_cat": "A light, heartfelt music track that can be listened to with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_blocks": "A noice music track that can be listened to with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_chirp": "Have you ever wanted to have elevator music playing in your base? Can be played with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_far": "A questioning music track that can be listened to with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_mall": "A tedious music track that can be listened to with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_mellohi": "A rememberable music track that can be listened to with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_stal": "An drumming music track that can be listened to with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_strad": "A stringy music track that can be listened to with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_ward": "A mysterious music track that can be listened to with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_11": "A strange audio recording that can be listened to with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_wait": "A patient music track that can be listened to with a jukebox. Obtained as drop loot from a creeper killed by a skeleton, or as chest loot.",
  "minecraft:music_disc_otherside": "A happy and awesome music track that can be listened to with a jukebox. Can only be obtained as chest loot in strongholds.",
  "minecraft:music_disc_pigstep": "An otherworldly and awesome music track that can be listened to with a jukebox. Can only be obtained as chest loot in the bastions of our pig-like friends.",
  "minecraft:trident": "You feel powerful in the possession of this weapon, be it for the symbolism that it carries, or the amount of time it took to get it. Perfect for throwing at your enemies. Certain enchantments can also give it some fun abilities!",
  "minecraft:phantom_membrane": "An organic membrane found inside of a phantom. Can be used to repair an elytra.",
  "minecraft:nautilus_shell": "A swirly shell that can be obtained through fishing or shipwrecks, or even killing drowned enemies! (Down a drowned?)",
  "minecraft:heart_of_the_sea": "A mysterious gem that can be used to craft a conduit.",
  "minecraft:crossbow": "Make your enemies despair with this sophisticated and swift tool, you'll only need some arrows to do the trick, just hold and release! Hmm... I wonder if it works with a certain explosive item.",
  "minecraft:suspicious_stew": "To drink or not drink, that is the question. It might have some very strange effects on the one who consumes it. (Unapproved by the Minecraft Health Organisation, or MHO)",
  "minecraft:loom": "Design your own original banner fast and easy with this practical loom! A functional block, right click to use.",
  "minecraft:flower_banner_pattern": "An image of a flower that can be applied to a banner.",
  "minecraft:creeper_banner_pattern": "An image of a creeper that can be applied to a banner.",
  "minecraft:skull_banner_pattern": "An image of a skull that can be applied to a banner.",
  "minecraft:mojang_banner_pattern": "An image of a strangely familiar shape that can be applied to a banner.",
  "minecraft:globe_banner_pattern": "An image of the globe that can be applied to a banner.",
  "minecraft:piglin_banner_pattern": "An image of a snout that can be applied to a banner.",
  "minecraft:composter": "Convert plant matter into bone meal with this block! Right click items in or pipe them in with a hopper.",
  "minecraft:barrel": "A storage block that holds the same amount of items as a chest! It can be rotated and doesn't need space above it to be opened, but can't combine into a double chest.",
  "minecraft:smoker": "Just like a furnace, but it can smelt foods faster! A functional block, right click to use.",
  "minecraft:blast_furnace": "Just like a furnace, but it can smelt ores faster! A functional block, right click to use.",
  "minecraft:cartography_table": "A table you can use to expand maps. A functional block, right click to use.",
  "minecraft:fletching_table": "A useless table that has something to do with arrows, probably.",
  "minecraft:grindstone": "This block is extremely useful in removing enchantments from tools, or even repairing them. A functional block, right click to use.",
  "minecraft:smithing_table": "Used to upgrade diamond tools to netherite by adding the tool to a netherite ingot! A functional block, right click to use. (Also works in floors and ceilings as decoration!)",
  "minecraft:stonecutter": "A sharp rotating blade that can slice through stones, shaping them into other forms! A functional block, right click to use.",
  "minecraft:bell": "Found in villages, a bell makes a very very loud noise. Although this can be used to troll your friends, it can also scare villagers into running back to their houses! It will also reveal locations of nearby pillagers!",
  "minecraft:lantern": "\"A torch in a box\", the lantern is a decorative block that can also be used as a light source.",
  "minecraft:soul_lantern": "\"A torch in a box\", the lantern is a decorative block that can also be used as a light source. This one also seems to be blue, for some reason...",
  "minecraft:sweet_berries": "A bushel of nice berries with a high amount of fructose.",
  "minecraft:glow_berries": "A bushel of bright berries that glow in the dark.",
  "minecraft:campfire": "Nothing like a warm fireplace to spend the cold nights with, place your favorite raw foods on it and watch as they cook! Very cozy, functional and decorational.",
  "minecraft:soul_campfire": "A campfire... except the fire is BLUE!?! We won't try to explain it, but you can still cook your food here.",
  "minecraft:shroomlight": "Despite what its appearance might suggest, it is cold to the touch. A welcome feeling in the searing underworld. Take it with you to bring some light to your base!",
  "minecraft:honeycomb": "Maybe this is too sweet to eat, but it has many uses! From candles, to your very own beehive! It can also stop the aging process on copper blocks! Can be harvested by shearing bee nests or hives.",
  "minecraft:bee_nest": "The home of our greatest pollinators! Maybe, if you stick around, something good might happen!",
  "minecraft:beehive": "Your own little refuge for the buzzy bees! I'm sure they'll love it! Acts exactly like a bee nest, just manmade rather than spawned naturally.",
  "minecraft:honey_bottle": "A sweet treat from our buzzy friends! Can be used to create honey blocks or convert into sugar! And, yes, you can also drink it (although it is advised to dilute in real life).",
  "minecraft:honeycomb_block": "Made from the raw honeycomb obtained from bees! Such an ingenious design, so compact, so effective! A decorational block.",
  "minecraft:lodestone": "Right click on this block with a compass to have your compass always point in the direction of the block. Never get lost again!",
  "minecraft:crying_obsidian": "A variation of obsidian commonly found in ruined portals. It's used to make respawn anchors or to make bass drum sounds, if you can figure out how.",
  "minecraft:blackstone": "Cobblestone, dark theme. Can be found in clusters underground in the nether dimension! Found commonly in the basalt deltas biome.",
  "minecraft:blackstone_slab": "Slabs made from blackstone, a decoration block.",
  "minecraft:blackstone_stairs": "Stairs made from blackstone, a decoration block.",
  "minecraft:gilded_blackstone": "Blackstone lined with thin traces of gold. Can be found in bastions and is used for decoration.",
  "minecraft:polished_blackstone": "A very modern-looking decoration block, the polished version of our beloved blackstone!",
  "minecraft:polished_blackstone_slab": "A rather fancy slab block made from polished blackstone, used for decoration.",
  "minecraft:polished_blackstone_stairs": "A rather fancy stair block made from polished blackstone, used for decoration.",
  "minecraft:chiseled_polished_blackstone": "Polished blackstone carved with a very remarkable shape, seems familiar...",
  "minecraft:polished_blackstone_bricks": "Bricks made from polished blackstone. The building blocks of a Bastian, a structure located in the Nether dimension.",
  "minecraft:polished_blackstone_brick_slab": "Slabs made from polished blackstone bricks, a decoration block.",
  "minecraft:polished_blackstone_brick_stairs": "Stairs made from polished blackstone bricks, a decoration block.",
  "minecraft:cracked_polished_blackstone_bricks": "Time was cruel to them. A decorative block used for building.",
  "minecraft:respawn_anchor": "Have you ever wanted to respawn in the bowels of the lava-riddled underworld? Well, this might be the thing that you're looking for! Place it on your desired location, stick a glowstone block in this baby and bye-bye blue sky!",
  "minecraft:candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Basic and comforting, like vanilla! colour it up with some dye and you can get some funky variations!",
  "minecraft:white_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. White like the oxeye daisy! Or was it the white tulip? The azure bluet? Or maybe the lily of the valley?",
  "minecraft:orange_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Orange like pumpkins! It is a nice addition to some builds dedicated to a certain holiday!",
  "minecraft:magenta_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Like the colourful coral in the warm ocean, very tropical!",
  "minecraft:light_blue_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. If diamonds had a scent, this would be it.",
  "minecraft:yellow_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Yellow and bright like the sun, it carries the scent of fresh honey!",
  "minecraft:lime_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Would you like to have the scent of freshly cut grass in your base? Well, this is just the thing you need!",
  "minecraft:pink_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. This candle smells awfully sweet? It could be thanks to the pink tulip!",
  "minecraft:gray_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Gray like stone, a miner's preferred choice of candle.",
  "minecraft:light_gray_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Light gray like the day during rain, I sure hope you have a lightning rod placed.",
  "minecraft:cyan_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Cyan like setting sky, it reminds of a certain inferior fungus.",
  "minecraft:purple_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. A strong and sweet scent like the lilac flower!",
  "minecraft:blue_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Salty like the ocean, a fisherman's best friend on land!",
  "minecraft:brown_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. It smells like dirt, it's actually a pretty nice smell!",
  "minecraft:green_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Green like moss, musky and humid, reminds of the jungle.",
  "minecraft:red_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Red like roses, a nice floral scent this candle carries.",
  "minecraft:black_candle": "Wax and wick, light it up with a flint and steel and you have a little decoration to lighten up your base. Dark and moody like coal, it is said to have the scent of the cold, deep dark",
  "minecraft:small_amethyst_bud": "A gemstone in the process of growing, this one just started to grow!",
  "minecraft:medium_amethyst_bud": "A gemstone in the middle of the process of growing. Talk about a mid-life crisis.",
  "minecraft:large_amethyst_bud": "A gemstone in the very late age of growing, just a bit longer now and you will be able to collect the full-grown Amethyst Cluster!",
  "minecraft:amethyst_cluster": "A beautiful decorative gemstone, make sure to mine it with the Silk Touch enchantment to bring it to your base! Otherwise, you can obtain the raw gem from these clusters.",
  "minecraft:pointed_dripstone": "Can be found in a dripstone cave biome, but can be found solitary in normal cave systems as well. Can drip lava into cauldron, and do damage when dropped.",
  "Contributors:": "Cy4, siin2, KhanhTypo, and many more ..",
  "empty": ""
}