{
  "name": "Poisons",
  "icon": "elementaristics:poison_glassblood",
  "category": "alchemy",
  "advancement": "elementaristics:progress_water",
  "pages": [
    {
      "type": "text",
      "text": "Generally speaking, poisons are potent potions to harm living beings. With the power of Alchemy, certain, sometimes even beneficial, potions may be fabricated. $(br)These potions can be thrown into a flame to affect close entities with them, or they can be used on items on the ground. The affected item, or one item near the place it was burnt, will then bear the effect."
    },
    {
      "type": "text",
      "text": "This means that when the item is consumed, the effect of the potion will be released. That's also the reason why only consumable items, like foods and potions, can be poisoned. If one wishes to poison another with such a consumable, one should be careful how they do it, as poisoned items do not stack with other ones that are not."
    },
    {
      "type": "spotlight",
      "item": "elementaristics:poison_sandthroat",
      "text": "When consumed, the one that consumed this poison will find their throat cracked dry, and will shortly after burn, though this does not cause severe harm. The Sandthroat Poison is generally not lethal in any way, and will even slightly fill hunger and remove all other potion effects."
    },
    {
      "type": "crafting",
      "recipe": "elementaristics:recipe_poison_sandthroat",
      "text": "$(o)Sand soup for Morinor$()"
    },
    {
      "type": "spotlight",
      "item": "elementaristics:poison_glassblood",
      "text": "This extremely concentrated Sandthroat Toxin which has been manipulated magically will make the consumer's blood feel like thousands of glass fragments, and will drain all Magan, and quite a lot of health points. It will also cause the wither effect, which makes it generally lethal."
    },
    {
      "type": "purifier_recipe",
      "recipe": "elementaristics:poison_glassfinger_base",
      "text": "In order to fabricate it, $(item)Sandthroat Toxin$() must first be purified into $(item)Concentrated Sand Acid$(), which must then be used in an $(l:alchemy/entry_basin)Infusion Basin$() with $(lessons/lesson_collection)Light Essence$() and $(lessons/lesson_collection)Ice Essence$()."
    },
    {
      "type": "spotlight",
      "item": "elementaristics:poison_wintersbreath",
      "text": "Winter's Breath is a $(marked)delayed poison$(), which will activate after a minute or two. The poison will starve the victim a lot, and will also cause the wither effect, though it is not necessarily lethal."
    },
    {
      "type": "crafting",
      "recipe": "elementaristics:recipe_poison_winter",
      "text": "$(o)I'm cold$()"
    }
  ]
}