{
  "name": "Divination",
  "icon": "occultism:divination_rod",
  "category": "occultism:getting_started",
  "sortnum": 3,
  "pages": [
    {
      "type": "text",
      "text": "To make it easier to get started, the materials obtained by divination now also have crafting recipes. $(bold)If you want the full experience, skip the following recipe pages and move on to the divination instructions.$()"
    },
    {
      "type": "spotlight",
      "item": "occultism:otherstone",
      "text": "To obtain Otherstone, purify $(item)Andesite$() in $(thing)Spirit Fire$()."
    },
    {
      "type": "spotlight",
      "item": "occultism:otherworld_sapling",
      "text": "To obtain an Otherworld Sapling, purify an $(item)Oak Sapling$() in $(thing)Spirit Fire$(). $(bold)Beware$(): the tree growing from the sapling will look like a normal oak tree. You need to activate the $(thing)Third Eye$() to harvest the Otherworld Logs and Leaves."
    },
    {
      "type": "spotlight",
      "item": "occultism:divination_rod",
      "text": "Otherworld materials play an important role in interacting with spirits. As they are rare and not visible to the naked eye, finding them requires special tools. The divination rod allows to find Otherworld materials based on their similarities to materials common to our world."
    },
    {
      "type": "text",
      "text": "The divination rod uses a spirit attuned gem attached to a wooden rod. The gem resonates with the chosen material, and this movement is amplified by the wooden rod, allowing to detect nearby Otherworld materials.$(br2) The rod works by detecting resonance between real world and Otherworld materials. Attuned the rod to a real world material, and it will find the corresponding Otherworld block."
    },
    {
      "type": "text",
      "title": "Use of the Rod",
      "text": "Shift-right-click a block to attune the rod to the corresponding Otherworld block.$(br)$(li)$(item)Andesite$() - $(item)Otherstone$()$(li)$(item)Oak Log$() - $(item)Otherwood Log$()$(li)$(item)Oak Leaves$() - $(item)Otherworld Leaves$()$(li)$(item)Netherrack$() - $(item)Iesnium Ore$()$(br2)Then right-click and hold until the rod animation finishes."
    },
    {
      "type": "text",
      "text": "After the animation finishes, the closest $(bold)found block will be highlighted with white lines and can be seen through other blocks$(). Additionally you can watch the crystals for hints: a white crystal indicates no target blocks found, a fully purple block means the found block is nearby. Mixes between white and purple show that the target is rather far away. $(bold)Hint:$() In the Overworld, look $(bold)down$() (see following page on Otherworld Groves)!"
    },
    {
      "type": "image",
      "border": "true",
      "images": [
        "occultism:textures/gui/book/rod_detected.png"
      ],
      "text": "A small purple spot in the crystal indicates the target has been detected."
    },
    {
      "type": "image",
      "border": "true",
      "images": [
        "occultism:textures/gui/book/rod_close.png"
      ],
      "text": "The more purple you see, the closer you are."
    },
    {
      "type": "text",
      "title": "Otherworld Groves",
      "text": "Otherworld Groves are lush, overgrown caves, with $(item)Otherworld Trees$(), and walls of $(item)Otherstone$(), and represent the fastest way to get everything one needs to get set up as a summoner. To find them, attune your divination rod to Otherworld leaves or logs, as unlike Otherstone, they only spawn in these groves."
    },
    {
      "type": "text",
      "title": "Otherworld Trees",
      "text": "Otherworld trees grow naturally in Otherworld Groves. To the naked eye they appear as oak trees, but to the Third Eye they reveal their true nature. $(bold)Important:$() Otherworld Saplings can only be obtained by breaking the leaves manually, naturally only oak saplings drop. Trees grown from Stable Otherworld Saplings as obtained from spirit traders do not have that limitation."
    }
  ]
}