{
  "name": "Next Steps",
  "icon": "occultism:chalk_purple",
  "category": "occultism:getting_started",
  "sortnum": 5,
  "pages": [
    {
      "type": "text",
      "text": "Now that you have successfully summoned your first spirit it's time to look at your next steps as a magician and start to plan for the long term."

    },
    {
      "type": "text",
      "title": "Craft Golden Chalk",
      "text": "Obtain gold dust and glowstone dust and craft golden chalk for infusion and possession rituals."
    },
    {
      "type": "text",
      "title": "Craft Otherworld Goggles",
      "text": "Prevent an Demon's Dream addiction by switching to $(l:rituals/crafting/craft_otherworld_goggles)Otherworld Goggles$(/l) for Third Eye vision. Additional benefit: You can now see higher tier Otherworld materials such as ores."
    },
    {
      "type": "text",
      "title": "Infuse Pickaxe",
      "text": "$(l:rituals/crafting/craft_infused_pickaxe)Infuse a pickaxe$(/l) to harvest Otherworld ores. The logical next step is to craft an $(item)Iesnium Pickaxe$() for the same effect, but with a higher durability. See more on $(l:misc/iesnium)Iesnium$(/l)."
    },
    {
      "type": "text",
      "title": "Summon Familiars",
      "text": "$(l:rituals/familiars/familiars)Familiars$(/l) provide a variety of bonus effects, such as feather falling, water breathing, jump boosts and more. Store them in $(l:rituals/crafting/craft_familiar_ring)Familiar Rings$() to equip them as a curio."
    },
    {
      "type": "text",
      "title": "Summon Possessed Mobs",
      "text": "Possessed mobs are controlled by spirits, allowing the summoner to determine some of their properties. They usually have high drop rates for rare drops, but are generally harder to kill. Start by summoning a $(thing)Possessed Endermite$() to obtain endstone to craft purple chalk."
    },
    {
      "type": "text",
      "title": "Dimensional Storage",
      "text": "Among the advanced uses of spirits is the controlled creation and interaction with dimensions, which allow to store great amounts of items. Start by infusing a dimensional matrix and go from there. Now the sky is the limit - use stable wormholes as additional access points, storage accessors to remotely access your items and create storage stabilizers to maximize available space."
    },
    {
      "type": "text",
      "title": "Autocrafting",
      "text": "The final step for ultimate comfort is to summon machine operator Djinni to manage furnaces and other machines for you. Their book of calling allows to set their managed machine and home storage system, then you can give orders using the storage system GUI."
    },
    {
      "type": "text",
      "title": "Automated Mining",
      "text": "The $(l:rituals/crafting/craft_dimensional_mineshaft)Dimensional Mineshaft$(/l) allows automated mining in a void dimension. The type of spirit and it's concrete instructions determine the mining speed, amount and resulting items. In theory at least, it is possible to obtain any block or item that exists in the real world from the mining dimension."
    },
    {
      "type": "empty",
      "draw_filler": false
    }
  ]
}