{
  "name": "Nature's Records",
  "category": "hexcasting:patterns",
  "icon": "minecraft:glow_ink_sac",
  "advancement": "hexcasting:enlightenment",
  "pages": [
    "My studies have led me to understand the fabric undermining every facet of this world. Nature's memory manifests itself as a recursive structure of 'tags' of several types. I've documented these over the next few pages. Though many types of tag appear to be redundant with each other, I must keep in mind that they are not freely interchangeable — and since I am dealing directly with Nature's memories, such a mistake could be worse than fatal.",
    "If everything in the world is merely reduced to a tag... what am I? Is my entire existence reducible to a pile of bytes? At least this gives me some comfort, knowing that the villagers I've sacrificed in my journey truly had no life of their own... what about mine? What am I? Were the words I am writing in this very book, just a manifestation of random ones and zeroes?$(2br)I best not ponder too much. Though I may pry into everything I wish in detail, doing so would suck the joy from this illusion.",
    {
      "type": "hexcasting:pattern",
      "anchor": "hexic:nbt/lift1",
      "op_id": "hexic:nbt/lift1",
      "input": "number",
      "output": "nbt",
      "text": "Converts a number into a Byte tag: an integer between -128 and 127, inclusive."
    },
    {
      "type": "hexcasting:pattern",
      "anchor": "hexic:nbt/lift2",
      "op_id": "hexic:nbt/lift2",
      "input": "number",
      "output": "nbt",
      "text": "Converts a number into a Short tag, between -65536 and 65535."
    },
    {
      "type": "hexcasting:pattern",
      "anchor": "hexic:nbt/lift4",
      "op_id": "hexic:nbt/lift4",
      "input": "number",
      "output": "nbt",
      "text": "Converts a number into an Int tag, between roughly negative 2 billion and positive 2 billion."
    },
    {
      "type": "hexcasting:pattern",
      "anchor": "hexic:nbt/lift8",
      "op_id": "hexic:nbt/lift8",
      "input": "number",
      "output": "nbt",
      "text": "Converts a number into a Long tag: bounded to 9 quintillion, which I will likely never reach."
    },
    {
      "type": "hexcasting:pattern",
      "anchor": "hexic:nbt/liftd",
      "op_id": "hexic:nbt/liftd",
      "input": "number",
      "output": "nbt",
      "text": "Converts a number into a Double tag. Oddly, doubles seem to perfectly correspond to my knowledge of numbers, plus the ability to represent infinities and non-numbers."
    },
    {
      "type": "hexcasting:pattern",
      "anchor": "hexic:nbt/liftf",
      "op_id": "hexic:nbt/liftf",
      "input": "number",
      "output": "nbt",
      "text": "Converts a number into a Float tag. These seem similar to Doubles, albeit with less precision."
    }
  ]
}
