{
	"_commenteffect": "text for the effect group.",
	"adamsarsplus.glyph_name.glyph_aoe_three": 			"AOE III",
	"adamsarsplus.glyph_desc.glyph_aoe_three": 			"Spells will affect a gargantuan area around a targeted block.",
	"adamsarsplus.glyph_name.glyph_aoe_two": 			"AOE II",
	"adamsarsplus.glyph_desc.glyph_aoe_two": 			"Spells will affect a huge area around a targeted block.",

	"adamsarsplus.glyph_name.glyph_accelerate_three": 	"Accelerate III",
	"adamsarsplus.glyph_desc.glyph_accelerate_three": 	"Immensely increases the speed of projectile spells.",
	"adamsarsplus.glyph_name.glyph_accelerate_two": 	"Accelerate II",
	"adamsarsplus.glyph_desc.glyph_accelerate_two": 	"Greatly increases the speed of projectile spells.",

	"adamsarsplus.glyph_name.glyph_extendtime_three": 	"Extend Time III",
	"adamsarsplus.glyph_desc.glyph_extendtime_three": 	"Immensely extends the time that spells last.",
	"adamsarsplus.glyph_name.glyph_extendtime_two": 	"Extend Time II",
	"adamsarsplus.glyph_desc.glyph_extendtime_two": 	"Greatly extends the time that spells last.",

	"adamsarsplus.glyph_name.glyph_spellefficiency": 	"Spell Efficiency",
	"adamsarsplus.glyph_desc.glyph_spellefficiency": 	"Uses a glyph slot to reduce the mana cost of a spell. New Cost = Old Cost * 0.7 ^ X",

	"adamsarsplus.glyph_name.glyph_effectdomain": 		"Domain",
	"adamsarsplus.glyph_desc.glyph_effectdomain": 		"Creates a Sphereical area that applies spells on nearby entities for a short time. Applying Sensitive will make this spell target blocks instead. AOE will expand the effective range, Accelerate will cast spells faster, Dampen will cause the domain to target the outer blocks of the domain if used with sensitive the domain will only target the outer blocks, Extend Time will increase the duration, Pierce changes the shape of the area to a dome, Extract excludes the caster from target-able entities.",

	"adamsarsplus.glyph_name.glyph_effectlimitless": 	"Limitless",
	"adamsarsplus.glyph_desc.glyph_effectlimitless": 	"Sets the velocity of entities in an area to 0 (includes spell projectiles and other entities not normally target-able). Applying AOE will increase the radius this effect is applied. Augmenting with Amplify will multiply the velocity by: -X/3. Augmenting with Dampen will multiply the velocity by: -1. Augmenting with sensitive will affect the caster as well",

	"adamsarsplus.glyph_name.glyph_effectswaptarget": 	"Swap Target",
	"adamsarsplus.glyph_desc.glyph_effectswaptarget": 	"Swaps the roles of the caster and target, allowing for more complex logic. (From ArsOmega, will remove once ArsOmega is updated to 1.20.1)",

	"item.adamsarsplus.mana_diamond": 	"Mana Diamond",

	"effect.adamsarsplus.limitless": "Limitless"
}