{
  "name": "Gun Types",
  "icon": "terramity:pump_action_shotgun",
  "category": "terramity:guns",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "There are many different gun types in Terramity.$(br2)The guns in Terramity vary a lot in their function and purpose. They range from miniguns, shotguns, and even railguns."
    },
    {
      "type": "patchouli:spotlight",
      "text": "Handguns in Terramity usually have a lot of ammo per magazine, deal solid damage, and sometimes can be one-handed, allowing for use of a melee weapon and a gun at the same time.",
	  "item": {
		"item": "terramity:basic_pistol"
	  }
    },
	{
      "type": "patchouli:spotlight",
      "text": "Semi-Automatic Rifles in Terramity have long range, fire at a decent rate, and deal solid damage.",
	  "item": {
		"item": "terramity:basic_rifle"
	  }
    },
	{
      "type": "patchouli:spotlight",
      "text": "Sniper rifles in Terramity have incredibly long range, low bullet drop, deal high damage, but are sometimes costly on ammunition and take a while to reload.",
	  "item": {
		"item": "terramity:elite_rifle"
	  }
    },
	{
      "type": "patchouli:spotlight",
      "text": "Automatic guns in Terramity have solid range and deal tons of damage, but may be inaccurate and/or expensive to fire.",
	  "item": {
		"item": "terramity:advanced_automatic_rifle"
	  }
    },
	{
      "type": "patchouli:spotlight",
      "text": "Shotguns in Terramity are very powerful, deal loads of knockback, but have poor range.",
	  "item": {
		"item": "terramity:pump_action_shotgun"
	  }
    },
	{
      "type": "patchouli:spotlight",
      "text": "Railguns in Terramity are extraordinarily powerful, are hitscan, and don't use any ammunition. Railguns use a cooldown system unlike regular guns, so having one on hand at all times in case of emergency may be a good idea.",
	  "item": {
		"item": "terramity:railgun"
	  }
    },
	{
      "type": "patchouli:spotlight",
      "text": "Rocket launchers in Terramity are good for destruction and clearing out large waves of enemies at once when you aren't concerned about the terrain you're firing at.",
	  "item": {
		"item": "terramity:rocket_launcher"
	  }
    },
	{
      "type": "patchouli:spotlight",
      "text": "There are some guns that may not fall into any specific category, but still function as guns.",
	  "item": {
		"item": "terramity:flare_gun"
	  }
    }
  ]
}