{
	"scryglass.page.scryglass.title": "Viewforming",
	"scryglass.page.scryglass.0": "I can use _Hexcasting to conjure small strands of visible _media just before my eyes using a family of spells called the oculus spells. The small strand of _media—called an $(thing)Icon$()—dissolves in just about a second after conjuration, but if I had some method to automatically cast a _Hex, I could permanently augment my own vision to suit my needs.",
	"scryglass.page.scryglass.1": "All oculus spells take an integer henceforth referred to as an index, which will be used to refer to and distinguish $(thing)Icons$(). Using a used index in an oculus spell will destroy the old $(thing)Icon$() and reassign it to the new one.$(br2)$(o)Virtual instruments spread out in front of her like playing cards show her relative position and velocity, her airspeed and orientation, her oxygen levels, mana levels, and her degree of concentration.$()",
	"scryglass.page.scryglass.2": "I can imagine the position vector for an oculus spell as the zero vector at the center of my vision. As I increase the x and y components, the position travels rightwards and downwards respectively. $(l:scryglass#scryglass:get_window_size)$(action)Periphery Reflection$() determines the boundaries of my vision; half of it will place my text on the peripherals of what is visible to me.",
	"hexcasting.action.scryglass:get_window_size": "Periphery Reflection",
	"scryglass.page.get_window_size.summary": "Pushes a vector whose respective components are the width and height of my vision, and the breadth of my vision in radians.",
	"hexcasting.action.scryglass:get_icons": "Icons Reflection",
	"scryglass.page.get_icons.summary": "Pushes a list of the indices of all the $(thing)Icons$() I have. This appears as a list of numbers.",
	"hexcasting.action.scryglass:remove_icon": "Clear Icon",
	"scryglass.page.remove_icon.summary": "Immediately clears an $(thing)Icon$().",
	"scryglass.page.scryglass.3": "Some oculus spells also want a color, which is taken as a vector where the components correspond to red, green, and blueness of an intended color, ranging from 0 to 1.",
	"hexcasting.action.scryglass:draw_text": "Draw Text",
	"scryglass.page.draw_text.summary": "Takes an index, a position, a number, and any iota. Conjures an $(thing)Icon$() displaying that iota.",
	"scryglass.page.draw_text.description": "The number determines the mode of text justification. 0 centers the text at the position given, 1 aligns the left side to the position given, and 2 aligns the right side to the position given.",
	"hexcasting.action.scryglass:rotate_icon": "Rotate Icon",
	"scryglass.page.rotate_icon.summary": "Takes an index and an amount of rotation counterclockwise in terms of a full circle. Rotates the icon.",
	"hexcasting.action.scryglass:scale_icon": "Scale Icon",
	"scryglass.page.scale_icon.summary": "Takes an index and a scaling factor. Scales the icon.",
	"hexcasting.action.scryglass:draw_rect": "Draw Rectangle",
	"scryglass.page.draw_rect.summary": "Takes an index, a position, a size, and a color. Conjures an $(thing)Icon$() displaying that rectangle.",
	"hexcasting.action.scryglass:draw_line": "Draw Line",
	"scryglass.page.draw_line.summary": "Takes an index, a position, a size, and a color. Conjures an $(thing)Icon$() that joins between the two with a thin line."
}
