[
  "At the moment, the mechanics of the E-Scanner, which I found in a structure from the Unreachable, is a big secret to me. But by trying to modify the device, I have found some interesting features which are not available on the handheld device.",
  "I named my new construct the \"Scanner\", with this machine I can analyze and improve my technologies. To do this I need an Item I have researched and a little patience. The technology I modified from the Unreachable helps me develop and bring to life the possibilities, but I myself must choose the basic aspects I want to build upon.",
  "Once I have created an implementable idea, the result will be printable as a Blueprint. This allows me to improve the related technology.",
  "Crafting:",
  {
    "link": "futurepack:lang/part/crafting_scanner.json"
  },
  "Hint: Read the information at \"The Research System\" first.",
  "Usage in detail:",
  "I must first put the Item I want to examine in the top left slot. The yellow bars below it show me how many Research concepts are still available with this Item (this is shown as relative to the total number).",
  "In the right area, the 12 Aspects are displayed as buttons. To develop a new Blueprint, I must select 1 to 6 Aspects.",
  "Then, in the center screen, a \"Scan\" button appears, which I can use to verify the chosen combination. After an animation, one of the following outputs will be shown:",
  "Puzzle pieces: The current selection is correct, but more aspects must be selected.",
  "Golden star: Research was successful. A Blueprint can be taken.",
  "Yellow X: One (or more) of the chosen aspects is wrong.",
  "Red X: This Item cannot be researched.",
  "Green checkmark: All researches for this Item have been found.",
  "Yellow question mark: There are more Researches available with this Item, but some game conditions are not yet met. Try again once you have discovered more.",
  "",
  "Hint: A Blueprint will be created once this research is completed in the Researcher and only then. But be aware that it is possible for research to not generate a Blueprint, but a concept to further the Tech Tree.",
  "Hint: To the left of the Blueprint slot is a button to open the Tech Tree."
]