{
  "name": "荒野魔法之历史",
  "icon": "roots:fey_fire",
  "category": "concepts",
  "read_by_default": true,
  "pages": [
    {
      "type": "text",
      "text": "Wild Magic is found in the wilderness.  It is in the trees and the stones and the water, bountiful even in the seemingly mundane. Great power can be unlocked through even the simplest catalyst.  This is the foundation of Wild Magic.$(br2)Over time, a group of like-minded individuals, well-versed in harnessing wild magic gathered together and formed a concord."
    },
    {
      "type": "text",
      "text": "This became known as the Order of Druids, and for untold centuries they were the foremost authorities on nature and wild magic.$(br2)Most notably, they formed treaties with other worlds, including that of the Fey, which would become significant in the latter Druid period.$(br2)Despite their long years of experience, or perhaps because of it, the Druids became decadent, seeking more and more power."
    },
    {
      "type": "text",
      "text": "As the Druids became more obsessed with the power of the Fey, they began to forget their own roots, some giving up on wild magic almost entirely.$(br2)Although the exact details are unclear, it was likely this obsession that signalled the end of the treaty with the Fey.$(br2)All portals were closed, all trade ceased, and the Order of Druids was left a skeleton, scrambling to re-learn what once they had mastered."
    },
    {
      "type": "text",
      "text": "Those who survived the severing and its aftermath (and many did not, rendered utterly incapable of existence without the power of the Fey) sought to bolster the Order of Druids - but it was far too late.$(br2)Many left the ranks, delving deeper into the arcane, while others still performed ghastly rituals involving the essence of their own lives.$(br2)There was a small renaissance, where $(l:concepts/groves)Grove Stones$() were invented."
    },
    {
      "type": "text",
      "text": "This was the last great discovery of the Order, its creators had hoped to use it to magnify the power of nature and replicate parts of the Fey in their own world.$(br2)Unfortunately, they were too few and too scattered, and thus the Order of Druids faded into history and was forgotten.$(br2)In our day, this tome provides everything needed to master what they forsook.$(br2)$(br2)But most importantly: learn"
    },
    {
      "type": "text",
      "text": "from their mistakes! Do not fall prey to hubris, and do not allow power to corrupt you.$(br2)At its core, wild magic is found solely in our world. Its essence laces everything: even the most mundane thing can contain within it great power or great potential."
    }
  ]
}