{
  "name": "Bounty",
  "icon": "srpcotesia:bounty",
  "category": "threat",
  "priority": true,
  "flag": "srpcotesia:bounty",
  "pages": [
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:bounty",
      "text": "$(#630000)Elaborating on the $(l:threat/discovery)Discovery System$()$(#630000), Enhanced Mobs are capable of placing Bounties once they learn of my existence."
    },
    {
      "type": "text",
      "text": "$(#630000)Bounties are block-sized computers that keep track of known Vagrants (me, for instance, and if you bothered to read this section, likely you as well), placed whenever an Enhanced Mob is left alone after learning too much."
    },
    {
      "type": "text",
      "text": "$(#630000)ANY Enhanced Mob can place them, from Chickens and other animals to the Wither. I cannot stress enough how important it is to kill the ones that discover you.$(br)The Bounty itself should be reason enough; any Enhanced Mobs within range of it will automatically know about any Vagrants it has stored, so they will attack on sight."
    },
    {
      "type": "text",
      "text": "$(#630000)Some have even taken the extra effort to hunt me down using Motes, regardless of sight. Thankfully, Bounties are not shy and will make harrowing sounds as they function. It sounds a bit like two bell chimes."
    },
    {
      "type": "text",
      "text": "$(#630000)Their only weakness is the fact that I had to be there to get it created. In other words, Bounties are almost always created in areas I've been, so I know to check the general area whenever one is created. Once I destroy it, I won't need to worry about any new Bounties being placed; The Enhanced Mobs stay quiet once they are informed by one, and won't place another."
    },
    {
      "type": "spotlight",
      "link_recipe": false,
      "item": "srpcotesia:electroreceptor",
      "text": "$(#630000)If all else fails, an $(l:items/electroreceptor)Electroreceptor$()$(#630000) can reveal its coordinates if used on an Enhanced Mob. This should only be used as a last resort, however, since it will likely take many uses to get all three."
    }
  ]
}