{
  "name": "Enhanced Mobs",
  "icon": "srpcotesia:remnant",
  "category": "threat",
  "priority": true,
  "flag": "srpcotesia:enhanced_mobs",
  "pages": [
    {
      "type": "text",
      "text": "$(#630000)Across my travels, I have come across mobs which appear to be immune to Call of the Hive. They also turn blue when I strike them.$(br)$()[The following information is based on the default settings of the mod]"
    },
    {
      "type": "text",
      "flag": "srpcotesia:ante",
      "text": "$(#630000)They appear to react the most to $(l:threat/ante)Ante$()$(#630000). As a result, I have catalogued what new abilities they gained from each Ante value as I reached them. A Tally Counter can be used to keep track of the current value."
    },
    {
      "type": "text",
      "flag": "!srpcotesia:ante",
      "text": "[You have Ante disabled, so none of the following milestones apply. All mechanics are active]"
    },
    {
      "type": "text",
      "text": "$(#630000)- At Ante 1, they began 'Parrying' parasites I did not create. This has a detrimental stunning effect, and makes them invincible for a short time. They also run faster than other mobs."
    },
    {
      "type": "text",
      "text": "$(#630000)- At Ante 2, they started summoning $(l:threat/mote)Motes$()$(#630000) to chase me. They also started dealing Critical Hits, substantially increasing their damage and wiping out groups."
    },
    {
      "type": "text",
      "text": "$(#630000)- On Ante 3, they started healing if the damage I or other parasites dealt was too low, and started to resist potion effects with high amplifiers. I think they started to converse with each other as well.$(br)-At Ante 4, they started constructing $(l:threat/bounty)Bounties$()$(#630000) to hunt me down specifically."
    },
    {
      "type": "text",
      "text": "$(#630000)- Ante 5 was especially bad. Up until now armor was able to fend them off, but $(l:potions/yielding)they started using a new potion effect to nullify it.$()$(#630000)They also became much stronger in practically every metric."
    },
    {
      "type": "text",
      "text": "$(#630000)- Ante 6 was a reminder that Motes, up until then, usually dealt no damage (excluding bosses like the Wither). Now if that potion effect is active, they'll deal some armor-piercing damage as well. The mobs also increased the amount they create."
    },
    {
      "type": "text",
      "text": "$(#630000)- The next few milestones just made things worse and worse, the Motes deal standard damage alongside their armor piercing, the Critical Hits are all I see now, I can't heal after they hit me, and [DISABLED] I get a nasty sunburn whenever I go out during daytime."
    },
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:frayed_wires",
      "text": "$(#630000)Upon death, they will usually drop Frayed Wires, despite the fact that most of them are organic. Regardless, it makes a useful crafting component."
    },
    {
      "type": "text",
      "text": "$(#630000)The energy contained inside the wires can be converted to Evolution Points rather easily. Makes me wonder where that energy came from..."
    },
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:remnant",
      "text": "$(#630000)Ante 5 also brought a new drop I had never seen before: A Remnant. These discs can be used in a $(l:threat/lithograph)Lithograph$()$(#630000) to create items that I can use to fight them off. It appears only hostile mobs can drop them, however.$(br2)Given the motif, I'm under the assumption that I'm dealing with some kind of machine."
    },
    {
      "type": "text",
      "flag": "srpcotesia:timer",
      "text": "$(#630000)I'm also beginning to see more of them than usual. It would be safe to say something brought them here, and is continuing to do so."
    }
  ]
}