{
  "name": "Creeping Salt",
  "icon": "srpcotesia:salted_tendril",
  "category": "threat",
  "flag": "srpcotesia:salt",
  "pages": [
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:salted_earth",
      "text": "$(#630000)There's something almost morbidly beautiful about watching my life fall apart slowly, you know. Almost. I did NOT need a spreading biome to deal with."
    },
    {
      "type": "text",
      "text": "$(#630000)Rarely when a mob dies from the phenomena in this book category, a Saltine may be placed on the ground, emitting a haunting chime that can be heard from many blocks away. This block will unleash Creeping Salt, a strange 'affliction' which converts parasitic blocks into Salted Blocks. These are extremely dangerous."
    },
    {
      "flag": "srpcotesia:saltine",
      "type": "text",
      "text": "$(#630000)The blocks won't spread very far at the start. In order for that to occur, the Saltine must become a Graduate Saltine. This can occur randomly, and only if there isn't already another one in range. Once one is placed, the blocks will spread without abandon until it is destroyed. If enough of these emerge, their range becomes effectively infinite."
    },
    {
      "type": "text",
      "text": "$(#630000)Not only can they apply $(l:potions/trauma)Trauma$()$(#630000) and $(l:potions/clotting)Clotting$()$(#630000) on contact, but they hurt like hell to touch as well. The only consolation is that the pest doesn't seem to want to touch normal blocks."
    },
    {
      "type": "text",
      "flag": "srpcotesia:enhanced_mobs",
      "text": "$(#630000)Any Enhanced Mobs that spawn near the blocks will have their capabilities boosted greatly, to the point that abilities they would normally take many days to achieve are granted instantly. In other words, the blocks will grant Day 50's abilities."
    },
    {
      "type": "text",
      "text": "$(#630000)100 Evolution Points will be lost whenever a block is converted. For especially important blocks, like Nodes, Colonies, and the Parasite Biome itself, the points lost can be in the MILLIONS and THOUSANDS, respectively."
    },
    {
      "type": "text",
      "text": "$(#630000)Moreover, the salt has its own analogue of the Parasite Biome it will unleash upon contact, its own natural, horrid conclusion, filled with an unnerving grey haze. Expect the normal dangers of the salt blocks, but much, much worse.$(br)It even has the gall to taunt us by replanting pale flora in its wake."
    },
    {
      "type": "spotlight",
      "link_recipe": false,
      "item": "srpcotesia:clutch",
      "text": "$(#630000)The only reasonable response is explosives. The Clutch will destroy those foul blocks when it detonates. Simple.$(br)It's about all the salt deserves."
    },
    {
      "type": "spotlight",
      "link_recipe": true,
      "item": "srpcotesia:ruinous_salt",
      "text": "$(#630000)Crafting it is not as simple, though. Samples of the stuff, Ruinous Salt, are needed for the recipe. You can imagine what happens when you take a piece of it and put it in your inventory. The answer is agonizing pain and a chalky bruise that wasn't there before."
    },
    {
      "type": "crafting",
      "recipe": "srpcotesia:clutch"
    },
    {
      "type": "spotlight",
      "flag": "srpcotesia:saltine",
      "link_recipe": true,
      "item": "srpcotesia:salt_compass",
      "text": "$(#630000)If a Graduate Saltine is active for long enough to pose a serious problem, there is a foolproof way to find it (other than the lightning strikes). The Salt Compass will point towards it without fail.$(br)It's made from the salt, though, so it's nowhere near safe to hold. Still better than not knowing at all."
    },
    {
      "type": "crafting",
      "recipe": "srpcotesia:salt_compass"
    }
  ]
}