{
  "name": "Wells",
  "icon": "srpcotesia:well_sealer",
  "category": "threat",
  "flag": "srpcotesia:well",
  "pages": [
    {
      "type": "text",
      "text": "$(#630000)I heard a reverse bell sound today. I'm not even going to entertain the possibility that THING wasn't involved."
    },
    {
      "type": "text",
      "text": "$(#630000)I'm not going to go quietly, none of us are. Given its penchant for ignition, I tried to create a copy of the Vagrant Divining Rod in the hopes that it could detect its presence. While I was unsuccessful, I did end up making something which could turn the tide."
    },
    {
      "type": "spotlight",
      "item": "srpcotesia:well_divining_rod",
      "link_recipe": true,
      "text": "$(#630000)While it doesn't push IT back, it can detect what I've referred to as Wells, nigh-unnoticeable spatial disturbances that have been stealing Evolution Points covertly. They have been forming far and wide in practically every dimension, and I've had to travel large distances using this tool just to even find them."
    },
    {
      "type": "crafting",
      "recipe": "srpcotesia:well_divining_rod",
      "text": "$(#630000)It'll emit a spark in the direction of the nearest Well, much like an Eye of Ender. It'll even notify me of what dimension its in, if I'm not in the correct one."
    },
    {
      "type": "spotlight",
      "item": "srpcotesia:well_sealer",
      "link_recipe": true,
      "text": "$(#630000)I've also created a device to destroy these Wells when I find them. It will take 10 to fully destroy it. Whenever I do destroy one, though, I can feel that ominous presence get a little weaker each time."
    },
    {
      "type": "crafting",
      "recipe": "srpcotesia:well_sealer",
      "text": "$(#630000)I have to use it within 10 blocks of the Well. It appears elevation is irrelevant, so I can use it at any altitude."
    },
    {
      "type": "crafting",
      "recipe": "srpcotesia:well_sealer_chip",
      "text": "$(#630000)I can also use Callous Chips to create the sealers instead of Diamond Blocks."
    },
    {
      "type": "text",
      "text": "$(#630000)With that in mind, I'll need to develop a more permanent solution in the future if I want to deal with this issue permanently."
    }
  ]
}