{
    "name": "Aura Plants",
    "icon": "naturesaura:aura_bloom",
    "category": "practices",
    "pages": [
        {
            "type": "text",
            "text": "A natural occurence that helped the discovery of $(aura) are certain kinds of vegetation that appear almost everywhere in the world. These plants are known to cause the area around them to naturally contain a higher concentration of $(aura) when they first grow. Additionally, all of these plants fit perfectly into $(item)Flower Pots$(), serving as a nice decoration."
        },
        {
            "type": "spotlight",
            "item": "naturesaura:aura_bloom",
            "link_recipe": true,
            "text": "The $(item)Aura Bloom$() grows in any kind of area where there is $(thing)grass$() to be found, usually in small patches. Finding areas like these can be espeically useful when first starting out with $(aura), since it is much less destructive for the environment to collect $(aura) using the $(l:practices/aura_bottle)Bottle and Cork$() here."
        },
        {
            "type": "spotlight",
            "item": "naturesaura:aura_cactus",
            "link_recipe": true,
            "text": "The $(item)Aura Cactus$() grows in deserted areas of any color, as well as $(thing)mesa$() regions. Since these areas are usually fairly barren with not many plants to be found, these can be a good starting point."
        },
        {
            "type": "spotlight",
            "item": "naturesaura:aura_mushroom",
            "link_recipe": true,
            "text": "The $(item)Aura Mushroom$() is found on mycelium-infested islands, where it appears alongside giant mushrooms and bright red cows. In these regions, it causes beautiful purple aura particles to rise from the ground."
        },
        {
            "type": "spotlight",
            "item": "naturesaura:crimson_aura_mushroom",
            "link_recipe": true,
            "text": "The $(item)Crimson$() and $(item)Warped Aura Mushrooms$() can be found in the forested regions of $(thing)the nether$(), where they sprout alongside their aura-less counterparts. When starting out as a magical botanist in these hellish regions, they can prove especially beneficial."
        }
    ]
}