{
  "lexicon.category.mythicbotany.alfheim.description": "Everything about the Alfheim dimension",
  "lexicon.category.mythicbotany.alfheim.name": "Alfheim",
  "lexicon.category.mythicbotany.mythic_botany.description": "Dive deeper into the world of magic",
  "lexicon.category.mythicbotany.mythic_botany.name": "MythicBotany",
  "lexicon.entry.mythicbotany.alfheim.alfheim_landscape": "Alfheim Landscape",
  "lexicon.entry.mythicbotany.alfheim.alfheim_landscape.page0.text0": "In Alfheim you can find some dreamwood trees everywhere. Also abandoned petal apothecaries are found throughout the world. They sometimes even contain a few petals. Alfheim is rich of animals but when it gets dark you\u0027ll need to face hordes of witches and illusioners.",
  "lexicon.entry.mythicbotany.alfheim.alfheim_landscape.page1.text0": "Mana Crystals",
  "lexicon.entry.mythicbotany.alfheim.alfheim_landscape.page1.text1": "On the hills in Alfheim mana crystals may spawn. They\u0027re made out of bifrost blocks and contain a bit of mana.",
  "lexicon.entry.mythicbotany.alfheim.alfheim_landscape.page2.text0": "Dreamwood Forest",
  "lexicon.entry.mythicbotany.alfheim.alfheim_landscape.page2.text1": "In a dreamwood forest dreamwood trees are found more densely.",
  "lexicon.entry.mythicbotany.alfheim.alfheim_landscape.page3.text0": "Golden Fields",
  "lexicon.entry.mythicbotany.alfheim.alfheim_landscape.page3.text1": "In the golden fields biome you can find much more gold ore and occasionally an Andwari Cave.",
  "lexicon.entry.mythicbotany.alfheim.alfheim_resources": "Resources of Alfheim",
  "lexicon.entry.mythicbotany.alfheim.alfheim_resources.page0.text0": "Dream cherries are dropped by Dreamwood Leaves. Those leaves generate on Dreamwood trees all throughout Alfheim. Eating a dream cherry will give you a big saturation boost, which means it takes much longer before your hunger goes down again.",
  "lexicon.entry.mythicbotany.alfheim.alfheim_resources.page1.text0": "Trading for Dreamwood Leaves.",
  "lexicon.entry.mythicbotany.alfheim.alfheim_resources.page2.text0": "Elementium Ore can be found underground roughly on the same levels as iron in the overworld. In Alfheim, where the magic is much more present than in the overworld, the raw materials are naturally generated. There\u0027s no need to infuse them with mana.",
  "lexicon.entry.mythicbotany.alfheim.alfheim_resources.page3.text0": "Dragonstone Ore is also found in Alfheim but way lower than Elementium. Just like diamonds there\u0027s no need to smelt the ore, it\u0027ll drop Dragonstone directly.",
  "lexicon.entry.mythicbotany.alfheim.alfheim_resources.page4.text0": "Gold, as the material of the gods, can also be found in Alfheim. In the Golden Fields biome you can find way much more gold than usual.",
  "lexicon.entry.mythicbotany.alfheim.alfheim_resources.page5.text0": "Pixies fly in the air of Alfheim. They\u0027ll drop Pixie Dust on death.",
  "lexicon.entry.mythicbotany.alfheim.andwari": "Ring of Andwari",
  "lexicon.entry.mythicbotany.alfheim.andwari.page0.text0": "Andwari was a dwarf that lived in a cave in Alfheim. He owned a big gold treasure and a ring to multiply his treasure. When Loki wanted to steal that treasure, Andwari put a curse on his ring to prevent it from being used. However, you think you have found a way to temporarily remove the curse and make the ring work again. If cou could only find the ring...",
  "lexicon.entry.mythicbotany.alfheim.andwari.page1.text0": "Andwari Cave",
  "lexicon.entry.mythicbotany.alfheim.andwari.page1.text1": "Andwari caves generate only in the Golden Fields biome.",
  "lexicon.entry.mythicbotany.alfheim.andwari.page3.text0": "After removing the curse you can use it for a time. Just place a gold block and get a reward. However, this requires some mana. The curse will also come back slowly. Make sure it never comes back",
  "lexicon.entry.mythicbotany.alfheim.andwari.page4.text0": "completely or it will consume huge amounts of mana and poison you.",
  "lexicon.entry.mythicbotany.alfheim.kvasir": "The Mead of Kvasir",
  "lexicon.entry.mythicbotany.alfheim.kvasir.page0.text0": "Kvasir was a dwarf formed by the gods after the Aesir made peace with the Vanir. He wandered through the nine worlds and was highly regarded everywhere. However, the two dwarves Fjalar and Galar wanted to steal Kvasirs\u0027 talents. So they killed him and mixed his blood with honey to form a mead. Drinking this mead will allow you to travel the worlds like Kvasir.",
  "lexicon.entry.mythicbotany.alfheim.kvasir.page1.text0": "After drinking the mead you\u0027ll be able to step in the Portal to Alfheim and travel to Alfheim yourself. If you accidentally break your portal in Alfheim you can fix the frame and throw a dragonstone or some pixie",
  "lexicon.entry.mythicbotany.alfheim.kvasir.page2.text0": "dust in. When it despawns, the portal will reopen.",
  "lexicon.entry.mythicbotany.alfheim.kvasir.page5.text0": "By using a wandering trader as a symbol for Kvasir you should be able to get blood to form the Mead of Kvasir.",
  "lexicon.entry.mythicbotany.mythic_botany.functional": "Functional Flora",
  "lexicon.entry.mythicbotany.mythic_botany.functional.page1.text0": "The Aquapanthus uses a very small amount of mana to fill nearby cauldrons and petal apothecaries with water. It can also fill some other fluid containers that are mostly unknown to the average botanist.",
  "lexicon.entry.mythicbotany.mythic_botany.functional.page3.text0": "The Exoblaze uses mana to fill the fuel of nearby brewing stands. Never put blaze powder in again when brewing your potions. Still a pretty primitive flower as powerful botanists have better devices that brewing stands...",
  "lexicon.entry.mythicbotany.mythic_botany.functional.page5.text0": "Piglins and Hoglins will transform int ozombies in the overworld. While the exact reason is not yet known, botanists have foudn a way to use mana to keep these creatures safe in the overworld. Any Piglins or Hoglins n the range of the flower won\u0027t zombify when outside of the nether, as lon gas the flower has sufficient mana.",
  "lexicon.entry.mythicbotany.mythic_botany.functional.page7.text0": "The Petrunia can activate rune rituals if provided with enough mana and placed near the central rune holder.",
  "lexicon.entry.mythicbotany.mythic_botany.generating": "Generating Flora",
  "lexicon.entry.mythicbotany.mythic_botany.generating.page1.text0": "The wither aconite uses up nether stars dropped on it to create mana from them. If the wither aconite can\u0027t use up the nether star after 5 minutes, it will despawn like any other item.",
  "lexicon.entry.mythicbotany.mythic_botany.generating.page3.text0": "The raindeletia produces mana when it\u0027s raining and even more mana when it\u0027s thundering. Planting it on vivid grass or enchanted soil makes it generate much more. On regular soil, it even is too weak to generate mana during normal rain.",
  "lexicon.entry.mythicbotany.mythic_botany.generating.page5.text0": "At some point in time your flowers will create mana that fast that spreaders are not enough to handle it. With the mana collector, you can put mana generated from flowers into the spark network directly. The mana collector acts as a little mana storage that can receive mana from flowers and interact with sparks. To extract the mana from the collector, you\u0027ll most likely need a recessive spark augment.",
  "lexicon.entry.mythicbotany.mythic_botany.infuser": "The Mana Infuser",
  "lexicon.entry.mythicbotany.mythic_botany.infuser.page0.text0": "The mana infuser is an upgraded version of the Terrestrial Agglomeration Plate that is also capable of creating other mana-alloys. Like the terrestrial agglomeration plate this requires a platform below. $(thing)However, this requires a dominant spark augment to pull mana from sparks.$()",
  "lexicon.entry.mythicbotany.mythic_botany.infuser.page1.text0": "Upgrading the terrestrial agglomeration plate to a mana infuser.",
  "lexicon.entry.mythicbotany.mythic_botany.infuser.page2.text0": "Mana Infuser",
  "lexicon.entry.mythicbotany.mythic_botany.infuser.page2.text1": "The platform required for the mana infuser to work.",
  "lexicon.entry.mythicbotany.mythic_botany.infuser.page3.text0": "Alfsteel is created like terrasteel but with resources from Alfheim. It requires much more mana but can be used to create various powerful things.",
  "lexicon.entry.mythicbotany.mythic_botany.manaband": "Alfsteel Mana Bands",
  "lexicon.entry.mythicbotany.mythic_botany.manaband.page0.text0": "By upgrading the Greater Band of Mana with some alfsteel in the smithing table, you get a new band of mana that is capable of holding about twice as much mana as before.",
  "lexicon.entry.mythicbotany.mythic_botany.manaband.page1.text0": "Just like the Greater Band of Mana you can also upgrade the Greater Band of Aura to produce mana at a much faster rate.",
  "lexicon.entry.mythicbotany.mythic_botany.mimir": "The well of Mimir",
  "lexicon.entry.mythicbotany.mythic_botany.mimir.page0.text0": "You\u0027ve already come in contact with the sacred tree Yggdrasil: The central block of the portal to Alfheim was a piece linked to it. By rearranging the recipe a bit, you think you have found a way to get an Branch of Yggdrasil that is capable of providing water drained from the roots of Yggdrasil if given a bit of mana. You know that Yggdrasil has its roots in the well of Mimir. And by",
  "lexicon.entry.mythicbotany.mythic_botany.mimir.page1.text0": "the legend it\u0027s told that Odin was able to perform powerful rune magic after drinking from said well. You think you can achieve this too.",
  "lexicon.entry.mythicbotany.mythic_botany.mimir.page2.text0": "However catching the water will need a special type of container.",
  "lexicon.entry.mythicbotany.mythic_botany.mimir.page3.text0": "Creating an empty Gjallarhorn",
  "lexicon.entry.mythicbotany.mythic_botany.mimir.page4.text0": "With a gjallarhorn, you are able to catch the water. For this, you need to place it in the branch. With a bit of mana, the gjallarhorn will fill up. Drinking from the full Gjallarhorn will provide you the knowledge to perform Rune Rituals.",
  "lexicon.entry.mythicbotany.mythic_botany.mjoellnir": "Mjoellnir",
  "lexicon.entry.mythicbotany.mythic_botany.mjoellnir.page0.text0": "Mjöllnir is the hammer of the God Thor. He throws it against the giants and other enemies to deal large amounts of damage. You think you can create a replica of Mjöllnir with a Rune Ritual and use it as a weapon. You can attack with Mjöllnir just like with any other weapon. However, the attack cooldown is very high. Using the Hammer Mobility Enchantment, the cooldown can be lowered. You",
  "lexicon.entry.mythicbotany.mythic_botany.mjoellnir.page1.text0": "can also throw Mjöllnir with a right click. If it hits an entity it causes a lightning strike and deals a lot of damage. However, the hammer is very heavy. As the gods get their powers from the golden apples of Idun, you\u0027ll need the absorption effect to hold mjöllnir. When the absorption effect runs out, the hammer will get placed in the world at your position. Having the ring of thor equipped will also allow you to hold mjöllnir. To manually",
  "lexicon.entry.mythicbotany.mythic_botany.mjoellnir.page2.text0": "place the hammer in the world, use a shift right click. To pick it up again do a right click on the placed hammer. Mjöllnir can be enchanted with most sword enchantments. They only affect the melee damage. It can also be enchanted with most bow enchantments. They only affect ranged attacks. It can also be anchanted with Loyalty, which makes it return faster after throwing it.",
  "lexicon.entry.mythicbotany.mythic_botany.mjoellnir.page5.text0": "Creating a replica of the legendary weapon Mjöllnir.",
  "lexicon.entry.mythicbotany.mythic_botany.pylons": "Alfsteel Pylons",
  "lexicon.entry.mythicbotany.mythic_botany.pylons.page0.text0": "Those pylons are required to craft the Gaia Pylon. They can also receive mana from spreaders and repair alfsteel tools and tools enchanted with mending that are thrown on top of it. When repairing alfsteel tools you pay less mana than when using a mana tablet in your inventory.",
  "lexicon.entry.mythicbotany.mythic_botany.rings": "Elemental Rings",
  "lexicon.entry.mythicbotany.mythic_botany.rings.page0.text0": "This ring makes you immune to all kind of fire damage and makes you ignite your enemy.",
  "lexicon.entry.mythicbotany.mythic_botany.rings.page1.text0": "Applies a very strong slowness effect to your enemy for a short time while making you immune to cramming and in-wall damage.",
  "lexicon.entry.mythicbotany.mythic_botany.rune_rituals": "Rune Ritauls",
  "lexicon.entry.mythicbotany.mythic_botany.rune_rituals.page0.text0": "Runes are way more powerful than most people think. However, to understand their full power, you must have drunk from the Well of Mimir. A rune ritual will require a shape of runes on the floor. To put runes on the floor, you need rune holders. A special type of rune holder is required for the central rune. You\u0027ll get back all the runes except the central one. The shape can be rotated and",
  "lexicon.entry.mythicbotany.mythic_botany.rune_rituals.page1.text0": "flipped but it must be all on the same Y-level. A ritual may also require specific ingredients that need to be thrown near the central rune holder. Some rituals also require mana. You can provide this through mana tablets and mana bands in your inventory. To start a ritual, right click the central rune holder with a Wand of the Forest. If a ritual gets interrupted it\u0027ll be reset and you\u0027ll get back everything except the mana you paid.",
  "lexicon.entry.mythicbotany.mythic_botany.rune_rituals.page3.text0": "The Rune tablet of Fimbultyr will be dropped when the Guardian of Gaia II is slain by a player who has acquired the Knowledge of Mimir. It is used as central rune in the most powerful rune rituals.",
  "lexicon.entry.mythicbotany.mythic_botany.runes": "Runes of the Nine Worlds",
  "lexicon.entry.mythicbotany.mythic_botany.runes.page0.text0": "You can create runes that represent the $(thing)Nine World$(0) in the $(item)Runic Altar$(0). They\u0027re tier 4 runes and require the Runes of the $(thing)Deadly sins$(0). Those new runes unleash great power but can be dangerous if not used correctly. Handle them with caution.",
  "lexicon.entry.mythicbotany.mythic_botany.runes.page1.text0": "Midgard is the world of the humans.",
  "lexicon.entry.mythicbotany.mythic_botany.runes.page2.text0": "Alfheim is the world of the elves.",
  "lexicon.entry.mythicbotany.mythic_botany.runes.page3.text0": "Nidavellir is the world of the dwarves.",
  "lexicon.entry.mythicbotany.mythic_botany.runes.page4.text0": "Jötunheim is the world of the giants.",
  "lexicon.entry.mythicbotany.mythic_botany.runes.page5.text0": "Muspelheim is the world of the fire giants.",
  "lexicon.entry.mythicbotany.mythic_botany.runes.page6.text0": "Niflheim is the world of the frost giants.",
  "lexicon.entry.mythicbotany.mythic_botany.runes.page7.text0": "Asgard is the world of the Aesir.",
  "lexicon.entry.mythicbotany.mythic_botany.runes.page8.text0": "Vanaheim is the world of the Vanir.",
  "lexicon.entry.mythicbotany.mythic_botany.runes.page9.text0": "Helheim is the world of the dead.",
  "lexicon.entry.mythicbotany.mythic_botany.tools": "Alfsteel Tools",
  "lexicon.entry.mythicbotany.mythic_botany.tools.page0.text0": "For a long time now you thought diamond was the best you could reach without the power of a botanist. Then came netherite. It\u0027s the same with terrasteel and alfsteel. So just like diamond you can upgrade terrasteel tools and armor to their alfsteel counterparts via smithing. This improvement however, comes with higher mana costs to use those tools.",
  "lexicon.entry.mythicbotany.mythic_botany.tools.page1.text0": "This sword does much more damage and you can swing it much faster.",
  "lexicon.entry.mythicbotany.mythic_botany.tools.page2.text0": "Despite being able to chop down whole trees in just seconds this axe can pull nearby items towards you when pressing shift and right-click.",
  "lexicon.entry.mythicbotany.mythic_botany.tools.page3.text0": "This pickaxe is able to area-mine even more blocks at once. It mines multiple blocks in the direction you\u0027re looking as well. (This only works horizontally to prevent fall damage when mining down)",
  "lexicon.entry.mythicbotany.mythic_botany.tools.page4.text0": "This helmet can get all ancient wills like the terrasteel but it also makes you reach further with your arms.",
  "lexicon.entry.mythicbotany.mythic_botany.tools.page5.text0": "The knockback resistance of this chestplate is as high as the knockback resistance of a full terrasteel armor set.",
  "lexicon.entry.mythicbotany.mythic_botany.tools.page6.text0": "This leggings drastically improves your walking speed.",
  "lexicon.entry.mythicbotany.mythic_botany.tools.page7.text0": "Those shoes make you jump much higher into the sky."
}
