{
  "advancement.assemblyline.crate.desc": "Make a Crate",
  "advancement.assemblyline.crate.title": "No More Chests",
  "advancement.assemblyline.detector.desc": "Make a Detector",
  "advancement.assemblyline.detector.title": "Always Watching",
  "advancement.assemblyline.root.desc": "Wow you made a conveyor belt",
  "advancement.assemblyline.root.title": "Assembly Line",
  "advancement.assemblyline.sorter.desc": "Make a Sorter Belt",
  "advancement.assemblyline.sorter.title": "Organizer",
  "block.assemblyline.autocrafter": "Autocrafter",
  "block.assemblyline.blockbreaker": "Block Breaker",
  "block.assemblyline.blockplacer": "Block Placer",
  "block.assemblyline.conveyorbelt": "Conveyor Belt",
  "block.assemblyline.crate": "Crate",
  "block.assemblyline.cratelarge": "Large Crate",
  "block.assemblyline.cratemedium": "Medium Crate",
  "block.assemblyline.detector": "Detector",
  "block.assemblyline.farmer": "Farmer",
  "block.assemblyline.mobgrinder": "Mob Grinder",
  "block.assemblyline.rancher": "Energized Rancher",
  "block.assemblyline.sorterbelt": "Sorter Belt",
  "container.autocrafter": "Autocrafter",
  "container.blockbreaker": "Block Breaker",
  "container.blockplacer": "Block Placer",
  "container.farmer": "Farmer",
  "container.mobgrinder": "Mob Grinder",
  "container.rancher": "Energized Rancher",
  "container.sorterbelt": "Sorter Belt",
  "gui.assemblyline.fullbonemeal": "Bone Full",
  "gui.assemblyline.hidearea": "Hide Area",
  "gui.assemblyline.ignoreempty": "Skip Empty",
  "gui.assemblyline.machine.usage": "Usage: %s",
  "gui.assemblyline.machine.voltage": "Voltage: %s",
  "gui.assemblyline.refillempty": "Refill Empty",
  "gui.assemblyline.regbonemeal": "Bone Once",
  "gui.assemblyline.renderarea": "Show Area",
  "guidebook.assemblyline.assemblyline": "Assembly Line",
  "guidebook.assemblyline.chapter.conveyers": "Conveyers",
  "guidebook.assemblyline.chapter.conveyers.diagonaldown": "Diagonal Down",
  "guidebook.assemblyline.chapter.conveyers.diagonalup": "Diagonal Up",
  "guidebook.assemblyline.chapter.conveyers.horizontal": "Horizontal",
  "guidebook.assemblyline.chapter.conveyers.l1": "Conveyor Belts provide a robust method for moving items between inventories. Requiring only 8 J/t or 160W at 120 V to run, they offer a valuable alternative to moving items manually. Furthermore, only one belt in a segment needs to have a cable attached, as it will distribute power to the other belts. Power is fed in from the bottom of the conveyor.",
  "guidebook.assemblyline.chapter.conveyers.l2": "The yellow arrows on the belt represents the direction items will be transfered. To load items onto a belt, you can either drop the item and the belt will pick it up, or the belt can extract items from an inventory. If a belt does not end in an inventory, then it will drop its items onto the ground. Conveyor Belts have 4 modes they can switch between by Right-Clicking a wrench on them. These are:",
  "guidebook.assemblyline.chapter.conveyers.l3": "These modes are pictured on the following pages. Note where the bounding boxes are:",
  "guidebook.assemblyline.chapter.conveyers.l4": "A specialized form of the Conveyer Belt is the Sorter Belt. As the name suggests, it is able to sort items that pass through it. The belt has an input at the front, with the other 3 sides being outputs. The GUI of the belt has 2 sets of 9 slots. Any item placed in a left slot will be output to the left of the input. Any item placed in a right slot will be output to the right of the of the input. Any other items not specified will be output to the back of the Sorter Belt. The Sorter also needs power to function, and has the same usage as a standard Conveyor Belt. This power can either be supplied to the bottom or from an adjacent belt with power.",
  "guidebook.assemblyline.chapter.conveyers.l5": "Another useful block is the Detector. The Detector will output a 15 redstone signal if an item on a Conveyer Belt passes in front of the green square of the Detector, or if an item is laying on the ground in front of said square.",
  "guidebook.assemblyline.chapter.conveyers.vertical": "Vertical",
  "guidebook.assemblyline.chapter.machines": "Machines",
  "guidebook.assemblyline.chapter.machines.blockbreaker": "The Block Breaker will break any block placed in front of it as long as it is minable with a pickaxe. Use the \"Show Area\" button to view the block it is mining. The progress bar counts down the break time left on the block that is being mined.",
  "guidebook.assemblyline.chapter.machines.blockplacer": "The Block Placer will place any block added to its inventory in front of it. Use the \"Show Area\" button to view the area it can place a block in. The progress bar counts down the time between block placements.",
  "guidebook.assemblyline.chapter.machines.energizedrancher": "The Energized Rancher will shear sheep inside its working area. Use the \"Show Area\" to button to view the area it is currently covering. The progress bar counts down the time between shearings. The Rancher can use up to 12 Range Upgrades to expand its working area.",
  "guidebook.assemblyline.chapter.machines.farmer1": "The Farmer will plant and harvest crops and trees within its working area. The colors of the input slots corrospond to the regions the items will be planted in. The Farmer must be placed underneath the land it is working. The top right slot is for Bone Meal.",
  "guidebook.assemblyline.chapter.machines.farmer2": "The \"Show Area\" button will display the working area of the Farmer. The \"Bone Full\" button toggles whether or not the Farmer will use one Bone Meal per crop, or keep using Bone Meal until the crop is fully grown. The \"Refill Empty\" button toggles whether or not the Farmer will add the seeds from harvested crops back into the planting slots. The Farmer can use up to 4 Range Upgrades to increase its working area. Note the upgrades increase the range by multiples of 3.",
  "guidebook.assemblyline.chapter.machines.mobgrinder": "The Mob Grinder will kill any mobs in its working area. Use the \"Show Area\" button to view the area it is currently covering. The progress bar counts down the time between checks. The Grinder can use up to 12 Range Upgrades to expand its working area.",
  "itemGroup.itemgroupassemblyline": "Assembly Line",
  "tooltip.assemblyline.breakingprogress": "Mining Progress: %s",
  "tooltip.assemblyline.cooldown": "Cooldown: %s ticks",
  "tooltip.assemblyline.crate": "Stores 4096 of one item",
  "tooltip.assemblyline.cratelarge": "Stores 16384 of one item",
  "tooltip.assemblyline.cratemedium": "Stores 8192 of one item",
  "tooltip.assemblyline.detector": "Emits redstone signal when an item is in front of it"
}