{
  "app.tempad.knowledge_repository": "Knowledge Repository",
  "app.tempad.new_location": "New Location",
  "app.tempad.new_location.color": "Color:",
  "app.tempad.new_location.name": "Name:",
  "app.tempad.portal_setup": "Portal Setup",
  "app.tempad.portal_setup.angle": "Angle: ",
  "app.tempad.portal_setup.front_back": "F/B: ",
  "app.tempad.portal_setup.front_back.desc": "Positive places portal in front of you, negative behind you \n\nAccepts decimal (e.g 1.3)",
  "app.tempad.portal_setup.left_right": "L/R: ",
  "app.tempad.portal_setup.left_right.desc": "Positive places portal to your left, negative to your right \n\nAccepts decimal (e.g 1.3)",
  "app.tempad.portal_setup.offset": "Offset: (-/+)",
  "app.tempad.portal_setup.up_down": "U/D: ",
  "app.tempad.portal_setup.up_down.desc": "Positive places portal higher, negative lower \n\nAccepts decimal (e.g 1.3)",
  "app.tempad.portal_setup.upright": "Is upright: ",
  "app.tempad.settings": "Settings",
  "app.tempad.settings.default_app": "Default App",
  "app.tempad.settings.default_app.subtitle": "Default app to open when right-clicking Tempad",
  "app.tempad.settings.default_macro": "Default Macro",
  "app.tempad.settings.default_macro.subtitle": "Default macro to use when shift-clicking Tempad or pressing [F] key",
  "app.tempad.settings.organization_method": "Organization",
  "app.tempad.settings.organization_method.subtitle": "Default way to organize shown locations on the Tempad",
  "app.tempad.teleport": "Teleport",
  "app.tempad.teleport.delete": "Delete",
  "app.tempad.teleport.delete_modal": "Delete Location?",
  "app.tempad.teleport.delete_modal.description": "Are you sure you want to delete this location? This action cannot be undone.",
  "app.tempad.teleport.no_selection": "No location selected. Click on a location view details",
  "app.tempad.teleport.pin": "Pin",
  "app.tempad.teleport.teleport": "Teleport",
  "app.tempad.teleport.unpin": "Unpin",
  "app.tempad.timeline": "Travel Timeline",
  "app.tempad.timeline.teleport": "Teleport",
  "app.tempad.timeline.tracking": "Tracking",
  "block.tempad.chronomark": "Chronomark",
  "block.tempad.metronome": "Metronome",
  "block.tempad.metronome.booting": "Booting: %s",
  "block.tempad.timedoor_marker": "Timedoor Marker",
  "block.tempad.timedoor_projector": "Timedoor Projector",
  "block.tempad.workstation": "Workstation",
  "block.tempad.workstation.installing": "Installing: %s",
  "block.tempad.workstation_child": "Workstation Child",
  "datapack.tempad.required_location_upgrade": "Require Upgrade for Location Saving",
  "error.tempad.block_locked": "%s is Locked",
  "error.tempad.owner_mismatch": "This isn't yours. Return to owner or Reset item",
  "item.tempad.card_wallet": "Card Wallet",
  "item.tempad.card_wallet.empty": "No cards",
  "item.tempad.card_wallet.insert_fail": "No wallet to insert card into",
  "item.tempad.card_wallet.inserted": "Inserted card into Card Wallet",
  "item.tempad.card_wallet.prefix": "Contains:",
  "item.tempad.chronometer": "Chronometer",
  "item.tempad.chronon_battery": "Chronon Battery",
  "item.tempad.chronon_cell": "Chronon Cell",
  "item.tempad.chronon_generator": "Chronon Generator",
  "item.tempad.creative_chronometer": "Creative Chronometer",
  "item.tempad.knowledge_projector": "Knowledge Projector",
  "item.tempad.knowledge_projector.card_crafting": "Location Cards are created from Iron Ingots and any Dye. The recipe produces 4 Location Cards. Alternatively one may substitute the iron for an ingot of %s and receive 16 cards from the same recipe.",
  "item.tempad.knowledge_projector.card_overview": "Location Cards record spatial coordinates for use in multiversal devices.",
  "item.tempad.knowledge_projector.card_usage": "To write location data to a card, a %s or %s is required at the correct coordinates or a standard issue %s with the coordinates already saved inside. Right-clicking the card onto a %s or %s will link the card to the device. Right-clicking the card onto the information panel for a location saved inside the %s will write the location data to the card.",
  "item.tempad.knowledge_projector.card_usage_2": "Written cards can be used to supply location data to a %s or a %s. Cards obtained from other players only function with the %s if placed into a carried %s, however all cards can be freely used with the %s.",
  "item.tempad.knowledge_projector.card_usage_3": "Placing a written Location Card into the crafting grid will wipe the data stored on the card allowing it to be reused.",
  "item.tempad.knowledge_projector.cell_crafting": "Chronon Cells can be created with materials on hand, such as Iron Ingots, Copper Ingots, Redstone Dust, and Amethyst Shards.",
  "item.tempad.knowledge_projector.cell_overview": "Chronons are essential fuel for TVA multiversal technology, thus the first step to recreating this technology is generating and storing Chronons. Primitive Chronon Cells can store Chronons and be used as materials for more advanced technology.",
  "item.tempad.knowledge_projector.cell_usage": "Empty Chronon Cells can be charged slowly over time if carried alongside a %s or a %s, or they can be placed inside a %s. Charged Chronon Cells will transfer their stored Chronons to all carried devices automatically, so long as they are all present in the main inventory or curio slots. Chronon Cells hold {X} Chronons.",
  "item.tempad.knowledge_projector.chronomark_crafting": "Chronomarks are crafted from a Block of Iron, Iron Ingots, ingots of %s, an Ender Pearl, and a block of Tinted Glass.",
  "item.tempad.knowledge_projector.chronomark_overview": "The Chronomark is a stationary block used to generate exact spatial coordinates and provide them to other devices. As an upgrade over %s, Chronomarks allow for an offset of up to %s blocks to be specified in case the user wants to mount the device on a high ceiling or bury the device under the floor. They also allow for more user filtering options.",
  "item.tempad.knowledge_projector.chronomark_usage": "To write data to a %s, place the Chronomark and right-click it with a %s. The card will then be written and can be used with %s. The %s displays Chronomarks and %ss owned by the user automatically, but written %ss can be shared with others.",
  "item.tempad.knowledge_projector.chronomark_usage_2": "Filters can be set on the Chronomark to only allow certain users to freely access the device based on available and compatible team or guild frameworks. Right-clicking the device with an empty hand brings up an interface where device name, Timedoor color, security options, and offsets can be configured.",
  "item.tempad.knowledge_projector.chronometer_crafting": "Chronometers can be created from any basic Clock, along with a few extra components. Also required will be a block of Tinted Glass, ingots of %s, and a %s.",
  "item.tempad.knowledge_projector.chronometer_overview": "Chronometers are a Chronon generation device carried by the user to passively generate Chronons for their other devices. Properly crafted Chronometers generate Chronons at a faster rate than primitive solutions.",
  "item.tempad.knowledge_projector.chronometer_usage": "Kept in the main inventory or a curio slot, a Chronometer or %s will invert the temporal decay of local background radiation to synthesize Chronons, which are then distributed to all carried devices or storage cells automatically, so long as they are all present in the main inventory or curio slots.",
  "item.tempad.knowledge_projector.chronon_battery_crafting": "Chronon Batteries can be created with %s, Iron Ingots, %ss, and Amethyst Shards, to power multiversal devices, and are the ideal way to carry Chronons on the go.",
  "item.tempad.knowledge_projector.chronon_battery_overview": "Chronon Batteries are devices for storing Chronons made from smaller cells. They hold more Chronons than individual %ss.",
  "item.tempad.knowledge_projector.chronon_battery_usage": "Empty Chronon Batteries can be charged slowly over time if carried alongside a %s or a %s, or they can be placed inside a %s. Charged Chronon Batteries will transfer their stored Chronons to all carried devices automatically, so long as they are all present in the main inventory or curio slots. Chronon Batteries hold %s Chronons.",
  "item.tempad.knowledge_projector.chronongen_crafting": "Chronon Generators can be created from any basic Clock, along with a block of Glass, Iron Ingots, and a %s",
  "item.tempad.knowledge_projector.chronongen_overview": "A Chronon Generator is a primitive device capable of generating Chronons for use with other devices.",
  "item.tempad.knowledge_projector.chronongen_usage": "Kept in the main inventory or a curio slot, a Chronon Generator or %s will invert the temporal decay of local background radiation to synthesize Chronons, which are then distributed to all carried devices or storage cells automatically, so long as they are all present in the main inventory or curio slots.",
  "item.tempad.knowledge_projector.crafting": "Crafting",
  "item.tempad.knowledge_projector.credits": "By CodexAdrian & Robonebi",
  "item.tempad.knowledge_projector.iron": "Iron",
  "item.tempad.knowledge_projector.location_broadcasters_crafting": "Location Broadcasters are crafted with a block of Glass, an Emerald, a measure of Redstone Dust, a Compass, and an Iron Ingot.",
  "item.tempad.knowledge_projector.location_broadcasters_overview": "The Location Broadcaster allow lost agents to be found and rescued by agents with specially upgraded %s.",
  "item.tempad.knowledge_projector.location_broadcasters_toggle": "The device can be used in the hand to toggle between its modes of operation. The screen on the device will glow green if teleportation is enabled, and will glow red if disabled. This allows the carrier to decide when they are open to Timedoors being opened to their location.",
  "item.tempad.knowledge_projector.location_broadcasters_usage": "If a Location Broadcaster is carried in the inventory or curio slot and is turned on, the carrier will appearin the list of possible teleports for %s with the Teleport to Players upgrade.",
  "item.tempad.knowledge_projector.marker_crafting": "They are crafted from a Block of Iron, Iron Ingots, an Ender Pearl, and a block of Glass.",
  "item.tempad.knowledge_projector.marker_overview": "The Timedoor Marker is used to generate exact spatial coordinates and provide them to other devices.",
  "item.tempad.knowledge_projector.marker_usage": "To write data to a %s, place the Timedoor Marker and right-click it with a %s. The card will then be written and can be used with the %s. The %s displays Timedoor Markers and %ss owned by the user automatically, but %ss linked to devices can be shared with others.",
  "item.tempad.knowledge_projector.marker_usage_2": "Right-clicking the device with an empty hand brings up an interface where device name, Timedoor color, and security options can be configured.",
  "item.tempad.knowledge_projector.metronomes_booted": "Once booted, the Metronome will begin to generate Chronons into its own internal battery, which holds %s Chronons. Right-clicking the device will bring up the interface, where devices can be placed to store Chronons via the left-hand slots or take Chronons via the right-hand slots. Additionally, the Metronome is coded to the user’s temporal aura, and may be locked to prevent unauthorized access via the lock button in the upper right. It is locked by default.",
  "item.tempad.knowledge_projector.metronomes_crafting": "Metronomes are crafted with Ingots of %s, Chronon Batteries, and an Ender Chest.",
  "item.tempad.knowledge_projector.metronomes_multi_charge": "If the user places additional Metronomes, after booting they will link with existing Metronomes owned by the user in a multiversal network, combining their maximum storage capacities. Linked Metronomes will also combine charging power to generate more Chronons with each pulse.",
  "item.tempad.knowledge_projector.metronomes_overview": "Metronomes are a Chronon generation device that can be placed in the world to provide a stationary solution to charging devices and storing Chronons.",
  "item.tempad.knowledge_projector.metronomes_usage": "Generally, Metronomes cannot be charged within the inventory, and instead need to be placed into the world. There is an initial charge of Chronons needed to boot the device and gain access to its functionality after it is placed. This boot charge can be provided from a %s or %s in hand by crouch-right-clicking the Metronome.",
  "item.tempad.knowledge_projector.overview": "Introduction",
  "item.tempad.knowledge_projector.projector_crafting": "Timedoor Projectors are crafted from Copper Ingots, a Glass block, an Ender Pearl, a %s and Blocks of Iron.",
  "item.tempad.knowledge_projector.projector_overview": "When a standard issue %s is unavailable, rudimentary versions of the device can be crafted using materials on hand. The Timedoor Projector is the most basic device capable of allowing teleportation via Timedoors.",
  "item.tempad.knowledge_projector.projector_timedoors": "Timedoors are doorways between two points in space and/or time. They appear as glowing panels of glass, and can be passed through in either direction like any other doorway.",
  "item.tempad.knowledge_projector.projector_timedoors_2": "Timedoors consume Chronons from the Timedoor Projector upon generation and appear for a set amount of time before closing automatically.",
  "item.tempad.knowledge_projector.projector_usage": "Timedoor Projectors allow for the creation of Timedoors to spatial coordinates read from %ss. These can be loaded into the device by right-clicking the card onto the Timedoor Projector while it is either in the inventory or placed in the world, or by right-clicking a card in the inventory while holding the projector with the cursor. Cards can be retrieved from the device by either right-clicking it on an empty inventory space, or by right-clicking the device where it is placed in the world.",
  "item.tempad.knowledge_projector.projector_usage_2": "The device can be activated while held by using it (right-click). Holding crouch and using the device will place it on the block being looked at. Placing the Timedoor Projector allows it to be triggered by a Redstone signal instead, such as from an adjacent button.",
  "item.tempad.knowledge_projector.screening_device_crafting": "Screening Devices are crafted with a block of Tinted Glass, an Emerald, a measure of Redstone Dust, a Compass, and an ingot of %s.",
  "item.tempad.knowledge_projector.screening_device_overview": "The Screening Device is an advanced version of the %s that features more advanced filtering capability.",
  "item.tempad.knowledge_projector.screening_device_usage": "On a surface level, the Screening Device provides the same functionality as the %s, allowing users with upgraded %s to open Timedoors directly to their location. Additionally, the Screening Device can also filter who is given this permission based on available and compatible team or guild frameworks. Holding the device and right-click using it will cycle the device through its available modes.",
  "item.tempad.knowledge_projector.steel": "Steel",
  "item.tempad.knowledge_projector.tempad_app_new_location": "The New Location app allows the user to save their current coordinates in the Tempad to allow for travel via the Teleport app. A map is present on the screen to help users find their bearings when saving locations. The location can be named before saving, and the user may also specify a specific color for Timedoors opened to the location.",
  "item.tempad.knowledge_projector.tempad_app_portal_setup": "When docked on a %s, the terminal provides access to the Portal Setup app, allowing for selection of a destination from the user’s docked Tempad, and for precision tweaks to the opened Timedoor’s position and rotation (plus or minus %s blocks from the default position). This app is not available without docking the Tempad. Please see the %s entry for more information.",
  "item.tempad.knowledge_projector.tempad_app_settings": "The Settings app allows users to adjust the behaviour of certain Tempad functions. The function of the Tempad’s macro button can be changed, as well as which app opens by default when the Tempad is opened.",
  "item.tempad.knowledge_projector.tempad_app_teleport": "Opening the Teleport app will present the user with a list of locations saved in the device, as well as the %ss or %ss owned by the user. Clicking these entries will populate the info panel to the right of the list, and enable the teleport button. Clicking the Teleport button will consume Chronons and generate a Timedoor to the location specified in the entry.",
  "item.tempad.knowledge_projector.tempad_app_teleport_2": "Next to the search bar, there is a button that will cycle through the available sorting modes. Locations may be sorted by dimension, alphabetical order, or by type. In all modes, locations are sorted into collapsible categories to make the list easier to view.",
  "item.tempad.knowledge_projector.tempad_app_teleport_3": "When a location is selected from the list, and the info panel to the right is populated, two additional buttons display at the bottom of the panel. The pin button will pin the location to the top of the list. Only one location may be pinned at a time. The X button will delete the location from the list. A %s right-clicked onto this information panel will be written with the location data from the saved location.",
  "item.tempad.knowledge_projector.tempad_app_travel_timeline": "With a %s docked inside the Tempad, access is gained to the Travel Timeline app. This expands the functionality of the docked %s and gives more granular control, allowing the user to move back along to more points along their timeline instead of being limited to major events.",
  "item.tempad.knowledge_projector.tempad_apps": "Apps",
  "item.tempad.knowledge_projector.tempad_crafting": "The Tempad is crafted with blocks of Tinted Glass, a piece of Nether Quartz, an Ender Pearl, a Redstone Lamp, ingots of %s, and a %s.",
  "item.tempad.knowledge_projector.tempad_overview": "The standard issue Tempad is the single most powerful piece of technology covered in this database. A Tempad can create Timedoors to any coordinates saved in the device, as well as access a docked %s to allow the user to view and move along their personal timeline.",
  "item.tempad.knowledge_projector.tempad_timedoors": "Timedoors are doorways between two points in space and/or time. They appear as glowing panels of glass, and can be passed through in either direction like any other doorway.",
  "item.tempad.knowledge_projector.tempad_timedoors_2": "Timedoors consume Chronons from the Tempad upon generation and appear for a set amount of time before closing automatically. %ss given a constant redstone signal will open a door indefinitely for a continuous Chronon cost.",
  "item.tempad.knowledge_projector.tempad_usage": "Holding the Tempad and right-clicking will bring up the Tempad’s interface as well as the user’s inventory. Tempad functionality is organized into apps and presented to the user through the app tray on the left of the interface. Clicking these app buttons will open the appropriate app within the device and give access to all of its powerful functions.",
  "item.tempad.knowledge_projector.tempad_usage_2": "Location data can be added to the Tempad for teleporting via the New Location app. To use %ss with the Tempad, please see the %s.",
  "item.tempad.knowledge_projector.time_steel_crafting": "Time Steel can be acquired in MC-21 and adjacent realms by crafting Netherite Scraps with Iron Ingots. Raw Iron to refine can be found in ore almost anywhere. Acquiring the scraps of Netherite, on the other hand, is contingent on access to a Nether dimension. It is inadvisable to get stuck on a timeline without access to these resources, as developing multiversal technology without it can lead to unstable results.",
  "item.tempad.knowledge_projector.time_steel_overview": "Time Steel is a crucial component to all advanced multiversal technology, as it is not affected by the passage of time. Thus it is a reliable material to house and shield all of the sensitive components required for traversing space and time.",
  "item.tempad.knowledge_projector.time_steel_tech_discovery": "Depending on the technology available in a given timeline, alternate or more efficient methods to produce Time Steel may be discovered. Recipe repositories may be checked for more details.",
  "item.tempad.knowledge_projector.time_twister_crafting": "It is crafted with ingots of %s, blocks of Tinted Glass, a %s, and an Ender Pearl.",
  "item.tempad.knowledge_projector.time_twister_overview": "The Time Twister is a hand-held device that allows users to move back along significant events on their personal timeline.",
  "item.tempad.knowledge_projector.time_twister_usage": "Using the Time Twister in the hand will present the user with a radial display showing points in the user’s past where they changed dimensions or died. Clicking one of the options will teleport the user back to the indicated location. Any points on the timeline forward from the selected point (options counter-clockwise from the selected point) will be destroyed to prevent paradoxes.",
  "item.tempad.knowledge_projector.time_twister_usage_2": "Note that if the selected point involves moving the user to a different dimension, new options will appear in the Time Twister for leaving your current dimension and appearing in the new one. This means that in some instances the Time Twister can appear to not be deleting future entries properly, when in fact this is a failure of the user to pay attention.",
  "item.tempad.knowledge_projector.time_twister_usage_3": "If more granularity in timeline events is required, the Time Twister can be docked with a %s to provide access to the Travel Timeline app. The Time Twister is docked by right-clicking it onto a %s in the inventory, or by right-clicking a %s onto the Time Twister. This also provides the benefit of carrying the Time Twister without it taking an extra inventory slot.",
  "item.tempad.knowledge_projector.travel_advisory": "For agents dispatched to MC-21 or adjacent realms:\n\nWhile the technology developed by the TVA is the most advanced in the multiverse, it is not capable of the impossible. Just as time doors cannot be opened to different points of time within the TVA, they cannot be opened to different points of time in MC-21 adjacent realms. Much like the TVA, time passes differently in MC-21 and all related branches, and as such, the TVA's technology is not capable of connecting different points in time within these locations. Spatial travel remains unaffected.\n",
  "item.tempad.knowledge_projector.usage": "Usage",
  "item.tempad.knowledge_projector.wallet_crafting": "Card Wallets can be crafted with Copper Ingots, Leather, and a blank %s.",
  "item.tempad.knowledge_projector.wallet_overview": "Card Wallets are a convenient way of storing and carrying a large amount of Location Cards.",
  "item.tempad.knowledge_projector.wallet_usage": "Right click the wallet in hand to open its storage. %ss may be placed in the storage for safe-keeping to keep the inventory from becoming too cluttered.",
  "item.tempad.knowledge_projector.wallet_usage_2": "Once the user obtains a standard %s, Cards inside the wallet are automatically added to the %s’s location list if they are placed inside a carried wallet. Note that this is unnecessary for a %s or a %s owned by the user, as these devices are already added to the user’s %s. What this does enable, however, is the continued sharing of location cards between users, and being able to access these shared cards via the %s’s interface.",
  "item.tempad.knowledge_projector.wallet_usage_3": "Only one Card Wallet can provide locations to the user’s %s at a given time. Priority is placed on the curio slot if available, then hotbar slots from left to right, then inventory slots from left to right, top to bottom.",
  "item.tempad.knowledge_projector.workstation_crafting": "It can be crafted with blocks of Tinted Glass, Copper Ingots, ingots of %s, and a piece of Nether Quartz.",
  "item.tempad.knowledge_projector.workstation_overview": "The Workstation is a stationary computer terminal that allows the user to accomplish various tasks when a %s is placed on the docking pad.",
  "item.tempad.knowledge_projector.workstation_usage": "Docking a %s by right-clicking it onto the docking pad unlocks the cassette slot at the back to allow the use of Upgrade Tapes. Right-clicking an Upgrade Tape into the cassette slot applies the upgrade on the tape to the docked %s, provided the specific upgrade isn’t already present on the device.",
  "item.tempad.knowledge_projector.workstation_usage_2": "When a %s is docked on the docking pad, the terminal to the left is also unlocked, allowing the user to set up a stationary teleportation device. The usage of the Workstation in this way is similar to the %s, in that it accepts a redstone signal from any side and creates a Timedoor for the user.",
  "item.tempad.knowledge_projector.workstation_usage_3": "Right-clicking on the terminal, however, opens a new Portal Setup app, allowing for selection of a destination from the user’s docked %s, and for precision tweaks to the opened Timedoor’s position and rotation (plus or minus %s blocks in any direction from the default position). Additionally, if a constant redstone signal is applied the Timedoors will remain open until the signal stops, after which it will resume its normal countdown to close.",
  "item.tempad.knowledge_repository_upgrade": "Knowledge Repository Upgrade",
  "item.tempad.location_broadcaster": "Location Broadcaster",
  "item.tempad.location_card": "Location Card",
  "item.tempad.location_card.add_location": "Right click to set location",
  "item.tempad.location_card.added_location": "Added location: %s",
  "item.tempad.location_card.created_by": "Created by: %s",
  "item.tempad.location_card.creator_toolip": "Created by %s",
  "item.tempad.location_card.dynamic_error": "You may not add player, spatial anchor, or other dynamic locations to this device",
  "item.tempad.location_card.id": "ID: %s",
  "item.tempad.location_card.redeem": "%s: [%s] To Use",
  "item.tempad.location_card.set_location": "Set location: %s",
  "item.tempad.location_card.shift_toolip": "Hold [%s] for more info",
  "item.tempad.new_location_upgrade": "New Location Upgrade",
  "item.tempad.player_teleport_upgrade": "Player Teleport Upgrade",
  "item.tempad.screening_device": "Screening Device",
  "item.tempad.screening_device.off": "Off",
  "item.tempad.screening_device.screening": "Screening: %s",
  "item.tempad.tempad": "Tempad",
  "item.tempad.time_steel": "Time Steel",
  "item.tempad.time_twister": "Time Twister",
  "key.tempad": "",
  "key.tempad.macro": "Use Tempad Macro",
  "key.tempad.new_location": "Open Tempad New Location App",
  "key.tempad.shortcut": "Open Tempad Screen",
  "key.tempad.travel_timeline": "Open Tempad Travel Timeline App",
  "upgrade.tempad.knowledge_repository": "View Knowledge Respository",
  "upgrade.tempad.new_location": "Create Saved Locations",
  "upgrade.tempad.player_teleport": "Teleport to Players"
}