{
  "name": "Simple Clicker",
  "sortnum": 7,
  "category": "justdirethings:machines",
  "icon": "justdirethings:clickert1",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "The Simple Clicker simulates a right-click, left-click, or even holding-click actions! It is useful for automating interactions like clicking buttons or attacking mobs.$(br2)The UI is complex, so lets detail it in the following pages."
    },
    {
      "type": "patchouli:text",
      "text": "The slot in the UI is what item should be used to click with.  This could be sheers for sheering sheep, or a sword for attacking mobs. It can also be left empty, if you want to click a button.$(br2)The $(l)show fake player$() button will show (using particles in world) the direction the click will occur, based on the $(l)direction$() button."
    },
    {
      "type": "patchouli:text",
      "text": "The $(l)sneak$() button will toggle 'sneak' clicking, which will simulate what happens if you sneak-click an item.$(br2)The $(l)click button$() will toggle between right click, left click, and hold click, which indicates which kind of click to use. Left click for attacking, for example, and hold click for a trident. The number under hold click is how long to hold it for before releasing."
    },
    {
      "type": "patchouli:text",
      "text": "The $(l)target$() button which specify which type of thing to click on. Target $(l)blocks$() will only click on a block in that space, while target $(l)air$() will only click if there is NOT a block in that space.$(br2)Target $(l)Hostile$() will only click on hostile mobs, like zombies, while target $(l)passive$() only hits non-hostiles, like sheep or pigs."
    },
    {
      "type": "patchouli:text",
      "text": "Target $(l)Adult$() will only hit adult mobs, like fully grown zombies or sheep, while target $(l)child$() will only target babies, like baby cows or baby zombies.$(br2)Target $(l)Player$() will only affect players.$(br2)Finally, target $(l)all living$() affects any living creature, be it a player, zombie, or baby sheep."
    },
    {
      "type": "patchouli:crafting",
      "title": "Simple Clicker",
      "recipe": "justdirethings:clickert1"
    }
  ]
}
