{
  "name": "Experience Holder",
  "sortnum": 3,
  "category": "justdirethings:machines",
  "icon": "justdirethings:experienceholder",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "The experience holder does what it says on the tin. It holds experience!$(br2)In the UI, you'll see the current levels stored (represented by the green number), and the partial levels stored (represented by the green exp bar). Clicking the + or - buttons will transfer 1 level from you (the player) to the block."
    },
    {
      "type": "patchouli:text",
      "text": "Hold Shift while clicking these buttons to transfer 10 levels at a time, and hold Ctrl while clicking to transfer ALL your levels at once!$(br2)You'll notice this has an Area of Effect on it, which serves two purposes. First of which is automating nearby player's experience levels."
    },
    {
      "type": "patchouli:text",
      "text": "Using the Number Button to the left of the - button, set the desired amount of experience a player inside the area of affect should have. Then, use the redstone control button to determine when this occurs, either on pulse (by default) or always. The machine will use the Speed (ticks) to attempt to modify nearby player(s) levels every so often."
    },
    {
      "type": "patchouli:text",
      "text": "The machine will add or remove levels to the player as needed to get that player's level at the target -- assuming of course theres enough exp stored in the machine to raise them that high!$(br2)Toggle the 'owner only' button to ensure this only gives experience to the player who originally placed the block."
    },
    {
      "type": "patchouli:text",
      "text": "Use this to automatically store your experience when you return to your base by setting it to 0, or keep your experience always at level 30 while enchanting at an enchanting table! Every time you enchant something, this machine can automatically top you off back to exactly level 30!"
    },
    {
      "type": "patchouli:text",
      "text": "In addition, there is a 'Collect Experience' button, which will attempt to find experience orbs inside the area of effect.  When this is enabled, it will absorb any exp orbs nearby, and store them.  This feature ignores the redstone state of the block, and either runs or not based on this buttons setting."
    },
    {
      "type": "patchouli:text",
      "text": "The block is a fluid tank as well, and can transfer exp points into XP Fluid at a rate of 20mb per 1 experience point.  You can interact with this block using either a bucket or the $(l:justdirethings:item_fluid_canister)Fluid Canister$(/l).$(br2)Its also possible to extract or insert the fluid using pipes or Laserio, etc.$(br2)The block will retain its experience when broken, so no worries if you need to relocate it!"
    },
    {
      "type": "patchouli:crafting",
      "title": "Experience Holder",
      "recipe": "justdirethings:experienceholder"
    }
  ]
}
