{
  "name": "Upgrade Basics",
  "sortnum": 0,
  "category": "justdirethings:upgrades",
  "icon": "justdirethings:upgrade_mobscanner",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Upgrades are installed in $(l:justdirethings:tools)Tools$(/l) or $(l:justdirethings:armor)Armor$(/l) to grant them certain abilities. They can be installed using the Smithing Table, you should be able to look the recipe up with JEI.$(br2)There are several kinds of abilities."
    },
    {
      "type": "patchouli:text",
      "text": "$(l)Use Abilities$() are used to activate. For example, Mob Scanner is a use ability that when activated will show the position of all nearby mobs.$(br2)$(l)Passive Abilities$() affect how your tool operates. For example, the hammer ability allows your tool to break in a 3x3, 5x5, or 7x7 area whenever you mine a block."
    },
    {
      "type": "patchouli:text",
      "text": "Some abilities have $(l)cooldowns$(), like the invulnerability ability will make you invulnerable for a few seconds, but can't be used again for a few minutes. Both $(l)passive$() and $(l)active$() abilities can have cooldowns, but not all of them do. See the individual upgrade sections for more details."
    },
    {
      "type": "patchouli:text",
      "text": "Abilities can be controlled using the $(l)Tool Settings Screen$() which can be activated by shift-right clicking any tool.$(br2)Once in this screen, you can access the settings for other tools by clicking on them from the UI.  For example, shift-right click a Ferricore Sword to open the UI, and then click on your Ferricore Helmet to access it's settings."
    },
    {
      "type": "patchouli:text",
      "text": "When looking at an item, you'll see an icon representing each of its abilities. You can left click this icon to toggle the ability on or off.$(br2)When off, the abilities won't activate by their hotkey if they are active, and won't cause their effects if passive.$(br2)For example, if you toggle off the hammer ability, your pickaxe will only mine 1 block."
    },
    {
      "type": "patchouli:text",
      "text": "Right click the ability to access it's options screen. For $(l)active$() abilities, you can specify which hotkey (or mouse click) activates them.$(br2)For passive abilities, the hotkey assignment will toggle it on or off when that hotkey is pressed.$(br2)Abilities can be activated or toggled even if the item isn't equipped! But first, toggle the 'activate if equipped' button to 'activate from inventory'"
    },
    {
      "type": "patchouli:text",
      "text": "This means that you can activate the 'air burst' ability, or 'ore scanner' ability, even if the wand or pickaxe isn't in your hand.  As long as its *somewhere* in your inventory, you can use these abilities.$(br2)Curios support is planned for some items."
    },
    {
      "type": "patchouli:text",
      "text": "Some abilities have custom settings as well. For example, the run speed or jump height abilities have sliders (available after Tier 2 armor), that control how much faster you run, or how much higher you jump.$(br2)Some abilities improve based on the tier of tool they are installed in. For example, the Hammer ability is 3x3 in a $(l:justdirethings:tool_blazegold_pickaxe)Blazegold Pickaxe$(/l), and 7x7 in $(l:justdirethings:tool_eclipse_alloy_pickaxe)Eclipse Alloy Pickaxe$(/l)."
    }
  ]
}
