{
  "key.category.hex_vr.hex_vr": "Hex VR",
  "key.hex_vr.draw_spell_l_simple": "Draw spell - Left hand - Simple",
  "key.hex_vr.draw_spell_r_simple": "Draw spell - Right hand - Simple",
  "key.hex_vr.draw_spell_l_advanced": "Draw spell - Left hand - Advanced",
  "key.hex_vr.draw_spell_r_advanced": "Draw spell - Right hand - Advanced",



  "hexcasting.spell.hex_vr:head_pos": "Head Purification",
  "hexcasting.spell.hex_vr:head_rot": "Seer's Purification",

  "hexcasting.spell.hex_vr:left_hand_pos": "Signaler's Purification",
  "hexcasting.spell.hex_vr:right_hand_pos": "Signaler's Purification II",

  "hexcasting.spell.hex_vr:left_hand_rot": "Pointer's Purification",
  "hexcasting.spell.hex_vr:right_hand_rot": "Pointer's Purification II",

  "hexcasting.spell.hex_vr:left_hand_vel": "Signer's Purification",
  "hexcasting.spell.hex_vr:right_hand_vel": "Signer's Purification II",


  "hex_vr.entry.vr_patterns": "VR patterns",
  "hex_vr.page.vr_patterns.0": "Takes the entity at the top of the stack and returns null if the entity is not a player or not in vr, or returns the position of the head if it is a VR Player.",
  "hex_vr.page.vr_patterns.1": "Takes the entity at the top of the stack and returns null if the entity is not a player or not in vr, or returns the direction in which the head is looking if it is a VR Player.",

  "hex_vr.page.vr_patterns.2": "Takes the entity at the top of the stack and returns null if the entity is not a player or not in vr, or returns the position of the left hand if it is a VR Player.",
  "hex_vr.page.vr_patterns.3": "Takes the entity at the top of the stack and returns null if the entity is not a player or not in vr, or returns the position of the right hand if it is a VR Player.",

  "hex_vr.page.vr_patterns.4": "Takes the entity at the top of the stack and returns null if the entity is not a player or not in vr, or returns the direction in which the left hand is pointing if it is a VR Player.",
  "hex_vr.page.vr_patterns.5": "Takes the entity at the top of the stack and returns null if the entity is not a player or not in vr, or returns the direction in which the right hand is pointing if it is a VR Player.",

  "hex_vr.page.vr_patterns.6": "Takes the entity at the top of the stack and returns null if the entity is not a player or not in vr, or returns the direction of movement of the left hand if it is a VR Player, with the magnitude as the velocity.",
  "hex_vr.page.vr_patterns.7": "Takes the entity at the top of the stack and returns null if the entity is not a player or not in vr, or returns the direction of movement of the right hand if it is a VR Player, with the magnitude as the velocity.",

  "hex_vr.page.vr_patterns.note": "Developer note: None of these patterns work if the server does not have HexVR installed."
}