{
  "book.hexerei.items_mahogany_broom_1.passage_2": "  The fastest of the three brooms. The mahogany broom as an item is fire resistant, similarly to the netherite in its creation. This doesn't protect against accidents when flying the broom into these things, unless the broom has a netherite tip attachment.",
  "book.hexerei.items_gold_rings_1.passage_2": "  A cosmetic attachment for brooms, adding a set of gold rings to their tip. These fit in the Misc slot.",
  "book.hexerei.items_broom_keychain_1.passage_2": "  A cosmetic attachment for the broom, which makes a keychain trinket of the item imprinted onto it. To imprint an item, craft the item with the chain. It fits in the Misc slot.",
  "book.hexerei.items_broom_keychain_3.passage_1": "  The imprinted item is not consumed fully. You can retrieve it by placing the Broom Chain into a crafting grid.",
  "book.hexerei.items_broom_netherite_tip_1.passage_2": "  This broom attachment is very useful for nether flight, as it allows the broom to fly through lava and fire without getting damaged. This fits into the Misc slot.",
  "book.hexerei.items_broom_waterproof_tip_1.passage_2": "  Have a base underwater but tired of falling off your broom and not being able to use it? Try the waterproof tip! This allows the player to stay on the broom while riding underwater. It fits into the Misc slot.",
  "book.hexerei.items_small_satchel_1.passage_2": "  Satchels allow the broom to store items. This one adds 9 storage slots to the broom. It fits into the Satchel slot.",
  "book.hexerei.items_medium_satchel_1.passage_2": "  The Medium Satchel is the second tier of satchel. This satchel adds 18 storage slots to the broom. It fits into the Satchel slot.",
  "book.hexerei.items_large_satchel_1.passage_2": "  The Large Satchel is the highest tier of satchel. This one adds 27 storage slots to the broom. It fits into the Satchel slot.",
  "book.hexerei.items_broom_brush_1.passage_2": "  Brushes are the most important broom attachment, as they allow the broom to fly. While flying, the brush will be damaged, and will eventually break. All brushes can be enchanted with Mending and Unbreaking to offset this, however.",
  "book.hexerei.items_wet_broom_brush_1.passage_2": "  To make a broom brush, you must first craft the wet one within a cauldron, then set it to dry in a drying rack. When finished drying, the new brush can be put on a broom.",
  "book.hexerei.items_herb_enhanced_broom_brush_1.passage_2": "  A longer lasting brush, enhanced by the herbs in its crafting. By default, it is able to fuel a broom's flight for twice as long.",
  "book.hexerei.items_wet_herb_enhanced_broom_brush_1.passage_2": "  Like the normal brush, this is made in the mixing cauldron and must be dried before use.",
  "book.hexerei.items_crow_flute_1.passage_2": "  The Crow Flute is an essential item for controlling your crow companions. It has a menu for assigning commands, selecting crows, and setting a crow's perch position.",
  "book.hexerei.items_seed_mixture_1.passage_2": "  A blend of seeds perfect for taming wild crows to act as familiars.",
  "book.hexerei.items_warhammer_1.passage_2": "  Wait a minute, this isn't a witchy item. Looks like this is more for someone like the god of thunder. Maybe a crow would like to use this item. If not, it's quite good for bashing things in the face.",
  "book.hexerei.items_sage_seed_1.passage_2": "  Sage seeds can be found by breaking grass, similar to wheat seeds. When planted on farmland they will grow into sage crops.",
  "book.hexerei.items_animal_fat_1.passage_2": "  Animal Fat is one of the items able to be used to make tallow, as well as this book. Can be obtained by killing any Cow, Pig, or Sheep, and is effected by looting.",
  "book.hexerei.items_infused_fabric_1.passage_2": "  Infused Fabric is used to craft the witch armor set, and can be made into decorative blocks and carpets.",
  "book.hexerei.items_witch_helmet_1.passage_2": "  A witch's classic hat, giving a few perks when the full set is worn. Each piece can be dyed to your liking, and renamed to give the color changing effects.",
  "book.hexerei.items_witch_chestplate_1.passage_2": "  A witch's classic attire, giving a few perks when the full set is worn. Each piece can be dyed to your liking, and renamed to give the color changing effects.",
  "book.hexerei.items_witch_boots_1.passage_2": "  A witch's classic pair of boots, giving a few perks when the full set is worn. Each piece can be dyed to your liking, and renamed to give the color changing effects.",
  "book.hexerei.items_mushroom_witch_hat_1.passage_2": "  Currently, just a cosmetic variant of the regular witch's hat.",
  "book.hexerei.items_mandrake_plant_1.passage_1": "Mandrake Plant",
  "book.hexerei.items_mandrake_plant_1.passage_2": "  One of the flowers of Hexerei, the Mandrake, can be harvested by simply right clicking it when it is fully grown just like a sweet berry bush. Can be harvested when fully grown by right clicking just like a sweet berry bush.",
  "book.hexerei.items_belladonna_plant_1.passage_1": "Belladonna Plant",
  "book.hexerei.items_belladonna_plant_1.passage_2": "  The most poisonous plant of Hexerei, the Belladonna, probably should not be consumed in any way unless prepared in the proper manner. These plants can be harvested by simply right clicking it when it is fully grown just like a sweet berry bush.",
  "book.hexerei.items_witch_hazel_sapling_1.passage_1": "Witch Hazel Sapling",
  "book.hexerei.items_witch_hazel_sapling_1.passage_2": "  Sapling used to grow With Hazel trees. Can be obtained by breaking Witch Hazel Leaves.",
  "book.hexerei.items_mindful_trance_blend_1.passage_2": "  A blend that can be applied to candles.",
  "book.hexerei.entities_index_page_1.passage_2": "  This chapter is all about entities and how you interact with them!",
  "book.hexerei.entities_index_page_2.passage_1": "Entity Index",
  "book.hexerei.entities_crow_page_1.passage_2": "  The Crow is the first familiar of many to come to Hexerei. They can be tamed with seed mixture, in two different ways. You can either throw the seeds onto the ground and nearby",
  "book.hexerei.structures_index_page_1.passage_2": "  Numerous structures dot the world wherein witches praxtice their art. The pages in this chapter will inform where to find these places, and what they might be useful for.",
  "book.hexerei.structures_index_page_2.passage_1": "Structure Index",
  "book.hexerei.structures_witch_hut_page_1.passage_2": "  Throughout the swamps, you may come across different variations of witch huts. These huts are home to witches and their tools.",
  "book.hexerei.structures_witch_hut_page_2.passage_1": "  A great place to start off as an aspiring witch!",
  "book.hexerei.structures_dark_coven_page_1.passage_2": "  Swamps are also the home of Dark Covens, structures similar to villages, but for the witches of their coven.",
  "book.hexerei.structures_dark_coven_page_2.passage_1": "  You can find various crafting tools, armor, and herbs within the covens.",
  "book.hexerei.structures_nature_coven_page_1.passage_1": "Nature Coven",
  "book.hexerei.structures_nature_coven_page_1.passage_2": "  In forests, Nature Covens may be found, though aside from some animals in some huts they are largely unpopulated, for now.",
  "book.hexerei.structures_nature_coven_page_2.passage_1": "  These places are a good source for witch tools, crows, bees, and herbs.",
  "book.hexerei.crafting_type.crafting_table": "  To craft, you need a 3x3 crafting space and the items shown below.",
  "book.hexerei.crafting_type.mixing_cauldron": "  To craft, you need a Mixing Cauldron and the items shown below.",
  "book.hexerei.crafting_type.mixing_cauldron_heated": "  To craft, you need a heated Mixing Cauldron and the items shown below.",
  "book.hexerei.crafting_type.dipper": "  To craft, you need a Mixing Cauldron with a Dipper attached and the item and fluid shown below.",
  "book.hexerei.crafting_type.herb_drying_rack": "  To craft, you need a Drying Rack and the item shown below.",
  "book.hexerei.crafting_type.pestle_and_mortar": "  To craft, you need a Pestle and Mortar and the items shown below.",
  "tooltip.hexerei.heat_source_shown": "Heat source shown: - %s",
  "block.hexerei.willow_hanging_sign": "Willow Hanging Sign",
  "block.hexerei.mahogany_hanging_sign": "Mahogany Hanging Sign",
  "block.hexerei.waxed_infused_fabric_carpet": "Infused Fabric Carpet (Waxed)",
  "block.hexerei.waxed_infused_fabric_block": "Infused Fabric Block (Waxed)",
  "block.hexerei.waxed_infused_fabric_carpet_ornate": "Ornate Infused Fabric Carpet (Waxed)",
  "block.hexerei.waxed_infused_fabric_block_ornate": "Ornate Infused Fabric Block (Waxed)",
  "block.hexerei.witch_hazel_hanging_sign": "Witch Hazel Hanging Sign",
  "item.hexerei.waxed_stone_window": "Stone Window (Waxed)",
  "item.hexerei.waxed_stone_window_pane": "Stone Window Pane (Waxed)",
  "block.hexerei.potted_mandrake_plant": "Potted Mandrake Plant",
  "block.hexerei.potted_belladonna_plant": "Potted Belladonna Plant",
  "block.hexerei.waxed_stone_window": "Stone Window (Waxed)",
  "block.hexerei.waxed_stone_window_pane": "Stone Window Pane (Waxed)",
  "gui.jei.category.blood_sigil": "Blood Sigil",
  "gui.jei.category.blood_sigil_tooltip1": "Right click the cauldron with the Sigil or place into it's sigil slot manually",
  "gui.jei.category.blood_sigil_tooltip2": "Then jump on in!",
  "gui.jei.category.bottling": "Bottling",
  "gui.jei.category.fluid_mixing": "Fluid Mixing",
  "gui.jei.category.potion_mixing": "Potion Mixing",
  "gui.jei.category.item_mixing": "Item Mixing",
  "gui.jei.category.plant_picking": "Harvest Plant",
  "gui.jei.category.plant_picking_tooltip": "Right-Click to pick like a berry bush"
}